{
    "id": "2d734s2WDb",
    "title": "VIBEID: A STRUCTURAL VIBRATION-BASED SOFT BIOMETRIC DATASET FOR HUMAN GAIT RECOGNITION",
    "abstract": "We present VIBeID, a dataset and benchmark designed for advancing non-invasive human gait recognition using structural vibration. Structural vibrations, produced by the rhythmic impact of the toe and heel on the ground, are distinct and can be used as a privacy-preserving and non-cooperative soft-biometric modality. We curated the largest dataset VIBeID consists of footfall generated structural vibrations of 100 subjects. Existing datasets in this field typically include around ten subjects and lack comprehensive exploration of domain adaptation. To thoroughly explore the domain adaptation aspect of this biometric approach, we recorded vibration data on three distinct floor types (wooden, carpet, and cement) and at three distances from the geophone sensor (1.5 m, 2.5 m, and 4.0 m), involving 40\nand 30 subjects, respectively. Additionally, we benchmarked our dataset against video recordings from 15 individuals in an outdoor setting. Beyond providing 88 hours of raw vibration data, VIBeID establishes a comprehensive benchmark for a) person identification: where the aim is to recognize individuals through their unique structural vibrations, b) domain adaptation: assessing model performance across different walking surfaces and sensor positions, and c) multi-modal comparison: comparing vibration-based and vision-based identification methods. Our experiments, using both machine learning and deep learning approaches, establish a baseline for future research in this field, and introduce a large-scale dataset for the broader machine learning community.",
    "keywords": [
        "Structural vibrations",
        "Gait Recognition",
        "Deep learning",
        "Machine learning"
    ],
    "primary_area": "datasets and benchmarks",
    "TLDR": "VIBeID offers a dataset and benchmark for person identification using structural vibrations from walking on three surfaces and three distances from sensor, enabling comparison with video-based methods.",
    "creation_date": "2024-09-27",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=2d734s2WDb",
    "pdf_link": "https://openreview.net/pdf?id=2d734s2WDb",
    "comments": [
        {
            "summary": {
                "value": "This study introduces a benchmark for gait recognition utilizing a novel structural vibration sensing technique, the geophone. and the new benchmark comprised of in total 100 subjects, collected under indoor or outdoor settings. It invesitgated whether the novel sensing modality can encode identity related information, and what is the limitations or sensitivity of this technique. Although this work addresses an interesting topic, it may not yet provide the technical depth or extensive experimental validation expected for broader applicability. There are also several concerns regarding the experimental settings and presentation clarity."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "This paper presents a well-justified study, especially it clearly identifies current research gap for person identification. Overall it reads very well."
            },
            "weaknesses": {
                "value": "* [Sample size] Probably for the gait recognition task, we are more interest in how many subjects collected. The subject size, compared with current large dataset, especially the GaitSet, is still not that comparable. \n\n* [Technical contents] I am concerned that the technical content is somewhat limited, even for a benchmark paper, for ICLR. Please consider adding more experiments and tasks to thoroughly validate the usability of this dataset, such as Re-ID, gait event detection, and generalization across subpopulations... I encourage the authors to refer to established works like GaitSet for inspiration. Gait data is highly complex, influenced by factors such as age, gender, emotion, and health conditions. Reflecting on these factors in your experiments would enhance the depth of the study.\n\n* [Applicability] I am also concerned that this kind of ambient sensor can only be applied indoor or with relatively small distances, which might limit its application, compared to wearable data?\n\n* [Experiment setup] In the experiment settings, I noticed that there were no concurrent human activity when recording the data, this may be another issue that limits the usability of this study. Additionally, will the data be sensitive to the perspective of the sensor, as I know it is quite sensitive for vision based person identification. \n\n* [Gait event] gait event detection, is this be validated in terms of accuracy?\n\n* [Dataset details] Further elaboration on the dataset’s composition and subject split for person identification would be valuable, particularly for readers unfamiliar with this topic. \n\n* [Table clarity] Table 5 is not clearly illustrated, what is the performance comparison between structural vibration and camera? Very limited information is given in both the table and the associated texts. Expanding on this comparison would help readers understand the relative strengths of each technique.\n\n* [Minor - clarification] I assume the subjects of A2, A3, A4 are part of A1, correct? Please clarify this. \n\n* [Minor - citation] When citing a work which actually does not play any role in your sentence, please use (X et al., XXXX), rather than X et al. (XXXX)."
            },
            "questions": {
                "value": "I would appreciate if the authors could address the concerns I raised in the weaknesses section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The authors built a dataset with 100 people using geophone to do multiple experiments based on the human's structural vibration. It consists of multiple covariances including floor types, and distances. The work tries to find a connection between the vibration and identities and builds multiple benchmarks."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "The paper is clear and easy to follow, and the tables and figures are easy to understand\nThe proposed question is interesting, trying to build the connection between identity and walking vibration, a fine detail when a human is walking. And authors collect a relatively large dataset in multiple conditions."
            },
            "weaknesses": {
                "value": "In real-life applications, it is hard to find a good condition to use a geophone to capture a human's gait with little noise.\n\nHow to control the noise in outdoor cases.\n\nCompared to a camera, the vibration-based method is restricted by the sensor and distance. \n\nThe protocol is not clear. How is the train and test set defined? For human identification, the identities appearing in the training set will not be present in the test set. It seems these experiments do not follow this setting"
            },
            "questions": {
                "value": "Although the authors define the floor in different classes, the hardness might be a more reliable way to classify. Since different carpets' thicknesses may have different responses. And what is the distance range for the geophone, since 4 m is not far for camera sensor"
            },
            "flag_for_ethics_review": {
                "value": [
                    "Yes, Privacy, security and safety"
                ]
            },
            "details_of_ethics_concerns": {
                "value": "Involving human data collection"
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The presented work introduces a new biometric dataset for human gait recognition based on structural vibrations. The dataset is applied to various tasks such as person identification, domain adaptation, and multi-modal scenarios combining vibration and vision-based identification methods. Experimental analysis includes verification of machine-learning and deep learning approaches."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. The description of the data collection protocol is clearly written with sufficient details and clear explanations of the research motivation\n2. The introduction and related work sections contain important background information justifying the motivation for the introduced dataset."
            },
            "weaknesses": {
                "value": "1. Is there any requirement for using a specific sensor type during the inference if trained on the presented dataset? I'm wondering about the practical implication of the proposed solution. \n2. The work indicates that the concurrent activity was not taken into account, however it's very possible to happen in real-life scenarios. Would the presented dataset be sufficient for handling such scenarios? How should one prepare for additional noise introduced in this way? \n3. It's not clear how filtering of potential noise was performed? Was the assumption that the data collection is performed in an isolated environment without any noise? You mentioned that there was environmental noise present, but how do you quantify its presence? If the assumption is that there is minimal or no noise, it again raises question around the practicality of the solution.\n4. It's not clear how the data was split for training and testing? Were the same subjects present in both subsets or did you ensure no overlap?\n5. One of the motivation behind introducing a new dataset is that other datasets contains a limited number of subjects. It's mentioned that there are 100 subjects in the proposed dataset but then only 30 and 40 subjects are used for floor types and distance measurements. Why not all 100 subjects were used for all of the scenarios?"
            },
            "questions": {
                "value": "1. What do you mean by events in Table 2?\n2. Line 407 - where is table 10? or did you mean 1?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper presents a novel dataset termed VIBEID, designed for human gait recognition using structural vibration data. The dataset includes recordings of 100 subjects across various distances, floors, and environments. Experiments demonstrate that structural vibration can serve as a viable biometric trait across different scenarios."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "- Vibration-based gait recognition introduces a novel approach for human identification.\n- The proposed baseline methods are effective.\n- This work establishes the largest-scale vibration-based dataset to date."
            },
            "weaknesses": {
                "value": "- The dataset has a limited number of subjects, although it includes over 88 hours of recorded data.\n- Compared to commonly used vision-based gait recognition, the operating distance remains relatively short.\n- The evaluation setup lacks clarity."
            },
            "questions": {
                "value": "1. To what extent do walking speed and the carrying of objects impact recognition performance?\n2. Building on question 1, does abnormal gait pose significant challenges for re-identification?\n3. The VIBEID dataset studies an operating distance range of 1.5m to 4m, while vision-based gait recognition typically works at distances over 10m. What is the distance limit for vibration sensors to capture meaningful gait signals?\n4. If there are obstructions between subjects and the sensor, is reliable recognition still possible?\n5. How does the proposed vibration-based gait recognition handle scenarios with multiple pedestrians walking simultaneously?\n6. I recommend replacing Figure 3 with a clearer version.\n7. The evaluation protocol should be more detailed."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 1
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}