{
    "id": "7BDUTI6aS7",
    "title": "Risk Quadrangle and Robust Optimization Based on $\\varphi$-Divergence",
    "abstract": "The Fundamental Risk Quadrangle (FRQ) is a unified framework linking risk management, statistical estimation, and optimization. Distributionally robust optimization (DRO) based on $\\varphi$-divergence minimizes the maximal expected loss, where the maximum is over a $\\varphi$-divergence uncertainty set. This paper introduces the \\emph{extended} $\\varphi$-divergence and the extended $\\varphi$-divergence quadrangle, which integrates DRO into the FRQ framework. We derive the primal and dual representations of the quadrangle elements (risk, deviation, regret, error, and statistic). The dual representation provides an interpretation of classification, portfolio optimization, and regression as robust optimization based on the extended $\\varphi$-divergence. The primal representation offers tractable formulations of these robust optimizations as convex optimization. We provide illustrative examples showing that many common problems, such as least-squares regression, quantile regression, support vector machines, and CVaR optimization, fall within this framework. Additionally, we conduct a case study to visualize the optimal solution of the inner maximization in robust optimization.",
    "keywords": [
        "robust optimization",
        "distributionally robust optimization",
        "convex optimization",
        "regression",
        "classification",
        "risk quadrangle",
        "risk measure",
        "$\\varphi$-divergence"
    ],
    "primary_area": "optimization",
    "TLDR": "",
    "creation_date": "2024-09-28",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=7BDUTI6aS7",
    "pdf_link": "https://openreview.net/pdf?id=7BDUTI6aS7",
    "comments": [
        {
            "summary": {
                "value": "This paper integrates the $\\phi$-divergence distributionally robust optimization into the Fundamental Risk Quadrangle framework and presents the primal and dual representation of different elements in that quadrangle. They demonstrate how common cost functions including classification, regression and portfolio optimization are fit into the framework."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 1
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "The paper provides a quite general connection between one generalized f-divergence DRO and the so-called fundamental risk quadrangle and applies to general cost functions."
            },
            "weaknesses": {
                "value": "# **Confusing Organization**\nThe paper’s organization makes it challenging to follow, especially for a theoretically-oriented work. Significant revisions would improve clarity and accessibility for a broader ML audience:\n\n-\t**Length, Example-Driven Intro**: The first three pages focus heavily on two examples, with numerous mathematical formulas, but lack emphasis on the paper’s main contribution. The connections between the mean, quantile, and extended $\\phi$-divergence quadrangle only become apprante after multiple readings, which detracts from the paper utility.\n\n-\t**Overly Technical Sections**: Secs 2 and 3 are highly technical without sufficient explanatory context. Some definitions, such as Defs 2.2., 2.3, 2.4, are only referenced once in Def 2.5 and are not essential to the main context. Moving these, along with Sec 2.3 to Appendix, would better suit a general ML audience.\n\n\n-\t**Lack of Cohesion between Sections**: Many disjointed sections create a fragmented flow. Consider reorganizing the technical results by grouping related content (e.g. combining primal-dual discussions in Secs 3 and 4 and merging Secs 5 and 6 to illustrate concrete cost function examples).\n\n-\t**Insufficient Explanation of Theorems**: Each theorem would benefit from non-technical explanations to help readers understand its meaning and implications. Currently, the lack of such interpretations makes it difficult to grasp the practical relevance of the results. For instance, the purpose and utility of Propositions 7.1, 7.2, and 8.1 are unclear from a practical standpoint—why and when would these results matter?\n\n# Unclear Contribution \nThe paper’s contributions, particularly in the examples and novel interpretations, are difficult to discern: \n\n-\t**Ambiguity in Examples**: It’s unclear what new insights the introductory examples provide. Established methods like CVaR-DRO (Example 3 in [1]) and chi-squared divergence DRO (Proposition 1 in [2]) already use duality forms, such as equations (1.14)–(1.17) and (1.2)–(1.5) being special examples. While the least squares and quantile regression examples appear novel, they lack clear interpretation. A discussion of how the robust model framework alters our perspective on these standard regressions and other cost functions would clarify the framework’s value (e.g., a new perspective?).\n\n-\t**New interpretations in Sec 6**: The interpretation in Section 4 results are unclear. Much of this material appears to be standard in DRO literature or from standard DRO duality, and the equivalence in equations (6.4)–(6.6) is not sufficiently justified. In terms of examples, Specifically, terms $R_{\\phi, \\beta}$ in (6.4), (6.7), (6.10) are not clearly explained. If these are defined based on Sec 3, should’t they follow directly from the Definition 3.1? Besides, I am struggling to find the connections between this and the risk quadrangle framework. If the intent is to show this framework is more general, then the authors should provide concrete examples illustrating this generality and explain why aspects like negative $Q$ values are important.\n# General Comments\n-\t**Suitability for ICLR**: Given its current form, I am uncertain about this paper’s suitability for an ML-focused conference like ICLR. The risk quadrangle framework may be too theoretical for a general ML audience, and the connection to robust optimization is unclear in terms of practical ML relevance.\n-\t**Notations**: The paper’s notation can be streamlined. For example, similar terms like $Q_{\\phi, \\beta}^R$ (Line 39), $Q_{\\phi, \\beta}^V$ (line 104), $Q_{\\phi,\\beta}$ (Lie 288) represent similar concept. A unified notation would improve readability.\n\nReference:\n[1] John Duchi, Hongseok Namkoong. Learning Models with Uniform Performance via DRO. Annals of Statistics. 2020.\n[2] Henry Lam. Sensitivity to serial dependency of input processes: A robust approach. Management Science. 2018."
            },
            "questions": {
                "value": "See the weakness above and another clarification question:\n\n-\tBetween Line 94 and 100, what is the choice of $\\lambda$ here, it should be $\\sqrt{\\beta}$ right?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The Fundamental Risk Quadrangle (FRQ) is a risk management framework introduced by Rockafellar and Uryasev in 2013. It integrates risk management, statistical estimation, and optimisation, providing a unified approach and broader interpretation of these problems.\n\nBy introducing specific quadrangles (i.e. a quartet of risk, deviation, regret, and error measures) based on $\\varphi$-divergence, the authors demonstrate how Distributionally Robust Optimization (DRO) can be incorporated into the FRQ framework.\n\nThe authors first derive dual representations of the quadrangle elements, providing a robust optimization perspective on certain classification, regression, and portfolio optimization problems. They then develop the primal representations, which offer tractable formulations—specifically as convex optimization problems—of the dual representations.\n\nFinally, the authors provide examples of classical problems that fall within this framework."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 1
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "The FRQ framework provides interesting link between various problems in learning and risk management. \nThe authors further this link by proposing a unified way of looking at some of those problems."
            },
            "weaknesses": {
                "value": "I found the paper very hard to read:\n- The introduction opens with two extended examples but lacks a pedagogical introduction to the FRQ framework, which may be unfamiliar to the learning community;\n- The paper lacks coherence, with many paragraphs consisting of sequences of juxtaposed sentences;\n- The purpose/message of the paper is hard to grasp;\n\nThe paper's contribution appears limited. The authors propose a general method for incorporating DRO into the FRQ framework using $\\varphi$-divergences. However, the three main examples presented in Section 5 have been well-studied in the literature, making it unclear what is novel and what was previously established."
            },
            "questions": {
                "value": "- The dual representation provides a robust optimization (RO) interpretation of the quadrangles elements. Then the authors link RO with DRO in the last paragraph of Section 3. Could the authors explain more precisely this link? In particular, line 318-319, What do they mean by \"$Q$ is the Radon-Nikodym derivate $dP_0/dP$\"? In particular, what are the distributions $P$ and $P_0$ in this case? It seems to me that for the condition $\\mathbb{E}[\\varphi(Q)] \\leq \\beta$ to be expressed as $D_\\varphi(P || P_0) \\leq \\beta$ we would need Q to be distributed according to $P_0$.\n\n- Are the examples presented in the introduction well-known in the literature? If so, could the authors provide relevant references? (Or at least provide a proof in appendix).\n\n- Are there any problems for which the proposed approach offers new primal/dual formulations?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper introduces an extension of the Fundamental Risk Quadrangle (FRQ), a framework that connects risk management, statistical estimation, and optimization. Within this framework, distributionally robust optimization (DRO) based on φ-divergence aims to minimize the worst-case expected loss, where the maximum is taken over a φ-divergence-defined uncertainty set. The authors present the extended φ-divergence and the extended φ-divergence quadrangle, integrating DRO into the FRQ framework. They derive both primal and dual representations for the quadrangle elements, including risk, deviation, regret, error, and statistic. The dual representation allows for interpreting tasks like classification, portfolio optimization, and regression as forms of robust optimization driven by extended φ-divergence. Meanwhile, the primal representation offers tractable convex formulations for these robust optimization problems. Through examples, the paper demonstrates how common problems—such as least-squares regression, quantile regression, support vector machines, and conditional value-at-risk (CVaR) optimization—fit within this unified framework. A case study is also provided, visualizing the optimal solution in the inner maximization problem of robust optimization."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 1
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "The paper attempts to unify DRO with an existing general stochasric optimization framework (FRQ), which is of theoretical interest."
            },
            "weaknesses": {
                "value": "The paper is extremely hard to read, mostly because it consists of a sequence of incoherent/not well motivated definitions and results. While I feel that the paper might have merit in terms of the topic it aims to study, I believe the authors should consider (1) restructuring the paper in a major way, making it readable and coherent, and (2) possibly resubmitting this work to a journal or some other venue allowing for longer articles -- it really feels like they tried to stuff as much material as possible in ten pages, with a very poor result in terms of presentation. Here are some more specific comments:\n\n1. In general, the authors should avoid the $a(b)$ notation to mean $a\\times b$, and should reserve it to mean \"$a$ is a function of $b$\"\n\n2. Page 2, when the authors introduce some key concepts, becomes almost unreadable. What do these concepts mean? The authors basically just present a wall of hard-to-read math;\n\n3. Page 3 is also quite hard to read -- it presents too much math without any context;\n\n4. The paper continues in the same style as the previous two points, till the very end."
            },
            "questions": {
                "value": "Although of minor importance compared to my major concerns outlined above, here are two questions:\n\n1. In the illustrative example on Large Margin Distribution Machine, what is $\\sigma(\\cdot)$ ? From usage below, I guess it denotes the standard deviation of a random variable, but that's not clear at a first reading;\n\n2. On page 2, talking about linear regression, do the authors mean $\\Vert \\cdot \\Vert$ to be the $L^2$-norm for random variables?\n\nTo be clear, I think there's many more such points that need clarification/revision throughout the text, but I think this is best left to a future major restructuring effort to put the paper in better shape."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 1
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper studies how distributional robust optimization (DRO) can be integrated into the fundamental risk quadrangle (FRQ) framework. It derives a dual and a primal formulation and presents many examples."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "The paper offers many interesting reformulations for various optimization problems."
            },
            "weaknesses": {
                "value": "I found the structure of the paper very confusing and hard to follow, and I am afraid that many of its important points are just not coming through. Without any word in the introduction the paper jumps into \"demonstrating examples\", and the reader is left without motivation until section 1.2 which appears only on the 4th page. Also, sections 7 and 8 show results without discussion or motivation.\n\nThere are many typos and weigh sentences, some examples:\n- I guess \"negative\" should not be there for \"negative asset returns\", or why do you only consider negative ones?\n- There is $\\lambda$ and $\\beta$ in the description of the Mean Quadrangle on page 2, I guess there should be some relationship between the two.\n- \"A specific case of the extended $\\varphi$-divergence quadrangle is called $\\varphi$-divergence quadrangle ...\"\n- \"The next theorem proves the dual representation of the extended $\\varphi$-divergence quadrangle.\" while the \"extended $\\varphi$-divergence quadrangle\" is a definition, it needs no proof."
            },
            "questions": {
                "value": "The equivalence of (1.6) and (1.7) does not look correct to me as the former is independent of $\\beta$ while the latter is not. In particular, if you choose $\\beta = 0$, then Q = 1 almost surely and the objective value of (1.7) is zero while (1.6) might not be. Could you comment on this, is there anything missing here?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 2
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}