{
    "id": "7L8sZYMlya",
    "title": "Enriching Knowledge Distillation with Intra-Class Contrastive Learning",
    "abstract": "Since the advent of knowledge distillation, much research has focused on how the soft labels generated by the teacher model can be utilized effectively. A study points out that the implicit knowledge within soft labels originates from the multi-view structure present in the data. Feature variations within samples of the same class allow the student model to generalize better by learning diverse representations. However, in existing distillation methods, teacher models predominantly adhere to ground-truth labels as targets, without considering the diverse representations within the same class. Therefore, we propose incorporating an intra-class contrastive loss during teacher training to enrich the intra-class information contained in soft labels. In practice, we find that intra-class loss causes instability in training and slows convergence. To mitigate these issues, margin loss is integrated into intra-class contrastive learning to improve the training stability and convergence speed. Simultaneously, we theoretically analyze the impact of this loss on the intra-class distances and inter-class distances. It has been proved that the intra-class contrastive loss can enrich the intra-class diversity. Experimental results demonstrate the effectiveness of the proposed method.",
    "keywords": [
        "Knowledge distillation; Computer vision; Contrastive learning."
    ],
    "primary_area": "applications to computer vision, audio, language, and other modalities",
    "TLDR": "",
    "creation_date": "2024-09-28",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=7L8sZYMlya",
    "pdf_link": "https://openreview.net/pdf?id=7L8sZYMlya",
    "comments": [
        {
            "summary": {
                "value": "The paper proposes a novel approach to knowledge distillation by incorporating intra-class contrastive learning to enrich the information contained in soft labels. The key contributions include:\n- A new intra-class contrastive loss function that encourages appropriate separation between samples of the same class\n- Integration of margin loss to improve training stability and convergence\n- Theoretical analysis of the relationship between intra-class contrastive loss and feature distances\n- Empirical validation on standard image classification benchmarks"
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "- Strong theoretical foundation with formal proofs for the proposed method\n- Novel perspective on enriching soft labels through intra-class information\n- Practical implementation considerations (pipeline-based caching mechanism)\n- Comprehensive empirical evaluation across multiple architectures and datasets\n- Clear connection to existing literature and proper positioning of contributions"
            },
            "weaknesses": {
                "value": "- Introducing intra-class contrastive learning and margin loss increases the complexity of the model, which may make training and tuning more difficult in practical applications with limited resources, especially in scenarios where overly complex models are not easily deployable. Provide a quantitative analysis of the increased computational complexity or memory requirements compared to standard knowledge distillation. \n- Although margin loss helps improve training stability, in cases of small datasets or unbalanced samples, intra-class contrastive loss may still lead to training instability, affecting the model's convergence speed and performance.  Provide experimental results or analysis specifically addressing the performance on small or imbalanced datasets. \n- Additionally, the experiments mainly focus on specific benchmark datasets, lacking extensive validation across different types of datasets, especially in fields such as natural language processing and time series analysis, where their applicability has not been fully assessed. \n- Tuning weight parameters (such as α and λ) requires careful consideration, increasing complexity and potentially leading to inconsistent performance. Provide a sensitivity analysis or guidelines for tuning these parameters. \n- Although the paper provides some theoretical analysis, the discussion on how intra-class contrastive loss specifically affects the model's learning mechanism is still insufficient, and further theoretical research will help to gain a deeper understanding of the principles of this method.\n- Limited novelty: The core idea combines existing concepts (contrastive learning and margin-based approaches)\n- Experimental analysis lacks ablation studies showing the individual impact of different components\n- No discussion of computational overhead introduced by the additional loss terms\n- Limited exploration of hyperparameter sensitivity, especially for λ and margin threshold δ\n- Results on CIFAR-100 and Tiny ImageNet show only modest improvements over existing methods"
            },
            "questions": {
                "value": "Although the paper mentions that margin loss improves training stability, if unstable phenomena are observed in experiments, it is recommended that the authors provide more details on training stability analysis and coping strategies, including experimental results under different hyperparameter settings. The experiments mainly focus on specific image classification datasets, and it is suggested to expand the scope of experiments to cover text, audio, or time series data to verify the generality and applicability of the method. In addition, it is recommended to provide more detailed parameter tuning guidelines to help researchers effectively select weight parameters (such as α and λ). Finally, it is suggested to delve into the theoretical basis of intra-class contrastive loss to fully understand its specific impact on the model's learning mechanisms.\n1. How does the computational complexity compare to standard knowledge distillation?\n2. What is the sensitivity of the method to the choice of λ and δ?\n3. How does the pipeline-based caching mechanism affect training time?\n4. Can you provide ablation studies showing the individual contribution of intra-class contrastive loss and margin loss?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper proposes the Margin-Based Intra-Class Contrastive Distillation approach, which integrates intra-class contrastive learning with traditional knowledge distillation."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "This paper is well-written and well-structured."
            },
            "weaknesses": {
                "value": "1. The idea of ​​enhancing knowledge distillation via contrastive learning is not innovative.\n2. Based on the experimental results, the improvement of the proposed method is not significant."
            },
            "questions": {
                "value": "Here are some concerns that need to be addressed.\n1. The idea of ​​enhancing knowledge distillation via contrastive learning is not innovative.\n2. Based on the experimental results, the improvement of the proposed method is not significant.\n3. Following the previous work, the author needs to add experimental analysis results on the ImageNet and MS COCO datasets.\n4. Moreover, the authors need to add relevant analysis regarding the efficiency of the proposed method compared to the state-of-the-art baselines, including training time."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper proposes a contrastive learning method for training the teacher model in knowledge distillation, aiming to provide student models with richer intra-class information from the teacher model."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "The paper observes that the teacher model trained with ground truth may lack intra-class information for students, which is interesting and meaningful.\n\nThe paper is well-written and easy to follow."
            },
            "weaknesses": {
                "value": "1) The paper claims that the proposed method improves training stability and convergence speed; however, there are no experiments demonstrating this advantage.\n\n2) There is a lack of ablation studies on the threshold \\theta and batch size (batch size is an important hyperparameter for contrastive learning).\n\n3) The proposed method requires retraining the teacher models and lacks a comparison of the time required.\n\n4) There is a lack of experiments on large datasets like ImageNet.\n\n5) Without RKD, the proposed method underperforms compared to existing methods.\n\n6) It would be better to compare to the dynamic temperature methods [1] and other state-of-the-art methods like [2]."
            },
            "questions": {
                "value": "1) Why not use the common hyperparameter settings for KD? For example, for CIFAR-100, use 240 epochs with a learning rate of 0.05 and a batch size of 64 [3].\n\n2) What teacher models were used for the baseline methods?\n\n3) What is the performance of the proposed method when combined with other baseline methods?\n\n4) The experiments lack CRD [3], which proposed contrastive learning for KD.\n\n5) please address W1-4.\n\n6) It would be better to have a comparison to a teacher trained with inter-class loss.\n\n[1] Li, Z.; Li, X.; Yang, L.; Zhao, B.; Song, R.; Luo, L.; Li, J.; and Yang, J. 2023. Curriculum temperature for knowledge distillation. In Association for the Advancement of Artificial Intelligence (AAAI)\n\n[2] Sun, S.; Ren, W.; Li, J.; Wang, R.; and Cao, X. 2024. Logit Standardization in Knowledge Distillation. In Proc. IEEE Conf. on Computer Vision and Pattern Recognition (CVPR).\n\n[3] Tian, Y.; Krishnan, D.; and Isola, P. 2020. Contrastive representation distillation. Proc. Int. Conf. on Learning Representation (ICLR)"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper introduces an intra-contrastive loss that pulls an augmented sample closer to its original counterpart while pushing other samples from the same class farther apart in the teacher model's embedding space. The teacher model is trained using a combination of intra-contrastive loss and cross-entropy loss, balanced by a weighting factor, $\\lambda$. This approach aims to distill richer intra-class knowledge and inter-class knowledge from the teacher model to the student model. However, the authors identify three problems associated with this training loss that lead to instability in the training phase and slow convergence. To address these issues, the paper proposes a margin loss that applies intra-contrastive loss only to samples whose predicted probability for the ground-truth label exceeds a threshold during training. To validate the proposed loss, they define inter-class and intra-class distance metrics and demonstrate that the proposed intra-class and inter-class losses correspond to their respective metrics. Additionally, they prove that $\\lambda$ can adjust the trade-off between intra-class and inter-class separation."
            },
            "soundness": {
                "value": 1
            },
            "presentation": {
                "value": 1
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "Based on the theoretical proof, this paper implements the trade-offs between intra-class and inter-class separation. These theoretical results can inspire the ICLR community."
            },
            "weaknesses": {
                "value": "In the theoretical sections, to prove Theorem 1 and Theorem 2, this paper assumes that the cross-entropy loss is equivalent to the inter-class contrastive loss. However, they doesn't demonstrate  that these two loss functions serve a similar purpose, either theoretically or experimentally. Could you explain, if your assumption holds, why you did not use the inter-class contrastive loss directly for training the teacher model instead of the cross-entropy loss? For Theorem 1, the paper defines two distance metrics but does not demonstrate whether these metrics satisfy the four conditions required for a valid distance function (metric space). \n\nBased on these theorems, this paper trains the teacher model to enrich intra-class information, whereas other methods simply utilize an already trained teacher model. However, the paper does not demonstrate the effectiveness of training the teacher model and distilling knowledge to the student, even at the expense of increased training cost. Specifically, the experiments do not report the results of the teacher model trained with their loss, nor do they compare the student model’s improved performance when combined with other KD methods (beyond RKD) against the additional parameters that need to be trained. Furthermore, could you provide experimental results for directly training the student model using  your proposed losses (CE and margin) along with knowledge distillation loss, rather than just distilling knowledge through the teacher model trained with those losses?"
            },
            "questions": {
                "value": "1. Could you provide any theoretical or experimental demonstrations to support your assumption that cross-entropy loss is equivalent to inter-class contrastive loss?\n2. If your assumption holds, could you explain why you did not directly use the inter-class contrastive loss for training the teacher model instead of cross-entropy loss?\n3. Could you show that your two distance metrics (inter-class and intra-class distance) satisfy the four conditions required for a valid distance function (metric space)?\n4. In section 3.1, you define the sample space($\\mathcal{X}$), the label space($\\mathcal{Y}$) and the hypothesis space($\\mathcal{F} : \\mathcal{X} \\rightarrow \\mathcal{Y}$) then refer to the classifier as $f \\in \\mathcal{F}$. However, shouldn't it be represented as $\\mathcal{F} : \\mathcal{X} \\rightarrow \\mathbb{R}^d(d>c)$, similar to the feature embedding function $\\varphi$ described in Section 4.1?\n5. Could you report  the results of the teacher model trained with your loss?\n6. Could you compare the student model’s improved performance when combined with other KD methods (beyond RKD) against the additional parameters that need to be trained?\n7. Could you provide experimental results for directly training the student model using  your proposed losses (CE and margin) along with knowledge distillation loss, rather than just distilling knowledge through the teacher model trained with those losses?\n8.  Could you verify whether Sohn (2016a) and Oord et al. (2018) on page 2 indeed employ augmented samples as positive samples and other samples from the same class as negative samples?\n9.  Could you report the test accuracy and test loss curves for at least one type of teacher model to illustrate instability and slow convergence during training?\n\nThings to improve the paper that did not impact the score:\n1.  Please follow the formatting instructions of ICLR regarding citations within the text, ensuring that \\citep{} and \\citet{} are used appropriately.\n2.  Possible typo: In line 5 of the Contrastive Learning section on page 3, \"Constrastive earning\" should be corrected to \"Contrastive learning.\"\n3.  Please differentiate between scalar and vector forms in your mathematical notation.\n4.  Please clarify whether $f$ indicates $f_t$ or $f_s$ in Equations (4) and (7).\n5.  To my knowledge, existing methods utilize KL-divergence for knowledge distillation. Strictly speaking, While KL-divergence and cross-entropy loss may function similarly in knowledge distillation, they are mathematically different. Please clarify the mathematical differences in Equations (2) and (3).\n6. What type of augmentation techniques did you use for positive samples in the intra-class loss?\n7. what values did you set for $\\delta$ in the margin loss?\n8. Please unify the notation for referencing equations, such as whether to use \"Equation 5,\" \"Eq. 5,\" or simply \"5.\""
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "In this manuscript, the authors present a knowledge distillation method named Margin-Based Intra-Class Contrastive Distillation. The proposed method incorporates an intra-class contrastive loss to enrich the soft labels generated by the teacher model during training, which encourages the teacher to learn diverse representations within each class, thereby providing a richer knowledge transfer to the student model."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. The manuscript provides a theoretical analysis to demonstrate the impact of intra-class contrastive loss on the model's representation learning as well as the quantitative relationship between intra-class and inter-class distances. \n2. The margin loss is proposed to improve training stability and convergence speed which may cope with the intra-class contrastive loss.\n3. Experimental results show good performance against comparison methods.\n4. This manuscript is well-written and clearly organized, where the introduction section effectively motivates the knowledge distillation problem and highlights the key contributions of this manuscript."
            },
            "weaknesses": {
                "value": "1. The novelty of this manuscript is minor. There are works concerned with intra-class distance, such as \"CKD: Contrastive Knowledge Distillation from A Sample-Wise Perspective\". CKD employs intra-sample similarities and inter-sample dissimilarities and formulates these constraints into a contrastive learning framework. The authors should claim the difference against CKD and compare with it.\n2. The theoretical analysis only concentrates on relationships between intra-class and inter-class distances for the selection of parameter \\lambda. However, it may lack a deeper exploration of how intra-class diversity truly affects the performance of the student model.\n3. The experimental results are not convincing. First, the comparison methods should include baselines that specifically address intra-class diversity. Second, the evaluation datasets are limited, previous methods conduct experiments on CIFAR-100, MS-COCO, and ImageNet-1K for image classification and object detection. Third, the ablation study is not provided to prove the effectiveness of intra-class and inter-class distances. Moreover, more network architectures should be used for comparison.\n4. Missing key references, such as \"PromptKD: Unsupervised Prompt Distillation for Vision-Language Models\" and \"CKD: Contrastive Knowledge Distillation from A Sample-Wise Perspective\".\n5. The format of some references is not correct."
            },
            "questions": {
                "value": "Suggestions:\n1. more comparisons with recent knowledge distillation methods, especially those that use contrastive learning.\n2. provide ablation studies to assess the contributions of margin loss and intra-class losses.\n3. more evaluation datasets and network architectures."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}