{
    "id": "9U8IwSewJy",
    "title": "Mixture-of-Queries Transformer: Camouflaged Instance Segmentation via Queries Cooperation and Frequency Enhancement",
    "abstract": "Due to the high similarity between camouflaged instances and the surroundings and the widespread camouflage-like scenarios, the recently proposed camouflaged instance segmentation (CIS) is a challenging and relevant task. Previous approaches achieve some progress on CIS, while many overlook camouflaged objects’ color and contour nature and then decide on each candidate instinctively. In this paper, we contribute a Mixture-of-Queries Transformer (MoQT) in an end-toend manner for CIS which is based on two key designs (a Frequency Enhancement Feature Extractor and a Mixture-of-Queries Decoder). First, the Frequency Enhancement Feature Extractor is responsible for capturing the camouflaged clues in the frequency domain. To expose camouflaged instances, the extractor enhances the effectiveness of contour, eliminates the interference color, and obtains suitable features simultaneously. Second, a Mixture-of-Queries Decoder utilizes multiple experts of queries (several queries comprise an expert) for spotting camouflaged characteristics with cooperation. These experts collaborate to generate outputs, refined hierarchically to a fine-grained level for more accurate instance masks. Coupling these two components enables MoQT to use multiple experts to integrate effective clues of camouflaged objects in both spatial and frequency domains. Extensive experimental results demonstrate our MoQT outperforms 18 state-of-the-art CIS approaches by 2.69% on COD10K and 1.93% on NC4K in average precision.",
    "keywords": [
        "image segmentation",
        "transformer"
    ],
    "primary_area": "applications to computer vision, audio, language, and other modalities",
    "TLDR": "",
    "creation_date": "2024-09-24",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=9U8IwSewJy",
    "pdf_link": "https://openreview.net/pdf?id=9U8IwSewJy",
    "comments": [
        {
            "summary": {
                "value": "In this paper, the authors tackle the problem of camouflaged instance segmentation (CIS). To this end, the authors proposed Mixture-of-Queries Transformer (MoQT). The experiments on COD10K and NC4K show that the MoQT outperforms other CIS baselines."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "+ The paper is well-organized and easy to follow. \n+ The proposed work outperforms 18 CIS baselines on COD10K and NC4K. \n+ The authors did perform the ablation study to show the effectiveness of each component in MoQT."
            },
            "weaknesses": {
                "value": "+ There is a concern about the novelty. The authors explore frequency domain for feature extraction which is not new. The idea of using experts (several queries comprise an expert) is not new either. \n+ The number of decoder layers, L, is questionable. There is a huge gap between 4 and 12. Why did the authors choose 6?\n+ The visualization is not clear. How about the failure cases? How about the case of no camouflaged instance?"
            },
            "questions": {
                "value": "+ I have question about the novelty. \n+ There is a question about the parameters such as the number of decoder layers."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper aims to explore the influence of contour and color for discovering camouflaged instances and utilizes MoE technology to localize the multiple instances of camouflaged objects. First, the Frequency Enhancement Feature Extractor is proposed to capture the camouflaged clues in the frequency domain. To expose camouflaged instances, the extractor enhances the effectiveness of contour, eliminates the interference color, and obtains suitable features simultaneously. Second, a Mixture-of-Queries Decoder utilizes multiple experts of queries for spotting camouflaged characteristics with cooperation. The proposed MoQT achieves SOTA performance and outperforms 18 camouflaged instance segmentation methods on COD 10K and NC4K datasets."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. This paper attempts a new respective to explore the concealed attribute of camouflaged instances: the visual cues of camouflaged objects are concealed, but the other domain (like frequency) cues of camouflaged objects are not completely hidden, which allows deep parsing of camouflage detection and segmentation. This idea is interesting and worth emulating.\n2. The ablation experiments are sufficient.\n3. The presentation of the paper is easy to understand, including some visual comparisons, etc."
            },
            "weaknesses": {
                "value": "1. The proposed MoQT employs the Fourier transform to obtain color and contour features. But introduction of Fourier transform is similar to the previous work CamoFourier:\nUnveiling Camouflage: A Learnable Fourier-based Augmentation for Camouflaged Object Detection and Instance Segmentation, arXiV, 2023\n2. Compared with the vanilla query-based decoder, the MoQ decoder introduces a Mixture-of-Queries (MoQ) layer with initialized M experts. Then, the M+1 outputs of the MoQ layer are aggregated via an adaptive weight. The novelty of MoQ is limited. The improvement of the query mechanism is a novel approach, but the proposed MoQ is only a token aggregation method. Besides, each layer of the MoQ decoder introduces initialized experts, which should hurt cross-attention enhanced query tokens. That sounds unreasonable.\n3. The structure of Fig. 4 is not consistent with Eq. (4). The aggregated query tokens of multiple experts are input the vanilla query-based decoder in Eq. (4). But, the Fig. 4 does not present this process. Actually, the layer of MoQ decoder is twice the one of vanilla query-based decoder."
            },
            "questions": {
                "value": "1. I suggest that the author clearly compares this method with existing query-based transformer methods, and explicitly states the advantages and innovations of the method proposed in this paper.\nOSformer: One-stage camouflaged instance segmentation with transformers. In European conference on computer vision, 2022\nCamouflaged instance segmentation via explicit de-camouflaging. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, 2023\nA unified query-based paradigm for camouflaged instance segmentation, ACM International Conference on Multimedia, 2023\n2. I suggest that authors provide a more in-depth comparison with CamoFourier, highlighting any specific differences in how they utilize Fourier transforms and discussing how their approach advances beyond CamoFourier's techniques.\n3. Authors should add some CIS methods from 2024 for comprehensive evulation, such as GLNet. Authors are suggested to directly compare their results with GLNet’s.\nCamouflaged Instance Segmentation From Global Capture to Local Refinement, IEEE Signal Processing Letter, 2024.\n4. The author should clearly articulate the number of query tokens used on each dataset and verify the impact of varied query token counts on different datasets.\n\nIn summary, the author should clearly elucidate the contributions of FEFE and MoQ to assess whether the paper meets the quality standards for acceptance at ICLR. For FEFE, simply using Fourier transform is not sufficient. For MoQ, aggregating multiple experis with query tokens and then inputing transformer decoder layers, this technology is not novel enough."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper proposes the Mixture-of-Queries Transformer (MoQT), a new model for camouflaged instance segmentation (CIS). The main contributions include: 1) Frequency Enhancement Feature Extractor (FEFE): This module leverages frequency-domain transformations to emphasize object contours and minimize color interference, aiding in detecting camouflaged instances by focusing on contour details rather than color; 2) Mixture-of-Queries Decoder (MoQ Decoder): This component employs multiple groups of object queries in a hierarchical framework, enhancing segmentation precision by refining masks at each layer. The model was benchmarked against 18 state-of-the-art CIS models and showed improved performance on the COD10K and NC4K datasets, with gains of 2.69% and 1.93% in average precision, respectively."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. The paper introduces a novel approach to camouflaged instance segmentation (CIS) with the Frequency Enhancement Feature Extractor (FEFE) and Mixture-of-Queries Decoder (MoQ Decoder). These components creatively combine frequency-domain analysis and hierarchical query collaboration, offering a unique solution to the challenge of segmenting camouflaged objects.\n\n2. The approach is rigorously validated, outperforming 18 state-of-the-art methods on key datasets. The paper's ablation studies and parameter analyses reinforce the model’s robustness and effectiveness, showcasing thorough and high-quality experimentation.\n\n3. The paper is well-structured, clearly explaining its methods and their significance. Visual aids, including performance tables and diagrams, enhance understanding, and the rationale for each component is presented logically."
            },
            "weaknesses": {
                "value": "1. Insufficient Baseline Comparisons: While the paper includes comparisons with several CIS methods, it does not fully explore benchmarks with generic instance segmentation methods that could also apply to camouflaged segmentation. Including results for generic transformers or non-CIS-specific models with adaptations for camouflage (e.g., baseline Mask DINO [1] with FEFE added) would clarify the advantage of MoQT over generalized solutions.\n\n2. The originality of Frequency Enhancement Feature Extractor (FEFE): The paper asserts that frequency domain-based contour enhancement is effective for CIS, but frequency domain analysis for camouflage object detection has already proposed by previous works like [2][3]. Although these works are dedicated for COD, the methodology of locate the camouflage objects is similar to CIS task.\n\n3. Interpretability of the MoQ Decoder: Although the multi-expert query mechanism is innovative, the paper lacks insight into how each “expert” in the MoQ Decoder contributes uniquely to segmentation refinement. Visual or quantitative analysis of the individual contributions of each expert group in the MoQ Decoder would help to illustrate why this design is optimal and inform future work on multi-query designs.\n\n[1] Mask DINO: Towards A Unified Transformer-based Framework for Object Detection and Segmentation, CVPR 2023\n\n[2] Detecting Camouflaged Object in Frequency Domain, CVPR 2022\n\n[3] Detecting Camouflaged Object in Frequency Domain, TOMM 2023"
            },
            "questions": {
                "value": "1. Did the authors consider adapting standard segmentation models (e.g., Mask DINO, SAM) for CIS by incorporating frequency-domain enhancements like FEFE? If so, how did MoQT compare?\n\n2. Why did the authors choose Fourier transforms over other frequency-based methods, such as wavelet transforms, for capturing contour information?\n\n3. Can the authors visualize or quantitative analysis of the individual contributions of each expert group in the MoQ Decoder ?\n\n4. Did the authors consider MoQT’s applicability to other segmentation tasks where objects are not necessarily “camouflaged” in the traditional sense?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper presents a Mixture-of-Queries Transformer (MoQT) designed for camouflaged instance segmentation (CIS). It incorporates two main components: a Frequency Enhancement Feature Extractor (FEFE) and a Mixture-of-Queries Decoder. The FEFE captures camouflaged clues in the frequency domain by enhancing contours, eliminating interference colors, and extracting suitable features. The Mixture-of-Queries Decoder uses multiple experts of queries to spot camouflaged characteristics cooperatively, refining outputs hierarchically for accurate instance masks. Experimental results show that MoQT outperforms 18 state-of-the-art CIS approaches on COD10K and NC4K in average precision."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "The approach shows significant improvement over existing methods, as demonstrated by extensive experimental results on COD10K and NC4K datasets, highlighting its practical applicability and potential impact in the field."
            },
            "weaknesses": {
                "value": "1. Lack of Innovation: The proposed frequency domain feature extraction method closely resembles those in \"Unveiling Camouflage: A Learnable Fourier-based Augmentation for Camouflaged Object Detection and Instance Segmentation\" and \"Camouflaged Instance Segmentation via Explicit De-camouflaging.\" The Mixture-of-Queries Mechanism is also similar to the Multi-scale Unified Query Learning mentioned in \"A Unified Query-based Paradigm for Camouflaged Instance Segmentation,\" without adequately explaining the main differences.\n\n2. Writing and Expression Errors: There are several grammatical and expression errors in the manuscript. For example, lines 156-157 contain mistakes where \"combines\" should be \"combine\" and \"camouflaged objection detection\" should be \"camouflaged object detection.\""
            },
            "questions": {
                "value": "1. On line 296 of the manuscript, when you mention initializing M experts E, are you referring to Positional Embeddings?\n\n2. In line 320, it is stated that \"our MoQ Decoder does not contain just one group of queries for capturing various instances but multiple groups of queries in each MoQ Layer.\" How are these groups designed and divided? The number of groups is not specified.\n\n3. It is suggested to provide the code to help readers better understand the novelty of the proposed method."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}