{
    "id": "9wjGUN65tY",
    "title": "From Steering Vectors to Conceptors and Beyond: Compositional Affine Steering Mechanisms for LLMs",
    "abstract": "Controlling and understanding the representations of large language models (LLMs) remain central challenges as they become more powerful. In this paper, we combine conceptor theory with recent advances in activation steering to develop a novel framework that generalizes both approaches for provably optimal affine steering. Conceptors characterize sets of neural network activations, representable as ellipsoids, and they act as soft projection matrices, enabling precise and flexible control over LLM activations while offering deeper insights into their internal representations. Our framework derives optimal affine steering functions from first principles, outperforming traditional additive steering methods across in-context learning tasks. Additionally, we use a Boolean algebra over conceptor matrices that allows for the composition of multiple steering objectives. Empirical results demonstrate that this approach surpasses existing methods for combining steering vectors. By uniting conceptor theory with activation steering, this work provides not only a more powerful tool for controlling LLM outputs, but also a principled approach for better understanding the internal mechanisms governing model representations and behavior.",
    "keywords": [
        "activation engineering",
        "mechanistic interventions",
        "model steering",
        "large language models",
        "activation addition",
        "function vectors"
    ],
    "primary_area": "interpretability and explainable AI",
    "TLDR": "We derive an optimal method for affine steering of representations in LLMs that improves over prevalent additive methods, and we provide empirical results that demonstrate improved control and flexibility across multiple tasks.",
    "creation_date": "2024-09-28",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=9wjGUN65tY",
    "pdf_link": "https://openreview.net/pdf?id=9wjGUN65tY",
    "comments": [
        {
            "summary": {
                "value": "This paper introduces a new method for affine steering in LLMs by using conceptors. The author uses conceptor theory to present a theoretical framework for activation steering and conducts experiment to demonstrate the effectiveness of the proposed method."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 1
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. The author empirically shows the effectiveness of conceptor steering."
            },
            "weaknesses": {
                "value": "1. Figure 1 is not referenced in the main text and lacks description (what are green and yellow dots and I'm still confused what's the difference between additive and conceptor steering).\n2. Many terms not well-explained (see questions below) and lacks clarity, making this paper hard to understand.\n3. The use of \"performant\" is abrupt in line 210. How to define \"performant\" and what makes previous method not \"performant\"?\n4. Section 3 is unclear. The method used here can be better explained.\n\nMinor issues:\n1. Line 184 \"$\\rightarrow$\" instead of \"$\\mapsto$\".\n2. Line 230 $h$ --> $\\mathbf{H}$?"
            },
            "questions": {
                "value": "1. What is $\\phi(s)$ in line 144?\n2. What is $c'$ in equation (5)? Is it equivalent as saying $\\phi(s)\\neq c$ for the first line?\n3. What does \"optimal\" mean in line 203? What is guardedness in line 202 and 208?\n4. \"As we do not want to rely on the concept function $\\phi$ to apply our steering function $\\phi$ to apply our steering function, we instead rely only on the concept-conditional convariance matrix $\\Sigma_c$ -- why? The motivation is not well-explained.\n5. For Figure 2 and 3 can you show the accuracy when provided with in-context examples?\n6. Overall I am confused on how the proposed method works explicitly and how does it different from the procedure in Todd et al. (2024)? I would like to understand the difference so I can better understand the proposed method in this paper. Furthermore, I was a bit confused what does a better steering method mean. By looking at plot 2 and 3, can we say that a steering method is better if it can better extract features to represent the task?\n\n---\nOverall by looking at the experiment result it seems this paper proposes a method that extracts task features more effectively but the paper lacks clarity on how this method works."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper explores the theory and practice of conceptors, a tool developed for controlling recurrent neural networks, to steer the output of a Large Language Model. It first generalizes the theory of conceptors, highlighting how the optimal steering functions can be computed by estimating statistics of an LLM's activations, and then evaluates the method on standard activation steering benchmarks, showing it outperforms common approaches."
            },
            "soundness": {
                "value": 4
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "- The approach provides a theoretically motivated alternative to existing (e.g., contrastive) LLM activation steering methods.\n- The method outperforms the standard additive activation steering approaches on commonly employed benchmarks.\n- The paper nicely connects previous work on recurrent neural networks and modern efforts in controlling Large Language Models."
            },
            "weaknesses": {
                "value": "- No error bars are reported in any of the plots and table.\n- There are some minor formatting issues in the paper (e.g., see the positioning of Figure 3).\n- Only rather outdated and small open weights models are used for the analysis.\n- There are potential concerns about computational cost compared to alternatives."
            },
            "questions": {
                "value": "- What are the limitations of the approach in terms of computational cost? Does it get prohibitive when larger models (e.g., the largest available open weight models) are used?\n- What is the variation across runs? Can you plot the error bars?\n- Can you give a more complete explanation of why it is justified to call the steering function defined in Definition 9 as optimal?\n- Could you evaluate the method with a more recent LLM? (e.g., Llama)"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The authors propose a novel 'conceptor'-based class of steering functions for activation engineering. They derive a Boolean algebra for the logical composition of different conceptors. They compare their approach to previous work on function vectors and steering vectors and show that conceptors achieve a strictly higher steering accuracy for all tasks at all choices of layer."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "Originality: Good. The method being proposed is novel and differs substantially from other works within the space of steering interventions. \n\nQuality: Fair. While the principles seem sound, I have some concerns as to the validity of the experimental results, as well as the authors' claims. More details are provided in 'Weaknesses' below. \n\nClarity: Fair. The bulk of the paper focuses on building up to deriving the optimal linear and affine steering functions (Propositions 1,2). I found this derivation hard to follow as the derivation introduced many distinct terms (Definitions 1-4, 8-9) which were difficult to keep track of mentally. Furthermore, relatively little mental scaffolding was included to help the reader build intuition about the meaning of the intermediate steps. I would have preferred if the derivation had been summarised and / or moved to the Appendix, with the main paper simply stating the optimal affine steering intervention (Proposition 2) and focusing on building intuition for the reader. This would also have cleared up more space for results. \n\nSignificance: Fair, assuming the results and claims in the paper are correct. The paper provides a sign of life that conceptors can outperform simpler steering approaches. However, this method is also more difficult to apply, requiring an additional hyperparameter search, which may not be justified by the relative improvement over simpler, hyperparameter-free baselines. From an interpretability perspective, there is a lack of a central take-away insight from the paper. As a point of reference, the original function vectors paper (Todd et al, 2024) yields the insight that 'language models represent concepts as vectors' in activation space. The conceptor-based approach does not yield a similarly crisp insight into the geometry of language models' representation space. From an empirical alignment perspective, the results are relatively shallow (only 1 main set of experiments). Furthermore, the tasks considered are toy-ish and do not reflect realistic use cases for language model alignment. Overall, the paper is of limited significance to the broader alignment field."
            },
            "weaknesses": {
                "value": "The advantage of conceptors over baselines seems somewhat incremental. In Table 1, for 2 out of 5 tasks (capitalize and present-past), conceptors did not meaningfully outperform the addition baselines. On the remaining 3 out of 5 tasks, a substantial fraction of the improvement can be attributed to mean-centering (compare Addition-MC with Addition). Furthermore, while the paper seems to propose affine conceptors as the most general method, the benefit over linear conceptors was negligible. \n\nI am concerned that the demonstrated advantage of conceptors could be partially due to hyperparameter optimization. Conceptor-based steering introduces an additional 'aperture' parameter which is optimised on a per-dataset basis, whereas the baseline of steering vectors does not require such a parameter. In order to do a fair comparison, I think the authors should restrict themselves to a single global choice of aperture parameter across the 6 tasks. It would also be important to include a discussion on the effect of non-optimal choices of the aperture parameter. \n\nThe paper claims to unify affine steering functions (Singh et al, 2024) and additive steering functions (Turner et al, 2023). However, the experiments section only includes comparisons to the latter. Given the scope of the authors' claims, it seems important to also have the comparisons to the former. \n\nLittle analysis and discussion is provided to allow the reader to understand why conceptors improve over baselines. I think the paper would be much more exciting if it could state the specific assumptions on representational geometry that conceptors target (similar to how steering vectors target linear geometry), and then demonstrate that this geometrical structure is present in language models. See [1] for a reference work where I think this is achieved. \n\nAs stated above, the methods section is difficult to follow and could probably be shortened. \n\n[1] https://arxiv.org/abs/2311.03658"
            },
            "questions": {
                "value": "What is the purpose of Definition 1? It seems like phi-assisted steering functions are not referred to again after being introduced here. \n\nWhat is the motivation for solving the specific optimization problem in Definition 4? How do the individual terms in the loss function connect to downstream properties we care about? In particular, I’m not sure why we want the steering function C to satisfy H_c \\approx CH_c, which is what the first term is incentivising, and I’m also not sure why we want C to have small norm, which is what the second term is incentivising.\n\nIn Figure 1, the conceptor steering operation is illustrated as 'projecting' all activations to within an ellipsoid space. Why does this make sense to do (in terms of the language model's representational geometry)?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper presents a novel method for activation steering of LLMs based on Connectors. This method goes beyond the additive steering methods of previous works to use affine steering, applying an affine transformation to activations during the forward pass. This affine transformation is calculated from the matrix of activations of the concept in question. The paper presents formal and theoretical results describing conceptors and proving how to calculate the optimal affine transformation for a given concept, occasionally seeing links between this work and prior methods for activation steering. The paper then presents empirical results on 5 function steering tasks from previous work, where their method outperforms the baselines across all layers of both models. They also present results demonstrating how connectors can be combined with boolean logical operations, showing promising results."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "The paper was well-written and easy to read. The contribution is interesting and novel, and shows that activation steering work can benefit from theoretical and formal thinking. While connectors are not novel, connecting them to activation steering and computing optimal connectors in this setting is, and is a worthwhile contribution. The experiments compare against reasonable baselines and show promising results. Activation steering is an exciting and important area of research, so this contribution is timely and significant in that respect."
            },
            "weaknesses": {
                "value": "# Paper being self-contained\n\nWhile the paper is mostly self-contained, it references Jaeger's (2014) work on conceptors frequently. The main places where this makes the motivation and contribution less clear is in the definition from Jaeger of optimal connectors. It is not clear to me why this definition is the correct notion of optimality, and so justifying this more would be beneficial to the clarity of the paper.\n\n# Minimal experiments\n\nWhile the paper compares against several baselines, it only shows results on 5 tasks, which is quite a small set. It would be beneficial to expand the experiments in the paper in several ways:\n* More and different tasks. These could be additional function vector tasks, but also the persona tasks as in https://arxiv.org/abs/2312.06681, https://arxiv.org/abs/2407.12404, or other more generative style-based tasks from previous work. This would demonstrate the benefits of this method more generally across a wider range of settings, and be much more compelling\n* Measuring general performance degradation. As shown in recent work (https://www.anthropic.com/research/evaluating-feature-steering), activation steering methods can sometimes decrease general performance while increasing task-specific performance. As the conceptor method applies a more substantial transformation than additive steering, it would be beneficial to ensure this transformation doesn’t degrade general model performance more than activation steering. This could be done on generative tasks as in previous and concurrent work (https://www.anthropic.com/research/evaluating-feature-steering, https://arxiv.org/abs/2312.06681)\n\n# Summary\n\nOverall, I'm giving this paper a 6, as I believe the contributions of conceptors applying to activation steering and experiments are sufficiently meaningful as a contribution. To raise my score higher, I would want to see more additional experiments as described above. If experiments were done in a range of domains and results were still positive, I think this would be a very strong paper."
            },
            "questions": {
                "value": "* Why is Jaeger’s notion of optimality for a conceptor the correct one for the activation steering setting.\n* How much additional computation cost does this method use over activation steering? It would be useful to have a big O notation idea of computational complexity, as if it scales quadratically with dataset size rather than linearly that is a downside of the method that should be mentioned."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}