{
    "id": "aZjOk7wmWf",
    "title": "Exploring and Unleashing the Power of Message Passing on Heterophilous Graphs",
    "abstract": "Graph Neural Networks (GNNs) have demonstrated strong performance in graph mining tasks due to their message-passing mechanism, which is aligned with the homophily assumption that adjacent nodes exhibit similar behaviors. However, in many real-world graphs, connected nodes may display contrasting behaviors, termed as heterophilous patterns, which has attracted increased interest in heterophilous GNNs (HTGNN).\nAlthough the message-passing mechanism seems unsuitable for heterophilous graphs due to the propagation of class-irrelevant information, it is still widely used in many existing HTGNNs and consistently achieves notable success. \nThis raises the question: why does message passing remain effective on heterophilous graphs?\nTo answer this question, in this paper, we revisit the message-passing mechanisms in heterophilous graph neural networks and reformulate them into a unified heterophilious message-passing (HTMP) mechanism.\nBased on HTMP and empirical analysis, we reveal that the success of message passing in existing HTGNNs is attributed to implicitly enhancing the compatibility matrix among classes.\nMoreover, we argue that the full potential of the compatibility matrix is not completely achieved due to the existence of incomplete and noisy semantic neighborhoods in real-world heterophilous graphs.\nTo bridge this gap, we introduce a new approach named CMGNN, which operates within the HTMP mechanism to explicitly leverage and improve the compatibility matrix.\nA thorough evaluation involving 10 benchmark datasets and comparative analysis against 17 well-established baselines highlights the superior performance of the HTMP mechanism and CMGNN method.",
    "keywords": [
        "Heterophily",
        "Message Passing",
        "Graph Neural Networks"
    ],
    "primary_area": "learning on graphs and other geometries & topologies",
    "TLDR": "",
    "creation_date": "2024-09-27",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=aZjOk7wmWf",
    "pdf_link": "https://openreview.net/pdf?id=aZjOk7wmWf",
    "comments": [
        {
            "summary": {
                "value": "This paper proposes a compatibility matrix-enhanced method to improve the expressiveness of graph neural networks on heterophilous graph data, and verifies its validity on 10 benchmark datsets."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "Extensive experiments have been conducted, including empirical studies on compatibility matrices for various models. \n\nThe experiments may be convincing based on the demonstration of the details."
            },
            "weaknesses": {
                "value": "1. The claim that success of HTGNN is due to \"enhancing the compability matrix\" is problematical. The compability matrix depicts the relations between classes whose instances are linked together, so naturally better representation (thus better prediction) definitely results in more desirable compability matrix. It seems that compability matrix should be the effect, not the cause.  It would be good to provide more evidence or analysis demonstrating that enhancing the compatibility matrix directly leads to improved representations, rather than being a consequence of them.\n2. The theorems and lemmas (e.g., theorem 1) are overlay simple. Most of the results are obvious, without meaningful insights.\n3. The motivation of \"supplementary neighborhood construction\" is not explained in Methodology.\n4. No time and space complexity analysis of the proposed method.\n5. The claim on \"New datasets\" introduced by this paper is inappropriate. It should precisely describe what is new about the dataset usage compared to previous work (unified data splitting cannot be the \"new\"), such as modifications to existing datasets, new combinations, or different preprocessing steps that the authors consider novel. that performs well on both homophilous and heterophilious graphs, \n6. why some popular SOTAs like graphSAGE and recently developed methods such as Ref. [1-2]  are not included in comparison? The former performs well on both homophilous and heterophilious graphs, the latter two are also oriented towards heterophily issue.\n7. The writing needs improvement. There are some  vague sentences and  non-standard writings,  eg. 232-234, 'it's', 'nodes' neighborhood'.\n\nRef. [1] Wang et al. \"understanding heterophily of graph neural networks\", ICML 2024\n [2] LG-GNN, IJCAI 2024."
            },
            "questions": {
                "value": "1. Line 59-60, why increasing distinctiveness between rows of compability matrix will enhance node representation? It should be justified. Throughout the paper, I can only see the emphasis on the distinction between diagonal and non-diagonals of compability matrix.\n2. Why design weights in the form of Eq. 7? no any intuitions behind.\n3. Despite of the supplementary neighborhood construction (which can be viewed as additional label propagation) and the compability matrix optimization component, the performance improvement is still marginal, compared to the baselines in the paper.\n4. what does it mean by \"k neighborhoods\"? how to count the number of neighborhoods for a node in question?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper examines the effectiveness of message-passing mechanisms in heterophilous graph neural networks (HTGNNs), where connected nodes often display contrasting behaviors. This paper propose a unified heterophilous message-passing (HTMP) mechanism and introduce CMGNN, which enhances the compatibility matrix to address incomplete and noisy semantic neighborhoods."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. Building a unified codebase for heterophily benchmarks/baselines would greatly benefit community research."
            },
            "weaknesses": {
                "value": "1. **Motivation**: The HTMP framework proposed in this paper does not appear to specifically address the heterophily problem, as the mentioned components like FUSE and COMBINE are generally applicable (for instance, they are used in many works focusing on over-smoothing or over-squashing). Fundamentally, they are not exclusive to the heterophily issue and resemble more a general extension of the message-passing mechanism.\n\n2. **Experiments**: The experiments in this paper are conducted only on datasets with a relatively small node scale (with a maximum of just over 20,000 nodes), which does not demonstrate the scalability of the proposed method.\n\n3. **Methodology**\n\n   - The paper's proposed CMGNN does not clarify the specific reasons for selecting components in AGG, COMBINE, and FUSE, namely how your chosen designs can help the proposed HTMP better estimate the compatibility matrix.\n   \n   - Moreover, the design of these components appears overly manual (e.g., why combine from only the three proposed types of neighbors in COMBINE? Why use concatenation in FUSE but weighted summation in COMBINE?), seeming like a patchwork of existing methods.\n   \n   - Finally, regarding using the rows of the adjacency matrix as additional node features, I believe this could lead to the model being unscalable (as the number of model parameters increases with the number of nodes) and seems to disrupt the permutation invariance of GNN models."
            },
            "questions": {
                "value": "1. Authors mentioned that during training, for efficiency, they only update the compatibility matrix when evaluation performance improves. How much difference in computation time is there between epochs when the CM is updated and when it is not?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper titled addresses the challenge of using GNNs on heterophilous graphs, where connected nodes often belong to different classes, defying traditional GNNs' homophily-based assumptions. It proposes the HTMP mechanism, a unified framework that improves message passing for such graphs by enhancing the compatibility matrix between classes. Additionally, the paper introduces CMGNN, a new GNN model under HTMP that explicitly leverages and refines the compatibility matrix to overcome issues related to noisy and incomplete semantic neighborhoods. Extensive benchmarking across various datasets and comparisons with different baselines validate CMGNN's effectiveness and the benefits of the HTMP approach in heterophilous settings."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. **Unified Framework**: HTMP provides a cohesive structure for message passing in heterophilous GNNs, enabling flexibility and adaptability across different graph structures.\n\n2. **Compatibility Matrix Enhancement**: CMGNN explicitly optimizes the compatibility matrix, effectively improving message relevance and class separability on heterophilous graphs.\n\n3. **Comprehensive Benchmarking**: Extensive evaluations on 10 diverse datasets against 17 baselines validate CMGNN’s superior performance, demonstrating robustness in real-world heterophilous scenarios."
            },
            "weaknesses": {
                "value": "1. My primary concern with this paper is the Compatibility Matrix (CM). While the CM captures the likelihood of connections between classes in a graph, aiding message-passing in heterophilous GNNs, it closely resembles the attention mechanism by determining importance between different classes, rather than nodes. Additionally, the concept is not novel, as it has been employed in prior work, such as CPGNN [1]. Could the authors clarify the key differences introduced in this paper?\n\n2. Although this paper focuses on message-passing GNNs, recent advances in spectral GNNs have shown competitive performance on heterophilous graphs. Were comparisons with spectral baselines like BernNet [2] and ChebNetII [3] considered? If spectral GNNs demonstrate superior performance, what is the rationale for focusing on message-passing GNNs?\n\n3. In Table 3, “CMGNN” achieves identical performance to “W/O DL” on three datasets, including identical standard deviations, which seems unlikely given the exclusion of the “DL” component. Could the authors provide insights into this outcome?\n\n4. Figure 8 is not in PDF format, making it appear blurred when zoomed in. A PDF version would enhance clarity.\n\n\n[1] Zhu et al. Graph Neural Networks with Heterophily\n[2] BernNet: Learning Arbitrary Graph Spectral Filters via Bernstein Approximation\n[3] Convolutional Neural Networks on Graphs with Chebyshev Approximation, Revisited"
            },
            "questions": {
                "value": "See Weaknesses"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper studies message passing on heterophilic graphs and claims that the compatibility matrix is the key to the message-passing mechanism. Based on the compatibility matrix, the authors propose a new framework (i.e., CMGNN). The experiments show that CMGNN is superior."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "- The experiments in this paper show the superiority of the proposed method."
            },
            "weaknesses": {
                "value": "- The paper lacks explanations in many key places, such as why A^{sup} and B^{sup} can supplement effective neighbor information. And some operations are wrong, such as the A^{sup} and B^{sup} \\in R^{N*K}, while the Z is  R^{N*dr}, which can not conduct the inner-product operation in Eq. (9).\n- Why A^{sup} is set to all 1? The authors need to explain.\n- This paper is hard to read. Symbols are confusing, and symbols that appear for the first time are not explained. For example, what is H in Eq.(5)? what is \\wave_{C} in Eq.(6)?\n\nOverall, this paper is not solid, the motivation lacks verification, and the method is not clearly described. I tend to reject this paper."
            },
            "questions": {
                "value": "See weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}