{
    "id": "B5i88Tj1nk",
    "title": "AIM: Adversarial Information Masking for Evaluating EEG-DL Interpretations",
    "abstract": "The analysis of post-hoc explanations for deep learning models has revealed significant benefits in enhancing transparency and advancing explainable artificial intelligence (XAI). Despite this progress, a critical gap remains in the reliable evaluation of the faithfulness of explanations, particularly for data that encompasses multi-domain information. To address the challenges of distribution shifts and information leakage present in existing methods, we propose a novel framework involving multi-domain adversarial information masking (AIM) based on Multi-Domain Adversarial Robustness (mdAR), enabling in-distribution imputation and facilitating a reliable assessment of faithfulness for feature attribution methods. Extensive experiments validate our approach across various model architectures and multi-channel electroencephalogram (EEG) datasets. The code and sample data for this work are available at https://anonymous.4open.science/r/EEG-explanation-faithfulness-5C05.",
    "keywords": [
        "Explainable AI",
        "Post-hoc explanation",
        "EEG",
        "Feature attribution method",
        "Saliency map",
        "in-distribution imputation"
    ],
    "primary_area": "applications to neuroscience & cognitive science",
    "TLDR": "A robust framework for quantifying the faithfulness of post-hoc explanations in EEG deep learning models, employing adversarial information masking for effective in-distribution imputation.",
    "creation_date": "2024-09-28",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=B5i88Tj1nk",
    "pdf_link": "https://openreview.net/pdf?id=B5i88Tj1nk",
    "comments": [
        {
            "summary": {
                "value": "The authors present approaches on how to mask EEG input data in spatial, frequency and temporal domains. The aim of this masking is faithfulness evaluation of attribution maps. The present novel ideas for masking in the temporal domain, also with likely a novelty for the frequency domain. Besides conventional approximate in-distribution masking they also evaluate masking by copying from adversarially crafted samples. The present results for several networks and several attribution methods. They investigate the question whether the sign of attribution maps carries information and investigate an unexpected result in the frequency domain."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "It is a reasonable application study about faithfulness evaluation for a particular field - which is an acceptable type of invention. A good set of experiments in three domains, also for multiple networks. They measure also consistency in the sense of rank correlations."
            },
            "weaknesses": {
                "value": "In particular for the temporal domain, but also for the frequency domain, trying out different non-adversarial masking methods would make the evaluation more interesting. For the temporal domain that would be different stochastic processes."
            },
            "questions": {
                "value": "What are the footnotes in Table 2 ?\n\nIt might be fair to cite https://www.nature.com/articles/s42256-023-00620-w ."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper addresses the problem of evaluation of post-hoc explanations in the context of models trained on EEG decoding tasks. \nIn particular, it focuses on the evaluation of faithfulness of explanations and proposes a novel framework involving multi-domain adversarial information masking (AIM) based on Multi-Domain Adversarial Robustness (mdAR), which overcomes some of the limitations of standard faithfulness evaluation approaches. The framework is validated on multiple model architectures and EEG datasets."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "The paper addresses a relevant problem, namely evaluation of post-hoc explanations. The paper is original in the sense that it proposes two imputation techniques specifically tailored for multivariate EEG data. The proposals are based on the ROAD and AR frameworks as the  and carefully integrate the spatial, spectral and temporal dimension of multivariate EEG data. The overall originally and quality of the proposed approach is rather limited and specific to models trained for EEG analysis. It is unclear how to generalise the approach beyond this specific application domain.\nThe paper is well written and easy to understand. The experimental evaluation is ok, but could be more detailed and deep. Currently it is not clear how follows, e.g., from the results in Table 2 or 3.\nOverall, the contribution is rather incremental and will probably be of interest / significance only to a limited (EEG) community."
            },
            "weaknesses": {
                "value": "The contributions of the paper are very specific and may be of interest to a limited community, mainly only researchers training and explaining NN for EEG analysis. There has been a lot of research on faithfulness evaluation of explanations. The proposed method represents an incremental contribution to this field. The experimental evaluation is not 100% convincing. It is unclear to me what follows from the evaluation results. Shall we only use some of the methods which perform well in Table 2 for the analysis of EEG-based explanations? Are the results consistent with other evaluation approaches? What are the consequences of the evaluation for the practioner?. \nCurrently, the paper reads to me as proposing yet another faithfulness evolution metric, here specifically for EEG analysis tasks. The overall originality of the contribution and relevance for the ICLR research community is rather limited. Therefore I recommend \"reject\"."
            },
            "questions": {
                "value": "What follows from the evaluation results?\nWhat are the consequences for the practitioner?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The manuscript aims to contribute to the evaluation of interpretations of deep learning models applied to EEG. It does so by identifying issues with traditional adversarial robustness evaluation for EEG and proposing alternative information masking methods to evaluate the faithfulness of feature attribution methods. Their framework is able to differentiate between attribution methods on spatial, temporal, and spectral domains and thereby seem to generate useful findings for the field. Such progress is valuable as explainability of neural networks in EEG data is not well-studied."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 1
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "-\tAddresses a real gap in the EEG/DL field\n-\tSeems to generate useful findings\n-\tThree EEG domains are considered"
            },
            "weaknesses": {
                "value": "1.Writing: Unfortunately, the level of the writing of the manuscript is poor. Especially the first half of the paper, outlining the motivations, prior literature, and outline of the paper, is difficult to follow. The paper could really benefit from another thorough round of editing as the many grammatical errors lead to semantic ambiguity. A few examples that I am unable to understand:\na. L218-219: ‘ability to exert data distribution’\nb. L220-221:‘computationally exhaustive while remain biased or uncontrollable’.\nc. L271-273: \"(…), whose value are concluded to reflect certain series trend.”\nAlso the experiments are hard to follow and it is difficult to assess the contributions of this work. \n\n2. Evaluation: Is it possible to perform some form of cross-framework comparison? It is difficult to understand the advantage of the proposed framework over existing ones. For example, why did the authors choose not to analyze where and why frameworks agree or disagree? Would synthetic data enable a comparison between frameworks? Understanding both the advantages and disadvantages of this new framework would be very valuable.\n\nMinor:\n-\tIt might be useful to briefly describe what the the proposed metrics (AOC, ABC) conceptionally mean and how they differ.\n-\tRecent work on EEG-DL concerns the use of large amounts of resting state data for clinical predictions (e.g. [1-3]). Do the authors believe the proposed framework could be relevant for such work as well? Understandably, task-based explanations are easier to verify and interpret. However, the datasets used by the authors are small, while it may be argued that deep learning models may be particularly interesting in case of larger datasets, which to my knowledge tend to be resting-state.\n\nReferences:\n1.\thttps://openreview.net/forum?id=QzTpTRVtrP\n2.\thttps://arxiv.org/abs/2305.10351\n3.\thttps://arxiv.org/abs/2409.07480"
            },
            "questions": {
                "value": "- Improve clarity and style of writing\n- Be more concise in your contributions \n- Evaluate your framework with respect to other frameworks\n- Give more context regarding the EEG experiments and show more example attributions"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}