{
    "id": "CI5Cj0vktS",
    "title": "Robust Barycenter Estimation using Semi-Unbalanced Neural Optimal Transport",
    "abstract": "A common challenge in aggregating data from multiple sources can be formalized as an *Optimal Transport* (OT) barycenter problem, which seeks to compute the average of probability distributions with respect to OT discrepancies. However, the presence of outliers and noise in the data measures can significantly hinder the performance of traditional statistical methods for estimating OT barycenters. To address this issue, we propose a novel, scalable approach for estimating the *robust* continuous barycenter, leveraging the dual formulation of the *(semi-)unbalanced* OT problem. To the best of our knowledge, this paper is the first attempt to develop an algorithm for robust barycenters under the continuous distribution setup. \nOur method is framed as a $\\min$-$\\max$ optimization problem and is adaptable to *general* cost function. \nWe rigorously establish the theoretical underpinnings of the proposed method and demonstrate its robustness to outliers and class imbalance through a number of illustrative experiments.",
    "keywords": [
        "unbalanced optimal transport",
        "barycenter",
        "generative modeling"
    ],
    "primary_area": "generative models",
    "TLDR": "",
    "creation_date": "2024-09-28",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=CI5Cj0vktS",
    "pdf_link": "https://openreview.net/pdf?id=CI5Cj0vktS",
    "comments": [
        {
            "summary": {
                "value": "This paper proposes a neural network-based method to estimate continuous barycenter via the dual formulation of the semi-unbalanced OT."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "1. The proposed method may be the first continuous robust barycenter estimation approach with proper theoretical support and practical validation.\n\n2. The proposed method is robust and can estimate the barycenter based on the data containing the outliers."
            },
            "weaknesses": {
                "value": "My main concern is the novelty of the paper. The primary method seems to be a combination of barycenter calculation, neural optimal transport, and semi-unbalanced optimal transport. In my view, simply combining methods may not be sufficient for publication at ICLR, so I give a negative score. I will consider raising my score if the authors can demonstrate unique contributions that go beyond a straightforward combination of these methods."
            },
            "questions": {
                "value": "Q1. How does the time efficiency of U-NOTB compare with other baselines?\n\nQ2. The experiments seem to lack details about the size of the training/testing sets and some training specifics, such as learning rate and other hyperparameters.\n\nQ3. Since the overall training is similar to GANs with a max-min approach, is the training of U-NOTB stable?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper proposes a scalable approach for estimating the robust continuous barycenter by using the dual formulation of the (semi-)unbalanced OT problem. They first attempt to develop an algorithm for robust barycenters under continuous distribution setup. They model this problem as a min-max optimization problem and provide theoretical underpinnings, along with experimental results on synthetic and real-world datasets to demonstrate the robustness and adaptability of their method."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "- This paper introduces a continuous SUOT barycenter estimation method that addresses the issue of robustness against outliers and imbalances in real-world datasets.\n- Rigorous derivation of the SUOT-based framework and solid theoretical support for the proposed model give the approach a solid foundation."
            },
            "weaknesses": {
                "value": "Experiments are not sufficient and the baseline method is not comprehensive."
            },
            "questions": {
                "value": "- Given that the Wasserstein barycenter of Gaussian distributions has a closed-form solution, could the authors provide experimental verification for the Gaussian distribution case?\n- Can the robustness parameter $\\tau$ be automatically optimized during training rather than manually tuned? If not, for different proportions or types of noise, different $tau$ is usually required. Will this limit the practicality of the scheme?\n- How does the method work with high-dimensional data? In other words, the support size of the measures may be large in practical applications. While the support size of the measures in your experiments seems rather small.\n- Why don't you compare the methods [1,2] based on robust OT? Please add corresponding experiments.\n\n[1] Nietert S, Goldfeld Z, Cummings R. Outlier-robust optimal transport: Duality, structure, and statistical analysis[C]//International Conference on Artificial Intelligence and Statistics. PMLR, 2022: 11691-11719.\n\n[2] Wang X, Huang J, Yang Q, et al. On Robust Wasserstein Barycenter: The Model and Algorithm[C]//Proceedings of the 2024 SIAM International Conference on Data Mining (SDM). Society for Industrial and Applied Mathematics, 2024: 235-243."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "In this paper, the authors investigate the problem of finding the barycenter with semi-unbalance optimal cost (SUOT) from perspective of dual theory. In particular:\n\n(1) They derive the theory for the dual form of SUOT barycenter with reformulation, and necessary condition based on marginal plan and conditional plan\n\n(2) Then, from the necessary condition,  they propose the an algorithm (Algorithm 1) to approximate the optimal transport plan from the solution. This algorithm is based on training the neural network of optimal plan.  \n\n(3) Then, they empirically validate the efficacy of the algorithm on both synthetic and real dataset."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. The paper provides an important and novel dual theory for the SUOT barycenter problem.\n\n2. The proposed algorthm works well and persistent to the imbalance and outliers. \n\n3. The paper is well-structured and easy to follow."
            },
            "weaknesses": {
                "value": "1. The necessary condition seems to be not difficult to obtain, which makes it not convincing enough. So, would it be possible to obtain some sufficient conditions? \n\n2. It would be better if the authors can highlight the advantages of finding the optimal plan over the optimal solution. \n\n3. As stated in the limitations, the authors did not provide a rigorous analysis for the convergence of the algorithm."
            },
            "questions": {
                "value": "See Weaknesses section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "In this work, authors propose to solve the continuous unbalanced optimal transport barycenter. To do that, they derive a dual formulation to the problem, which is a min-max problem over potentials and conditional distributions. They solve the problem by parametrizing the potential and conditional distributions with neural networks. Finally, they show that their method works on three experiments, demonstrating that they recover the right barycenters, that the barycenter is robust to outliers and to class imbalance, and that it can handle using different costs."
            },
            "soundness": {
                "value": 4
            },
            "presentation": {
                "value": 4
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "The paper is overall well written and nice to read.\n\nIt provides one of the first method to solve continuous UOT barycenters leveraging a dual formulation and neural networks parametrizations, which is an interesting contribution.\n\nSeveral convincing experiments are done demonstrating that the method learns well the UOT barycenter, that it is robust to outliers and class imbalance, and that it works with several costs."
            },
            "weaknesses": {
                "value": "The main weakness in my opinion is that the method feels really incremental compared to [1]. The main difference is that it it adapted to the UOT problem, which just changes slightly the formulation of the dual, and how to sample from the barycenter for inference.\n\nAnother weakness, which is classical with UOT, is that the choice of the unbalancedness parameters does not seem easy.\n\nThe method also needs to solve a min-max problem, which is probably unstable and very costly."
            },
            "questions": {
                "value": "A term seems to be missing in the definition of $\\psi$-divergence, see Definition 1 in [2].\n\nThe sentence line 227 is not clear to me. The $m$-congruence is a constraint of the problem. So I do not understand why it is written \"if the potentials satisfy the m-congruence, then the optimal value of the SUOT barycenter can be derived by solving (8)\". The SUOT barycenter can always be derived by solving (8) and the potentials necessarily satisfy this constraint when solving (8).\n\nIn Corollary 1, it is stated that the sup is taken over $f_{[1,K]}$. Isn't it also taken over $m$?\n\nIn Theorem 2, equation (12), shouldn't it be an argmin?\n\nIn Section 5.1, it is stated that the UOT problem is equivalent with the OT problem between rescaled distribution. Is it truly equivalent? And could we solve the OT barycenter between the rescaled distributions instead of solving the SUOT barycenter?\n\nIs it proved that $T_{1\\\\#}\\mathbb{P}_1$ gives the UOT barycenter?\n\nI think that the reference [3] is missing. In their experiments, they compute robust OT barycenters via unbalancedness.\n\nTypos:\n- Line 11: The first sentence of the abstract feels weird: I don't see what is the \"common challenge\"\n- Line 107: \"This transition is valid since we work the infimum in weak\"\n- Line 142: \"wights\"\n- Line 365: what is $T$ in $T_1 = \\lambda_1 Id + \\lambda_2 T$\n- Legend of Figure 4: $\\mathbb{P}_0$ -> $\\mathbb{P}_1$ and $\\mathbb{P}_1$ -> $\\mathbb{P}_2$\n\n[1] Kolesov, A., Mokrov, P., Udovichenko, I., Gazdieva, M., Pammer, G., Burnaev, E., & Korotin, A. (2024). Estimating Barycenters of Distributions with Neural Optimal Transport. arXiv preprint arXiv:2402.03828.\n\n[2] Séjourné, T., Peyré, G., & Vialard, F. X. (2023). Unbalanced optimal transport, from theory to numerics. Handbook of Numerical Analysis, 24, 407-471.\n\n[3] Séjourné, T., Bonet, C., Fatras, K., Nadjahi, K., & Courty, N. (2023). Unbalanced optimal transport meets sliced-Wasserstein. arXiv preprint arXiv:2306.07176."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}