{
    "id": "D2EdWRWEQo",
    "title": "FreeFlow: Latent Flow Matching for Free Energy Difference Estimation",
    "abstract": "Estimating free energy differences between molecular systems is fundamental for understanding molecular interactions and accelerating drug discovery. Current techniques use molecular dynamics to sample the Boltzmann distributions of the two systems and of several intermediate \"alchemical\" distributions that interpolate between them. From the resulting ensembles, free energy differences can be estimated by averaging importance weight analogs for multiple distributions. Instead of time-intensive simulations of intermediate alchemical systems, we learn a fast-to-train flow to bridge the two systems of interest. After training, we obtain free energy differences by integrating the flow's instantaneous change of variables when transporting samples between the two distributions. To map between molecular systems with different numbers of atoms, we replace the previous solutions of simulating auxiliary \"dummy atoms\" by additionally training two autoencoders that project the systems into a same-dimensional latent space in which our flow operates. A generalized change of variables formula for trans-dimensional mappings allows us to employ the dimensionality collapsing and expanding autoencoders in our free energy estimation pipeline. We validate our approach on systems of increasing complexity: mapping between Gaussians, between subspaces of alanine dipeptide, and between pharmaceutically relevant ligands in solvent. All results show strong agreement with reference values.",
    "keywords": [
        "free energy",
        "flow matching",
        "free energy perturbation",
        "computational biology"
    ],
    "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)",
    "TLDR": "We explore estimating free energy differences via a neural mapping that is based on flow matching between the Boltzmann distributions of two molecular systems with different dimensionalities.",
    "creation_date": "2024-09-28",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=D2EdWRWEQo",
    "pdf_link": "https://openreview.net/pdf?id=D2EdWRWEQo",
    "comments": [
        {
            "summary": {
                "value": "They propose a method for estimating free energy differences between molecular systems. Traditional free energy estimation methods rely on simulating intermediate states between two systems. FreeFlow addresses this by mapping both systems to a common latent space via autoencoders and applying a neural flow model to estimate free energy differences without intermediate simulations. This latent-space approach leverages flow matching to track density changes between systems, allowing FreeFlow to handle trans-dimensional mappings."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "They propose a transdimensional mapping for free energy estimates. Super cool. \nTheir theory seems to directly relate to their implementation methods."
            },
            "weaknesses": {
                "value": "I would like to see way more comparisons with other methods!\nAlso in Figure 4, the mean of equidimensional gaussians seems to converge to the true mean, but not for the trans dimensional one. \nIn Figure 5, the D(B,B) and D(M(A),B) do not completely overlap. \nFigure 6 is important, but more important is the comparison to existing methods. Free energy estimation is extremely difficult, so it is more interesting to see how much it improves upon other methods vs absolute accuracy."
            },
            "questions": {
                "value": "Why do the figures differ as mentioned in weaknesses?\nCould you write out the proof of equation 13?\nAlso, please give at least a toy system code to test the method. Otherwise, it is difficult to interpret accurately."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The authors present FreeFlow, a novel method for learning normalizing flows between distributions of arbitrary dimensions. FreeFlow achieves this using flow matching to learn an invertible map between distributions embedded into a lower dimensional latent space. The authors demonstrate the use-case of FreeFlow in application to estimating free energy differences for molecular systems. Through empirical experiments, FreeFlow is shown to efficiently estimate free energy differences for molecular systems."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "This work addresses the challenging problem of estimating free energy differences between molecular systems. In doing so, the authors devise a framework for learning normalizing flows between distributions of arbitrary dimensions. The introduced method (FreeFlow) has two key strengths:\n- FreeFlow leverages advancements in flow matching to learn more expressive maps between molecular distributions.\n- FreeFlow does not require the use of non-physical modifications on molecules to match dimensions between distributions."
            },
            "weaknesses": {
                "value": "A central limitation of this work is that there appears to be a lack of comparisons with existing approaches that estimate free energy differences between molecular systems. Without comparison to other methods, it is hard to assess the validity of some of the claims and contributions of this work. For example:\n- The authors argue that FreeFlow learns more expressive maps between molecular distributions compared to previous normalizing flows solutions. It is not clear that this claim is supported in the experiments. What are the previous normalizing flows solutions that FreeFlow is compared against? \n- One argued advantage of FreeFlow is that the method does not require the use of non-physical modifications, such as the use of dummy variables on molecules to match the dimensions between distributions.  It is not clear how or if avoiding the use of non-physical modifications leads to improved free energy difference estimation. How does FreeFlow compare to methods that use such non-physical modifications? Likewise, why not compare to other baselines in that address the problem of free energy difference estimation (such as those described in Figure 2)?\n\nIn addition, there are several areas in the manuscript that contain some unaddressed items (see questions below) that at times make it difficult to follow the work. I believe that adding fair comparison to existing approaches for estimating free energy differences between molecular systems and addressing the questions I outlined below would strongly improve this work."
            },
            "questions": {
                "value": "- Lines 232-233: Could the authors provide some explanation/justification an optimal transport map between $\\rho_A$ and $\\rho_B$ is needed in this setting? What happens if you were to assume independent marginals? \n- Regarding the latent representations:\n    -  Do you validate that the auto-encoders are in fact over-fitting? Do you validate that the auto-encoders learn reasonable representations?\n    - How did you decide on hyper-parameters for the auto-encoders? \n    - The authors justify choice of MLP for the auto-encoder architecture as \"not needing to generalize\" (lines 257-259). How do you think the results would change if a different architecture is used, for examples a graph neural network or transformer, which have become de facto architectures for learning molecular representations? \n- In Figure 4.a, is the objective to match the estimated target distribution (green) to the true target distribution (orange)? In which case, it appears this the estimate does not match the target. Is there intuition on why the estimated target distribution is so far from the true target distribution in the Equidimensional Gaussian Energy setting compared to the Transdimensional Gaussian Energy setting? I would assume that the Equidimensional setting should be easier?\n- In Figure 5, what is the distribution pairwise distance $D(\\cdot, \\cdot)$?\n- Lines 419-420: How do you observe the distances between $B$ and the mapped sampled $M(B)$? In Figure 5, only $D(A, B)$, $D(B, B)$, and $D(M(A), B)$ are reported."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "In this paper, the authors focus on estimating the free energy difference between two molecular systems. They propose to use a neural network to learn a mapping between these two systems, which can reduce the variance of free energy estimation based on TFEP, providing more accurate result compared to FEP. The experiments on several simple cases demonstrate the effectiveness of proposed method. On the large molecules, the authors also claim that the result from proposed method is close to the reference data."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. Using neural networks to represent the mapping between different distributions may bring more flexibility to the solution.\n2. The authors give a lot of examples that help to understand the proposed method.\n3. The writing is good."
            },
            "weaknesses": {
                "value": "1. The accuracy of the proposed method is not good enough. In the experiments of large molecules, the MAE between the proposed method and the baseline method is about tens of or even hundreds of kJ/mol. As a comparison, the error of free energy should be within 10kcal/mol (~42kJ/mol) to give a qualitatively correct prediction. Such a large difference means that the proposed method may not be reliable in practice. The authors should consider how to improve the accuracy of the proposed method.\n2. The cost of the proposed method is relatively large. The training data includes molecular dynamics simulation of the related systems. Thus, when applying the proposed method to new systems, one should perform additional molecule dynamics simulation to collect training data. Given the poor accuracy of the proposed method, the reviewer believes the training cost is larger than expected."
            },
            "questions": {
                "value": "Suggestions are listed in weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The authors propose a strategy to estimate free energy differences between molecular systems. Their approach relies on performing latent diffusion (flow matching) instead of diffusion in data space. The main advantage is that, due to the change in dimensionality required to match different molecular systems, diffusion in data space requires the addition of dummy atoms. In contrast, diffusion in latent space is dimension-agnostic. The trade-off is the need to track all the change-of-variable factors that come with the steps to match the two distributions: encoding, diffusion, and decoding. \n\nThe authors provide experiments to demonstrate the validity of their approach, using both toy distributions of multi-dimensional Gaussians and more real-world applications."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "The paper is well-written with clear and consistent notation, and the topic is of relevance in the field of drug discovery. The authors effectively explain existing methods while clearly stating and motivating their contribution."
            },
            "weaknesses": {
                "value": "The paper's main weakness is that it doesn't develop an entirely new method, but rather combines existing methodologies into a framework for free energy difference estimation. In the conclusions, the authors mention plans to apply this methodology to learn a mapping between bound protein-ligand complexes in future work. From a drug discovery perspective, this would be a more significant goal. I wonder if it's feasible for the authors to present the full thermodynamic cycle in this work. \n\nAdditionally, while instructive, the experiments are based on a limited set of examples. A broader set of experiments to evaluate their method on a large-scale dataset would definitely improve the paper."
            },
            "questions": {
                "value": "- I understand that overfitting the autoencoder for density reconstruction is auxiliary to performing flow matching in latent space. However, I wonder if there could be benefits to learning a \"representation learning\" autoencoder in the classical sense—one that can generalize and thus be used for all densities rather than requiring separate autoencoders for each molecular system.\n- In Figure 4(a), the true target and the estimated target distributions differ significantly. In fact, the true target seems to coincide with the source. Could this be a labeling mistake?\n- I'm not entirely clear on the theory (or implications) of the trans-dimensional change of variable. Let's consider a simple case, as depicted in Figure 3 (bottom). We have an encoder (in the paper's terminology) $f:\\mathbf{R}^2 \\rightarrow \\mathbf{R}$, and we'll omit the decoder, leaving only this mapping.\n    - The Jacobian is $J_f(x) = (\\frac{\\partial f}{\\partial x_1}, \\frac{\\partial f}{\\partial x_2})$, so the volume form is simply the square root (the determinant being irrelevant since this is one-dimensional) of $\\sum_i \\left(\\frac{\\partial f}{\\partial x_i}\\right)^2$, correct?\n    - Given these assumptions, is the equation in Figure 3 valid for all x? This seems counterintuitive, as for generic $\\rho_A$ and $f$, the mapping won't be lossless. For instance, the equation in the top part of Figure 3 holds if $f$ is a bijection.\n    - If that's not the case, what's the most general statement we can make for this scenario (namely, $f:\\mathbf{R}^2 \\rightarrow \\mathbf{R}$ with no decoding)?\n    - For a surjective $f$, does the reverse equation hold true? That is, $\\rho_B(f(x)) = \\rho_A(x) |\\det J^T J|^{1/2}$? This seems more plausible, as even if $f$ isn't lossless, I should be able to make a statement about $\\rho_B(f(x))$ knowing $f$ and $\\rho_A$."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 8
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}