{
    "id": "e2ONKX6qzJ",
    "title": "Eliminating Oversaturation and Artifacts of High Guidance Scales in Diffusion Models",
    "abstract": "Classifier-free guidance (CFG) is crucial for improving both generation quality and alignment between the input condition and final output in diffusion models. While a high guidance scale is generally required to enhance these aspects, it also causes oversaturation and unrealistic artifacts. In this paper, we revisit the CFG update rule and introduce modifications to address this issue. We first decompose the update term in CFG into parallel and orthogonal components with respect to the conditional model prediction and observe that the parallel component primarily causes oversaturation, while the orthogonal component enhances image quality. Accordingly, we propose down-weighting the parallel component to achieve high-quality generations without oversaturation. Additionally, we draw a connection between CFG and gradient ascent and introduce a new rescaling and momentum method for the CFG update rule based on this insight. Our approach, termed adaptive projected guidance (APG), retains the quality-boosting advantages of CFG while enabling the use of higher guidance scales without oversaturation. APG is easy to implement and introduces practically no additional computational overhead to the sampling process. Through extensive experiments, we demonstrate that APG is compatible with various conditional diffusion models and samplers, leading to improved FID, recall, and saturation scores while maintaining precision comparable to CFG, making our method a superior plug-and-play alternative to standard classifier-free guidance.",
    "keywords": [
        "classifier-free guidance",
        "diffusion models"
    ],
    "primary_area": "generative models",
    "TLDR": "We propose a method to mitigate oversaturation and artifacts of  high classifier-free guidance scales in diffusion models.",
    "creation_date": "2024-09-26",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=e2ONKX6qzJ",
    "pdf_link": "https://openreview.net/pdf?id=e2ONKX6qzJ",
    "comments": [
        {
            "title": {
                "value": "Official Response to Reviewer LhNz"
            },
            "comment": {
                "value": "We greatly appreciate the reviewer's helpful suggestions, as well as the positive assessment of the influence and quality of our work. Below, we provide detailed responses to the reviewer’s comments.\n\n### **Lower precision at lower guidance scales**\nThe results in Figure 8 were compiled using fixed hyperparameters for momentum and normalization, which suggests that slight adjustments to these hyperparameters may be necessary depending on the guidance scale. At very low scales, the original CFG does not exhibit oversaturation, whereas APG with the fixed parameters from Figure 8 may introduce excessive normalization. However, as the guidance scale increases, the precision and FID of CFG degrade, while APG consistently maintains its quality. This is reflected in APG achieving better FID across a range of guidance scales and a superior minimum FID overall. Thus, APG enables the use of higher guidance scales without encountering the typical issues observed with CFG. Additionally, in our experiments, we found that by reducing normalization and momentum for lower guidance scales, APG can achieve results similar to or better than CFG.\n\n### **Motivation behind momentum**\nOur motivation for incorporating momentum is to filter out any common signals present across different CFG updates at various time steps. By taking a weighted running average of past updates and removing the overlapping component from the current update, we effectively retain only the new information at each step. We believe this approach helps limit the drift typically seen in CFG over multiple sampling steps. Table 2 shows that removing momentum results in a higher FID, demonstrating that momentum contributes to improved quality. We would be happy to expand on the intuition or add additional experiments on momentum in the final version."
            }
        },
        {
            "title": {
                "value": "Official Response to Reviewer mQei"
            },
            "comment": {
                "value": "We wish to thank the reviewer for the helpful comments and for finding our work novel with detailed evaluations, good presentation, and significant contribution. Please find our answers to the comments below.\n\n### **HPSv2 and ImageReward**\nWe will examine the suggested metrics and will gladly consider them for the final version of the paper.\n\n### **Note on lower guidance scales**\nLower guidance scales generally avoid oversaturation, but often compromise output quality and alignment with the input. Throughout our experiments, we observed that APG performs robustly across a wide range of guidance scales, as illustrated in Figure 8. Additionally, we demonstrated that APG enables the use of higher guidance scales (such as $w=15$ for Stable Diffusion XL) that are typically infeasible with CFG, achieving high-quality generations that align well with the input condition without encountering common CFG issues. Thus, we do not believe that the benefits of APG are limited to certain guidance scales shown in the paper.\n\n### **Effect of the parallel component**\nAs shown in Table 2, results with and without the parallel component yield similar FID scores (computed over 10,000 generated samples); however, the model with the parallel component exhibits higher saturation. This suggests that the orthogonal component primarily drives FID, while the parallel component mainly influences saturation. For theoretical insight into this effect, we refer the reviewer to our “gain” argument in Section 4 (beginning around line 186 in the original manuscript).\n\n### **Example in figure 10**\nThis figure primarily illustrates improvements in text quality, where \"hello world\" is misspelled in the CFG figure. Since the base image for CFG contains artifacts (including two extra paws around the sign), our method successfully resolves one but not all of these artifacts in this case."
            }
        },
        {
            "title": {
                "value": "Official Response to Reviewer xLYc"
            },
            "comment": {
                "value": "We thank the reviewer for the positive reception of our paper and for recognizing its strengths. We also thank the reviewer for the opportunity to clarify several points.\n\n\n### **Analysis on rescaling the guidance weight**\nWe believe that the impact of APG extends beyond merely adjusting the guidance weight. A key observation is that modifying the parallel component causes a deviation from the CFG update rule. If we express CFG as $D(x, t, y) + w(D(x, t, y) - D(x, t))$, then we can show that applying the projection alters the update to $w’ D(x, t, y) + w (D(x, t, y) - D(x, t))$ for some constant $w’ \\neq 1$. This transformation cannot be achieved by simply modifying the guidance scale $w$ alone. Therefore, we argue that APG achieves more than just rescaling the CFG weight.\n\nFurthermore, in Appendix C.1, we present experiments combining APG with other methods that effectively adjust the guidance weight, specifically CADS and Interval Guidance (IG). The results indicate that combining APG with these methods yields the best FID compared to each method in isolation. This suggests that APG’s benefits are, to some extent, orthogonal to CFG weight adjustments.\n\n### **Model for figure 8**\nFigure 8 was generated using the EDM2 model for class-conditional ImageNet generation.\n\n### **The trend of the rescale weight**\nWe observed that the norm of the updates increases during the initial steps of inference and then gradually approaches zero as denoising progresses. However, identifying a consistent pattern for this behavior is challenging, as it dynamically varies depending on the input prompt and random seed. We are happy to provide further analysis if this does not fully address the reviewer's comment.\n\n### **Illustrations of the geometry**\nWe would be glad to provide geometric diagrams illustrating the visual interpretation of each step in APG to help guide the reader’s intuition for our approach. If this does not fully address the reviewer's point, we welcome further discussion."
            }
        },
        {
            "summary": {
                "value": "This work aims to reduce the oversaturation in the current CFG approach. The authors decompose the CFG update term into two components—parallel and orthogonal—and both theoretically and empirically demonstrate the role of each component. Based on these observations, they redesign the weighting of each component and additionally propose an adaptive rescaling strategy."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "- The intuition and theory are well-balanced.\n- The results are quite promising. Their guidance does not drastically alter the image content, which aligns well with their claims.\n- They demonstrate robustness across various types of diffusion models."
            },
            "weaknesses": {
                "value": "- I do not view this as a straightforward rescaling of CFG. However, it might be open to interpretation, and I would be interested to hear the authors’ perspective on this.\n\n- Which model was used for Figure 8? \n- Further analysis on the rescale weight would be helpful—does it show any trends with respect to t? \n\n- *(As a suggestion)* Including illustrations of the geometry, along with the related intuitions, would further enhance the clarity."
            },
            "questions": {
                "value": "Please refer to the weaknesses section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 2
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper introduces a novel method called Adaptive Projected Guidance (APG) to address the issue of oversaturation and unrealistic artifacts that occur when using high guidance scales in diffusion models. Specifically, the authors propose a modification to the classifier-free guidance (CFG) update rule by decomposing the update term into parallel and orthogonal components relative to the conditional model prediction. The authors conduct extensive experiments to support their claims."
            },
            "soundness": {
                "value": 4
            },
            "presentation": {
                "value": 4
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "1. The paper introduces a new method, APG, that addresses a significant problem in diffusion models—oversaturation and artifacts associated with high guidance scales. The approach is innovative and directly tackles a well-known issue in the field.\n2. The authors provide extensive experimental results to validate their claims. They demonstrate the effectiveness of APG across various models and samplers, showing improvements in FID, recall, and saturation scores.\n3. The paper provides a clear comparison between APG and CFG, both qualitatively and quantitatively. The visual results are particularly compelling in showing the reduction in oversaturation and artifacts."
            },
            "weaknesses": {
                "value": "1. The final example generated by APG in Figure 10 has a logical error, where the cat has only one paw.\n2. For Table 1, the authors should consider adding HPSv2 and ImageReward metrics to evaluate the generation performance.\n3. For Table 1, why is the guidance scale of Stable Diffusion XL so large (w=15)? When reducing the guidance scale, are the performance improvements limited? The authors should provide more quantitative results.\n4. The authors claim that the orthogonal component is chiefly responsible for improvements in image quality, while the parallel component increases saturation in the generations. How many examples do the authors observe? Are there any theories to support this observation?"
            },
            "questions": {
                "value": "Please refer to the Weakness section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper presents a method called Adaptive Projected Guidance (APG) to address the issues of oversaturation and artifacts that occur when using high guidance scales in Classifier-Free Guidance (CFG) for diffusion models. The authors decompose the CFG update rule into two components: a parallel component responsible for oversaturation and an orthogonal component that enhances image quality. They propose down-weighting the parallel component to reduce oversaturation. Additionally, they introduce rescaling and reverse momentum to improve sampling. Extensive experiments demonstrate that APG can improve FID, recall, and saturation scores while maintaining precision, making it a superior alternative to standard CFG."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 4
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "1. APG is presented as a plug-and-play method with virtually no additional computational overhead, making it attractive for practical use in various diffusion models.\n2. The method of down-weighting the parallel component in CFG is novel and interesting, effectively reducing oversaturation and preserving image quality at high guidance scales."
            },
            "weaknesses": {
                "value": "1. In Figure 8, could the authors explain why the proposed APG shows lower precision and higher FID compared to CFG when the guidance scale  w  is below certain values (e.g.,  w = 2.5 , where APG precision is lower than CFG)?\n2. While reverse momentum is introduced, the intuition behind why it improves the image generation quality could be expanded. More detailed theoretical or experimental exploration of this component would clarify its importance."
            },
            "questions": {
                "value": "See the questions in the weakness section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}