{
    "id": "fErm1seIom",
    "title": "FMP-AE: A HYBRID APPROACH TO TIME SERIES ANOMALY DETECTION",
    "abstract": "Unsupervised anomaly detection in time series presents significant challenges, particularly due to the lack of clear criteria and the prevalence of highly imbalanced data. Traditional statistical and machine learning methods often struggle with low recall rates and computational inefficiency. While deep learning techniques offer the advantage of automatic feature extraction, they are also affected by the issue of data imbalance. This paper introduces an integrated time series anomaly detection model, Feature map Matrix Profile with an AutoEncoder (FMP-AE), which combines matrix profile structures with deep learning techniques. The model leverages a one-dimensional convolutional neural network (1D-CNN) to extract features and compute the matrix profile. Then a novel Matrix Profile loss function is defined and integrated with the Autoencoder's reconstruction loss for model training and anomaly detection. Experimental results on the UCR250 benchmark datasets highlight the model's impressive performance, showing notable success across various metrics, including accuracy, precision, recall, F1-score, and AUC. These findings indicate that the hybrid FMP-AE model, significantly improves accuracy, robustness, and computational efficiency in anomaly detection tasks.",
    "keywords": [
        "Anomaly detection; Matrix Profile; Deep learning;"
    ],
    "primary_area": "learning on time series and dynamical systems",
    "TLDR": "The FMP-AE model enhances time series anomaly detection by integrating matrix profil with deep learning methods for improving accuracy and efficiency.",
    "creation_date": "2024-09-24",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=fErm1seIom",
    "pdf_link": "https://openreview.net/pdf?id=fErm1seIom",
    "comments": [
        {
            "summary": {
                "value": "This paper presents FMP-AE, a hybrid model for unsupervised anomaly detection in time series, combining Matrix Profile (MP) structures with deep learning components, specifically a 1D Convolutional Neural Network (1D-CNN) and an Autoencoder. The novelty lies in introducing an MP-based loss function that complements the Autoencoder’s reconstruction loss to improve anomaly detection performance. The model is evaluated on the UCR250 benchmark, where it demonstrates strong performance across several metrics."
            },
            "soundness": {
                "value": 1
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "1. Combines Matrix Profile with Deep Learning for Anomaly Detection: The paper’s main contribution lies in the integration of Matrix Profile with an Autoencoder, aiming to leverage both global and local sequence information for more robust anomaly detection.\n\n2. Positive Empirical Results on UCR250 Dataset: FMP-AE shows strong empirical results on the UCR250 dataset, indicating that the model is capable of achieving high precision, recall, and F1 scores within this dataset, and the authors conduct ablation studies to explore the contribution of each model component."
            },
            "weaknesses": {
                "value": "1. Incremental Methodological Innovation: While combining Matrix Profile (MP) with Autoencoder reconstruction loss is practical, it mainly builds on existing methods without substantial theoretical innovation. The A.2 Loss Function section explains how this combination may enhance anomaly detection but lacks deeper theoretical justification for why MP loss would improve sensitivity beyond reconstruction loss alone. The explanation is largely empirical, without rigorous theoretical support to clarify this enhancement mechanism.\n\n2. Restricted Dataset Evaluation and Generalizability Concerns: The evaluation is limited to a single dataset, UCR250, which restricts insights into FMP-AE’s applicability across diverse real-world scenarios. Furthermore, there is no theoretical justification for the combined loss function, making it unclear whether the observed improvements generalize beyond this dataset. Expanding the evaluation to include more varied datasets or providing theoretical analysis could help validate the model’s robustness and adaptability.\n\n3. Comparison with Outdated Baselines: The baseline methods used for comparison are primarily from 2022 or earlier, omitting more recent approaches in anomaly detection. This limits the assessment of FMP-AE’s competitiveness against the latest advancements in the field, making it difficult to gauge how the proposed method stands relative to state-of-the-art techniques. A comparison with newer methods would provide a clearer picture of FMP-AE’s effectiveness within the current landscape."
            },
            "questions": {
                "value": "1.\tCould the authors offer further theoretical justification for the combination of MP loss with reconstruction loss? Specifically, what theoretical basis supports the idea that MP loss enhances anomaly detection sensitivity beyond what reconstruction loss alone can achieve?\n\n2.\tHow does FMP-AE perform on other datasets beyond UCR250, and how generalizable is the model across different domains? Additional experiments on varied time series data would help clarify the model’s robustness and adaptability.\n\n3.\tWhy were no post-2022 methods included in the baseline comparisons? Would a comparison with more recent techniques clarify FMP-AE’s standing within the current anomaly detection landscape?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The author proposes a new method for time-series anomaly detection, FMP-AE, which combines the TCN network with the MP algorithm to achieve better detection performance."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "The writing is clear and easy to understand."
            },
            "weaknesses": {
                "value": "Insufficient innovation. The organization of the paper is not good enough and the experiments are not sufficient."
            },
            "questions": {
                "value": "1. The organization of the introduction has a lot of room for improvement. The author's focus should be on TSAD (Time-Series Anomaly Detection) rather than general anomaly detection. Therefore, the introduction should be revised. Additionally, it should explain why past methods face challenges and what their deficiencies are.\n2. The ablation experiment lacks analysis of 1D-CNN + AE.\n3. The analysis in the ablation experiment part lacks some more valuable conclusions. It should not be just a simple comparison of the performance of different methods.\n4. Figure 4 does not show the original time series and abnormal regions, making it difficult to understand the pros and cons of different losses. Moreover, necessary analysis is lacking.\n5. Figures 5 and 6 lack analysis, making it impossible to understand the analysis results of Figure 5. The significance of Figure 6 is unclear, and it is impossible to know the analyzed object and results.\n6. The analysis conclusion of Figure 7 seems to overlap with the previous ones and lacks more insightful conclusions. At the same time, there is no comparison with other methods, lacking persuasiveness.\n7. Figures 4-7 do not indicate on what data the experiments are conducted and there is no comparison with other methods.\n8. In setting up comparison methods, recent works such as NPSR, SimAD, D3R, LLM and other models are lacking.\n9. Figure 10 is difficult to understand, with a large amount of blank time series.\n10. The author does not analyze from the experimental and theoretical levels why their method can solve existing challenges.\n11. There is a lack of necessary comparison of space-time complexity and algorithm time consumption, making it impossible to effectively prove that the author's proposed algorithm is efficient.\n12. The author only validates on one dataset, UCR, lacking mainstream datasets in the current TSAD community such as MSL, SMAP, SMD, etc. It is difficult to evaluate the performance of the algorithm under complex conditions.\n13. There is a lack of analysis of the classic Matrix Profile algorithm. What would be the performance if features are obtained using TCN or MLP and then the classic MP is used?\n14. The author's experimental organization is not good enough and does not effectively verify the motivation of their algorithm.\n15. I suggest that the author open source the code for follow-up research."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper proposes a combination of CNN and matrix profile to detect anomalies. The paper is easy to follow."
            },
            "soundness": {
                "value": 1
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "1. The paper studies an important problem.\n2. It is interesting to consider matrix profile in deep learning."
            },
            "weaknesses": {
                "value": "1. The challenges presented in the paper are well known and have been solved by many other time series anomaly detection methods, such as label scarcity. The paper lacks an argument on why existing methods fails to address these challenges and why the proposed method show advantages over the existing methods to solve these challenges.\n2. The method is quite easy and straightforward. It uses CNN to extract features of time series, and uses MP to compute similarity between subsequences. These are well-known techiniques.\n3. The baselines and datasets are limited. SOTA baselines, such as DCdetector, ModernTCN, D3R, etc., are missing. Only UCR dataset is used, and many other well-known datasets are missing, such as MSL, PSM, SMAP, etc."
            },
            "questions": {
                "value": "See weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper claims that there are three challenges facing by time series anomaly detection work: 1) label scarcity; 2) generalizability; 3) efficiency. Based on this recognition, the authors proposes a time series anomaly detection method by combining a matrix profile and an auto-encoder. The authors believe the matrix profile can improve the method efficiency, but the other two challenges was not discussed. The authors have made some experiments to verify the effectiveness of their method, but not compared with the most SOTA baselines. Besides, they also do not prove that the proposed method can improve method efficiency experimentally."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "1. Overall well written. The paper is easy to follow and understand.\n2. The idea of matrix profile is somewhat novel in time series anomaly detection."
            },
            "weaknesses": {
                "value": "1. Unsolved challenges. As mentioned in summary part, this paper mainly proposes three challenges. However, the authors only claim that the proposed method is more efficient by introducing matrix profile. The other two challenges is not solved by the proposed method. Also, it is not clear why matrix profile combining with an auto-encoder can improve the method efficiency compared with a solely auto-encoder.\n2. Unpersuasive experiments. On one hand, the proposed methods do not compare with the most SOTA methods, for example [1] [2] [3]. The latest method included in baseline is published in 2022. On the other hand, since the authors claimed that introducing matrix profile can improve method efficiency in their contributions, they should also have made experiment to prove it. However, this aspect is not discussed thoroughly in experiment.\n3. Limited contribution. There are mainly two part in the proposed method: one is matrix profile and another is an auto-encoder. The structure of auto-encoder is really common by combining max-pool and CNN. The matrix profile may be somewhat novel, but it is a really marginal improvement.\n4. Misunderstanding of the shortage of deep-learning-based anomaly detection methods. In the abstract, the authors claimed that deep-learning-based anomaly detection methods is affected by data imbalance problem. Actually, many unsupervised deep-learning-based anomaly detection methods assume there are fewer anomalous samples in training set, so that when training by it, the model can better fit the normal pattern rather than anomalous one. Thus, deep-learning-based anomaly detection method actually benefit from those data imbalance.\n\n[1] Yang Y, Zhang C, Zhou T, et al. Dcdetector: Dual attention contrastive representation learning for time series anomaly detection[C]//Proceedings of the 29th ACM SIGKDD Conference on Knowledge Discovery and Data Mining. 2023: 3033-3045.\n\n[2] Li Y, Chen W, Chen B, et al. Prototype-oriented unsupervised anomaly detection for multivariate time series[C]//International Conference on Machine Learning. PMLR, 2023: 19407-19424.\n\n[3] Tuli S, Casale G, Jennings N R. Tranad: Deep transformer networks for anomaly detection in multivariate time series data[J]. arXiv preprint arXiv:2201.07284, 2022."
            },
            "questions": {
                "value": "1. Could you please add some statics about the proposed method efficiency and baseline efficiency?\n2. Why matrix profile combining an auto-encoder can improve the method efficiency, compared with a solely auto-encoder?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper proposed a model based on the computation of Feature map Matrix Profile, combined with an Autoencoder (FMP-AE) for time series anomaly detection. It introduces a novel loss function which enhances the model’s ability to detect anomalies by leveraging both global similarity and local feature reconstruction. The Matrix Profile is also designed based on the 1D-CNN extracted feature for a rapid and reliable identification of anomalies. Extensive experiments on UCR250 benchmark datasets demonstrate the effectiveness of the proposed method."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "- The unsupervised time series anomaly detection task is quite challenging, the author build a unified hybrid solution and demonstrate great results.\n\n- The paper is well-organized and clearly written, and it provides enough figures and demonstration to explain the methods well.\n\n- I like the ablation study part, it clearly shows the effectiveness of each utilized component."
            },
            "weaknesses": {
                "value": "The paper writing and the proposed method all look good to me, however, I do have concerns on the experiment part.\n\n- The experiments are only conducted on the UCR Anomaly Detection dataset, while the recent papers usually conduct experiments on multiple datasets to make the results more convincing (e.g., apart from UCR, AD Transformer also reports the results on SMD , PSM, MSL& SMAP, SWaT,  NeurIPS-TS etc.).\n\n- The compared methods are relatively old (AD transformer is proposed on 2021 and published on 2022), how about compared with some recent  methods (2023 ~ 2024). For example, \n\n[D3R]  Drift doesn’t matter: Dynamic decomposition with diffusion reconstruction for unstable multivariate time series anomaly detection\n\n[GPT4TS] One fits all: Power general time series analysis by pretrained LM\n\n[ModernTCN] ModernTCN: A modern pure convolution structure for general time series analysis.\n\n[SensitiveHUE]  Sensitivehue: Multivariate time series anomaly detection by enhancing the sensitivity to normal patterns.\n\n- It's hard to say it outperforms ADTransformer on UCR, since the recall of UCR results is higher, there's a trade of between the precision and the recall (F1 measurement usually cannot accurately catch this trade off). Besides, from their paper, the P=72.80, R=99.60, and F1=84.12, which are different from what you reported."
            },
            "questions": {
                "value": "- Did you also evaluate on other datasets? Could you share some data points?\n\n- It would be better if you also compared with the recent methods.\n\n- Could you provide some info on why ADTransformer is different from their reported results, and what might be the cause?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}