{
    "id": "fmTY6QQHnQ",
    "title": "EventFlow: Forecasting Continuous-Time Event Data with Flow Matching",
    "abstract": "Continuous-time event sequences, in which events occur at irregular intervals, are ubiquitous across a wide range of industrial and scientific domains. The contemporary modeling paradigm is to treat such data as realizations of a temporal point process, which is typically modeled in an autoregressive fashion by a neural network. While autoregressive models are successful in predicting the time of a single subsequent event, their performance is unsatisfactory in forecasting longer horizons due to cascading errors. We propose $\\texttt{EventFlow}$, a non-autoregressive generative model for temporal point processes. Our model builds on the flow matching framework in order to directly learn the joint distributions over event times, side-stepping the autoregressive process. $\\texttt{EventFlow}$ is easy to implement and sample from, and achieves state-of-the-art performance in both unconditional and conditional generation tasks on a set of standard benchmarks.",
    "keywords": [
        "temporal point processes",
        "generative models",
        "event sequences"
    ],
    "primary_area": "generative models",
    "TLDR": "We propose EventFlow, a non-autoregressive generative model for event sequences which achieves state-of-the-art performance on multi-step forecasting tasks.",
    "creation_date": "2024-09-26",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=fmTY6QQHnQ",
    "pdf_link": "https://openreview.net/pdf?id=fmTY6QQHnQ",
    "comments": [
        {
            "summary": {
                "value": "The work proposes a generative approach of modelling (unmarked) temporal point process based on diffusion models. The work decompose the distributions of temporal pointe process into the joint distribution of the number of events in a TPP realization and the joint distribution of event time conditioned on the number of events via a diffusion model in the rectified flow fashion. The proposed approach can be conditioned on history information for generate future events. Evaluation results on both unconditional generation results on commonly used TPP datasets and conditional future events forecasting shows superior performance of the model over baselines."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "The work has the following strengths:\n* This work extends diffusion models to the domain of temporal point process with a clear motivation of modelling joint distributions of events. This motivation positions the work as a novel approach toward the challenging task of future events forecasting in a fixed time horizon instead of single next event prediction. Experiment results also show clear advantages of the proposed work in multi-events forecasting in a fixed time window over existing works.\n* The decomposition of TPP distribution into the distribution of the number of events and the joint distributions of event times is also a novel approach toward TPP modelling."
            },
            "weaknesses": {
                "value": "The work has the following weakness:\n* The presentation of the work has room of improvements:\n    * It is not clear what’s the purpose of introducing balanced coupling of TPPs in Section 4.1. The interpolation between two event sequences can be well defined without introducing balanced coupling and the number of events is modelled separately. In other words, the presentations of the methods does not necessarily rely on the introduction of balanced coupling and the theoretical results of the iff condition for the balanced coupling set to be non-empty. It would be helpful to add some intuitive motivation for this section in the work.\n    * In the current presentation of approach, the original contribution (Section 4.1, 4.2, separate modelling of event count and event time) and existing work (Sections 4.3, 4.4, mostly rectified flows[1]) are intertwined in one section. I would suggest the authors to consider either clearly separating their original contributions from the methods in existing works or more clearly stating their contributions in terms of methodology instead of using generic statements of contributions like a generative model for TPP.\n* The work constrains the type of TPP it models to unmarked temporal point process without event category labels. The practical values of the work is limited. \n* It is arguable that MSE/RMSE for next event prediction is one of the most important evaluation results for TPP models due to its wide existence in many existing TPP works [2, 3, 4], practical applicability, and easiness to compare between models. As the work is capable of conditional generation, not including this evaluation task results is disappointing.\n\nReferences\n\n[1] Liu, Xingchao, Chengyue Gong, and Qiang Liu. \"Flow straight and fast: Learning to generate and transfer data with rectified flow.\" arXiv preprint arXiv:2209.03003 (2022).\n\n[2] Yang, Chenghao, Hongyuan Mei, and Jason Eisner. \"Transformer embeddings of irregularly spaced events and their participants.\" arXiv preprint arXiv:2201.00044 (2021).\n\n[3] Shchur, Oleksandr, Marin Biloš, and Stephan Günnemann. \"Intensity-free learning of temporal point processes.\" arXiv preprint arXiv:1909.12127 (2019).\n\n[4] Xue, Siqiao, et al. \"Easytpp: Towards open benchmarking the temporal point processes.\" arXiv preprint arXiv:2307.08097 (2023)."
            },
            "questions": {
                "value": "1. Do the models for conditional and unconditional generation share parameters?\n2. The EventFlow model does not guarantee the generated sequences of event times preserves the original order of $\\gamma_0$ but simply relies on learning such prior from training data. Does the work anpply any post-processing to generated results to deal with this potential problem? If not, do the authors encounter situations where the generated event sequence times are not in an increasing order?\n3. The author claims the approach is likelihood-free. Is the re-ordering of sampled $\\gamma_0$ part of the reasons that make the model incapable of evaluating likelihood of event sequences? Is it possible to define the distribution which $\\gamma_0$ is sampled from in a fashion such that the $t_s$ are naturally in an ascending order?\n4. Can the approach be extended to model marked TPP with event category labels in trivial ways like using the the hidden states of the denoising neural networks $\\v_\\theta$ to predict event categories?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper introduces EventFlow, a novel generative model for temporal point processes (TPPs). Unlike existing autoregressive models that predict events one at a time and suffer from compounding errors, EventFlow directly learns joint distributions over event times, enabling more accurate multi-step forecasting. The model is likelihood-free, making it easier to implement and sample from than existing methods. EventFlow's performance is evaluated on various synthetic and real-world datasets, consistently outperforming existing methods in both unconditional generation and multi-step forecasting tasks (forecasting in a given window) ."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 4
            },
            "strengths": {
                "value": "Originality: this is a novel generative model for temporal point processes that bypass the autoregressive paradigm; potential the second model in this category ( the first being diffusion point process by ludke et al.) \n\nQuality: the paper is very technical and technicality comes from defining appropriate probability measures; the authors reaches to an important conclusion – proposition 1, based on which they proposed eventflow. The proposed method eventflow including interpolant construction and training, and sampling seems very solid (although I did check the full details.) The paper also examines the two important cases conditional forecasting and unconditional with respect to history and conducts experiments which demonstrate the effectiveness. \n\nClarity: it is well presented for the most part. \n\nSignificance: I think this is an interest line of research as it deviates from traditional autoregressive models for TPP and I believe it is worthy of investigation by our community."
            },
            "weaknesses": {
                "value": "My main concern/weakness is evaluation. Especially for forecasting tasks where a separate model is learned for the event count distribution pφ(n | H). The authors treat the problem as classification. I assume learning is from the training data, where in some target window we have {1,…,N} events as target. The learned pφ(n | H) is then used to sample a count n for a specific instance for further inference task. For the experiments, while the authors use MMD as a metric for sequence distance, I don’t know how the forecasted number of events compared with the ground truth. Similarly I am not entirely sure how the forecasting times compared with the ground truth. Some visual aids will be very helpful."
            },
            "questions": {
                "value": "Can the authors clarify at what flow time do the authors use as results reported for your experiments, since s is discretized."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper proposes EventFlow, a flow-matching model for temporal point processes. EventFlow is evaluated on conditional and unconditional generative tasks. In contrast to previous diffusion-based approaches, balanced couplings are used, and the number of events does not change during generation. Therefore, the inference process consists of multiple steps: (1) EventFlow samples (unconditional) or predicts (conditional) the number of events. (2) A prior sequence $\\gamma_0$ is sampled from a mixed-binomial TPP. (3) The sequence $\\gamma_1$ is computed by solving the ODE with the vector field $v_\\theta$.\n\nIn an experimental evaluation, EventFlow shows promising results and consistently outperforms multiple baselines."
            },
            "soundness": {
                "value": 4
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "- EventFlow models the event times of sequences via a CFM. The resulting model is more straightforward, more elegant, and effective than previous diffusion-based approaches.\n- The evaluation includes a reasonable number of experiments, including unconditional and conditional comparisons on multiple datasets. \n- The results show strong improvements compared to diffusion-based baselines.\n- The paper is easy to follow, and the methodology is clearly described.\n- The baselines are reasonably tuned."
            },
            "weaknesses": {
                "value": "- The biggest weakness, in my opinion, results from the use of balanced couplings. Modeling the event count distribution $p_\\theta(n\\mid \\mathcal{H})$ with a deterministic classifier limits the distributional forecast, which is not the case for AddAndThin. I assume this would be more noticeable in a likelihood-based evaluation.\n- The paper does not discuss whether a likelihood evaluation is possible. As EventFlow is based on a CNF, evaluating the likelihoods of single sequences should be possible. Including an NLL-based comparison, as done in other works (Shchur et al., 2019), would strengthen the evaluation.\n- Certain hyperparameters are missing. How many neural function evaluations are used to solve the ODE? An ablation would help compare the performance with previous diffusion-based approaches.\n- A runtime comparison with AddAndThin needs to be included. Especially as EventFlow uses an attention-based model.\n\nMinors:\n- page 4 footnote: i.e. -> i.e., \n- Shchur et al. (2019) is cited twice (arxiv and ICLR)"
            },
            "questions": {
                "value": "- Is computing the likelihood for single sequences possible?\n- Are the prior sequences ordered? I.e., can the paths of events cross when interpolating between $\\gamma_0$ and $\\gamma_1$?\n- Are the quantitative results of the classifier $p_\\theta(n\\mid \\mathcal{H})$?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The authors created a non-autoregressive model framework for continuous-time event sequences by using flow-matching. This allows them to skip the autoregressive process and also account for irregular time intervals. They achieve good results on a synthetic dataset and real world datasets compared to other baselines."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "Paper is clear and is quite original with the framework of flow-matching; math is clear and has good structure."
            },
            "weaknesses": {
                "value": "I would've liked to see some more comparison against non-autoregressive type models for generation, such that it clarifies why the authors choose to use flow matching in particular. Comparatively, MMD wise the metric always measures with respect to the distribution, so with respect to this metric joint distribution models instead of autoregressive ones would have the advantage here.\nI would like to see some more discussion on the synthetic datasets with IFTPP; why are the performances on the synthetic plot better as compared to the real world data?"
            },
            "questions": {
                "value": "How does the length affect the corresponding accuracy? Is there an error vs sequence position plot?\nJust a note that the appendix should be in the supplementary material and not the main portion :)"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 2
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}