{
    "id": "FtjLUHyZAO",
    "title": "Diffusion Generative Modeling for Spatially Resolved Gene Expression Inference from Histology Images",
    "abstract": "Spatial Transcriptomics (ST) allows a high-resolution measurement of RNA sequence abundance by systematically connecting cell morphology depicted in Hematoxylin and eosin (H\\&E) stained histology images to spatially resolved gene expressions. ST is a time-consuming, expensive yet powerful experimental technique that provides new opportunities to understand cancer mechanisms at a fine-grained molecular level, which is critical for uncovering new approaches for disease diagnosis and treatments. Here, we present $\\textbf{Stem}$ ($\\underline{\\textbf{S}}$pa$\\underline{\\textbf{T}}$ially resolved gene $\\underline{\\textbf{E}}$xpression inference with diffusion $\\underline{\\textbf{M}}$odel), a novel computational tool that leverages a conditional diffusion generative model to enable in silico gene expression inference from H&E stained images. Through better capturing the inherent stochasticity and heterogeneity in ST data, $\\textbf{Stem}$ achieves state-of-the-art performance on spatial gene expression prediction and generates biologically meaningful gene profiles for new H&E stained images at test time. We evaluate the proposed algorithm on datasets with various tissue sources and sequencing platforms, where it demonstrates clear improvement over existing approaches. $\\textbf{Stem}$ generates high-fidelity gene expression predictions that share similar gene variation levels as ground truth data, suggesting that our method preserves the underlying biological heterogeneity. Our proposed pipeline opens up the possibility of analyzing existing, easily accessible H&E stained histology images from a genomics point of view without physically performing gene expression profiling and empowers potential biological discovery from H&E stained histology images.",
    "keywords": [
        "Gene Expression Prediction",
        "Diffusion Model",
        "Spatial Transcriptomics",
        "H&E"
    ],
    "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)",
    "TLDR": "",
    "creation_date": "2024-09-28",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=FtjLUHyZAO",
    "pdf_link": "https://openreview.net/pdf?id=FtjLUHyZAO",
    "comments": [
        {
            "summary": {
                "value": "The authors propose STEM, which is a conditional diffusion generative model-based ST prediction framework. On two public datasets, the authors show that STEM outperforms the state-of-the-art ST prediction methods. The authors also show through a series of ablation experiments what factors are contributing to good performance of their model."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "I think STEM adds a valid contribution to a large suite of ST-prediction methods, which are predominantly regression-based approaches (except for BLEEP, which relies on the embedding neighborhood in the training set). The application of generative model is novel, the strength of which is clearly shown in the great performance. I also appreciate that the authors invested efforts into several ablation study factors and carefully designed the experiments to mitigate potential bias (which I don't think BLEEP did well at all). Assuming that the codebase is provided, I think this can be integrated into pratictioner's toolbox."
            },
            "weaknesses": {
                "value": "I think there are several weaknesses that the authors can address to make it an even better contribution to the field.\n\n- For reproducibility, the authors NEED to be more specific about hyperparameters used in STEM - I don't think any information was provided.\n- This is a generative model, meaning multiple gene predictions are generated from the given histology image. While the authors say that these are averaged to yield the final expression, I would like to see an ablation or example of what each sample looks like and how they would affect all the performance metrics that we observe.\n- While not required, I would like to see the authors also try with different histopatholgy foundation models, such as Virchow or H-Optimus, just for robustness\n- I am slightly confused as to why TRIPLEX performance is really low. In their CVPR 2024 paper, they show that TRIPLEX outperforms HisToGene and BLEEP significantly. But it is really bad. Have authors used their model properly?\n- To really show that it is indeed the *conditional generative model* part of STEM contributing to the increase PCC performance, the authors need to be careful in comparing to other SOTA baselines. BLEEP uses ResNet50, TRIPLEX uses Resnet18, whereas STEM uses UNI or CONCH. Could the difference simply be coming from difference in patch encoders?\n- The authors (in line 78~80) argue that even same cell type might be in different cell types of differ in spatial locations causing different gene expression outcomes and that previous models cannot 'capture them. However, I am not sure if STEM can also address this shortcoming of the previous models, since it is also simply using patch encoder (albeit a powerful one) to summarize the image patch.\n- When encoding gene count, the input is a scalar, passed through MLP? The authors need to elaborate more on what this MLP structure is, since it is confusing.\n- In encoder ablation study, what does CONCH+UNI mean? Simple concatenation of both features?"
            },
            "questions": {
                "value": "See weakness"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "**Motivation:** Infer spatial resolved gene expression only from histology images\n**Technical contribution:** A diffusion model based approach is proposed to predict spatial gene expression from histology images\n**Strengths:** The paper is clearly written and the results support the story. The method is easy to understand and effective.\n**Weakness:** The novelty of proposed method (clever application vs. novel technical contribution) is not very clear. Analysis can be expanded to more datasets.  \n\n**Justification of score:** Overall, the paper proposes a simple and effective method, which is above acceptance threshold. I would be happy to revise my score pending clarifications on my questions from the authors."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "**Clear grounding of literature:** The introduction and related works sections are comprehensive and ground the problem well. In addition to working on better predicting gene expression, the authors also highlight problems with current simplistic evaluation framework based on Pearson correlation. They also propose new measures of correctness. Overall, the paper is clearly written.\n\n**Comparison with recent baselines:** The authors benchmarked their model against recent baselines, such as BLEEP."
            },
            "weaknesses": {
                "value": "**Additional evaluation**\nWhile the authors do demonstrate their method on two datasets and organs, there is a large amount of spatial transcriptomics data available publicly [1]. I encourage the authors to try it out and see if their method works equally well for different organs, cancer vs. non-cancer, and/ or different species.\n\n**Using pre-trained encoders for gene expression**\nThe authors seem to train from scratch their gene value encoder. Can they comment on why do they do this when numerous gene expression encoder foundation models are available, such as scGPT [2]? While these encoders have been trained on single cell data, they have shown promising results for bulk expression, hence showing their versatility. \n\n**Limited novelty**\nThe proposed method seems like a clever application of conditional diffusion models to the problem. Can the authors further comment on the novelty of their method and how is it different compared to the existing literature?\n\n\n\n---\nReferences \n[1] Jaume, Guillaume, et al. \"Hest-1k: A dataset for spatial transcriptomics and histology image analysis.\" arXiv preprint arXiv:2406.16192 (2024).\n[2] Cui, Haotian, et al. \"scGPT: toward building a foundation model for single-cell multi-omics using generative AI.\" Nature Methods (2024): 1-11."
            },
            "questions": {
                "value": "- Was any batch correction applied to the spatial transcriptomics data?\n- Since many metrics are presented in the table, it might be easier to interpret them if authors have conventional up and down arrows next to the metric name.\n- What was the rationale behind trying only UNI and CONCH, when larger models exist, such as Virchow [1]?\n\n---\nReferences\n[1] Vorontsov, Eugene, et al. \"A foundation model for clinical-grade computational pathology and rare cancers detection.\" Nature medicine (2024): 1-12."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The authors proposed a novel computational tool that leverages a conditional diffusion generative model to enable in silico gene expression inference from H&E stained images. This tool can capture better heterogeneity and stochasticity of ST data and achieve SOTA on the gene expression prediction across various datasets with different metrics."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 4
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "The authors considered a limitation I fully agreed with: gene expression cannot be gained from cellular morphology only. To solve this, proposed model learns a conditional distribution over the potentially associated gene expression profiles given the histology images, facilitating a one-to-many correspondence between the image and ST data."
            },
            "weaknesses": {
                "value": "I think the model should be tested with larger gene panel (maybe thousands of genes) to evaluate the performance limits compared with other methods. I also want to see the evaluation other than the datasets with super-resolution spots (for example, how about the performance under Slide-seq? Stereo-seq? or Even in situ technologies?). Does the image patch size change to match the size of the spots?"
            },
            "questions": {
                "value": "1. I suggest testing the model with a larger gene panel (>1000) and compare with other methods.\n2. I suggest testing on datasets generated by other platforms (Slide-seq, Stereo-seq, or in situ technologies).\n3. For Figure 3, it is not enough to choose one sample with two marker gene. I would like to see more visualization results with more marker genes across different cell types. More importantly, compare these visualization results with existing methods. I would like to see the difference about cell type identification.\n4. Since the authors used a transformed version of original histology images, I want to know how they transformed images.\n5. How many genes did authors used for calculating MSE and MAE?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}