{
    "id": "ja4rpheN2n",
    "title": "GeSubNet: Gene Interaction Inference for Disease Subtype Network Generation",
    "abstract": "Retrieving gene functional networks from knowledge databases presents a challenge due to the mismatch between disease networks and subtype-specific variations. Current solutions, including statistical and deep learning methods, often fail to effectively integrate gene interaction knowledge from databases or explicitly learn subtype-specific interactions. To address this mismatch, we propose GeSubNet, which learns a unified representation capable of predicting gene interactions while distinguishing between different disease subtypes. Graphs generated by such representations can be considered subtype-specific networks. GeSubNet is a multi-step representation learning framework with three modules: First, a deep generative model learns distinct disease subtypes from patient gene expression profiles. Second, a graph neural network captures representations of prior gene networks from knowledge databases, ensuring accurate physical gene interactions. Finally, we integrate these two representations using an inference loss that leverages graph generation capabilities, conditioned on the patient separation loss, to refine subtype-specific information in the learned representation. GeSubNet consistently outperforms traditional methods, with average improvements of 30.6%, 21.0%, 20.1%, and 56.6% across four graph evaluation metrics, averaged over four cancer datasets. Particularly, we conduct a biological simulation experiment to assess how the behavior of selected genes from over 11,000 candidates affects subtypes or patient distributions. The results show that the generated network has the potential to identify subtype-specific genes with an 83% likelihood of impacting patient distribution shifts. The GeSubNet resource is available:  https://anonymous.4open.science/r/GeSubNet/",
    "keywords": [
        "Gene Functional Networks",
        "Disease Subtypes",
        "Bioinformatics"
    ],
    "primary_area": "learning on graphs and other geometries & topologies",
    "TLDR": "Gene interaction inference for disease subtype network generation",
    "creation_date": "2024-09-27",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=ja4rpheN2n",
    "pdf_link": "https://openreview.net/pdf?id=ja4rpheN2n",
    "comments": [
        {
            "summary": {
                "value": "The authors present a novel algorithm that identifies gene-to-gene interactions and disease subtypes. It has three components: A disease subtype from gene expression detection, second a gene network deep learning, and thirdly a part that combines both representations. This approach has out perform several SOTA algorithms."
            },
            "soundness": {
                "value": 4
            },
            "presentation": {
                "value": 4
            },
            "contribution": {
                "value": 4
            },
            "strengths": {
                "value": "The authors present a novel method for creating gene-gene interactions that are aware of disease subtypes. They also present a new combination architecture and a novel method for integrating knowledge graphs and gene expression data, as well as a shared integrated dataset. \nThe paper is very clear and presents the underlying biological problem concisely. The mathematical formulation of the problem is well presented as well. \nThe different experiments conducted are very well displayed and designed."
            },
            "weaknesses": {
                "value": "The authors did not explain the principal way they selected the baseline methods; in other words, why was this method selected and not others? Why did the authors not add or remove methods?\nIn table two, while the GeneSubNet is significantly better, how can we know if this is an outlier of the training process or a significant improvement? This can be attained by repeated training and presenting the mean with SD or maybe other statistical insight. Specifically, in line 365, by which statistical measure was the importance ascertained? \nLine 416: could you cite why you can infer the \"functional distinctions...\" this might belong to the conclusions."
            },
            "questions": {
                "value": "Can you expand on why you think your method outperformed the other methods? Maybe such an addition could be an excellent addition to the discussion."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 8
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The manuscript introduces a novel method, GeSubNet, for generating disease subtype-specific networks from general gene-gene interaction networks. The approach combines a deep generative model to learn distinct disease subtypes from patient gene expression profiles and a graph neural network to capture representations of prior gene networks from knowledge databases. By integrating these two representations, GeSubNet generates subtype-specific gene networks. The experimental results demonstrate that GeSubNet outperforms traditional methods across four cancer datasets."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "1. Generating disease subtype-specific networks from general gene-gene interaction networks is a critical challenge in the field of precision medicine. \n\n2. The manuscript introduces the concept of geometric subnetworks (GeSubNet), with detailed descriptions of the algorithms used and the validation process.\n\n3. The paper is well-written and structured."
            },
            "weaknesses": {
                "value": "1. The baseline methods used in the comparative analysis are limited. Most of the current baselines are not specifically designed for subtype network generation. \n\n2. The ablation study is limited. A more comprehensive ablation study that evaluates the contributions of individual components (e.g., the \ndeep generative model and the graph neural network), and the databases, would provide deeper insights into the effectiveness of the model.\n\n3. What are the computational requirements of the GeSubNet algorithm, particularly in terms of runtime and memory usage? How scalable is the method for very large datasets?\n\n4. Figure 1 is hard to understand, particularly the flow of how expression data is integrated into the knowledge graph, as described in Section 3.2."
            },
            "questions": {
                "value": "see above"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The work presented introduces a novel methodology for gene interaction detection and disease subtype network generation. The topics addressed are of extreme importance in bioinformatics and biomedical machine learning since current methodologies fall short in determining disease subtype networks and limit themselves to the identification of broader networks related to a disease without a fine-grained differentiation between subtypes. The authors present GeSubNet, an architecture composed of three parts. Block 1 is endued with the encoding of gene expression data describing patients. Block 2 deals with the ending of the gene-gene interactions. Block 3 is tasked with determining disease subtype networks. The experiments confirm the biological relevance of the networks obtained and outperform other inference methods also in terms of enrichment analysis, in which GeSubNet is able to detect more enricher terms with respect to its compared counterparts. In the cancer use case presented, the enricher terms are confirmed to be associated with cancer by previous clinical studies."
            },
            "soundness": {
                "value": 4
            },
            "presentation": {
                "value": 4
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "The main strengths of the paper are the following:\n\n1) The work presented is novel. It proposed a new and effective architecture for the task of interest.\n\n2) The methodology is clearly presented, and the experiments are carried out carefully and described thoroughly. In particular, the analysis of the biological relevance of the network further validates the results and highlights the relevance of the methodology for this non-trivial bioinformatics task.\n\n3) The gene knockout simulation is really interesting and seems effective. \n\n4) The method presented outperforms the compared methodologies both quantitatively and qualitatively.\n\n5) Code is provided by the authors allowing for inspection and reproduction of the results.\n\nI believe the points I highlighted make it a good paper. Despite the strong bioinformatics focus, I believe the paper is relevant to the broader machine-learning community, given its substantial methodological contribution."
            },
            "weaknesses": {
                "value": "Some weaknesses are the following:\n\n1) There are some language inconsistencies in the paper. The authors refer to their method both as GeSubNet and GenSubNet. I believe those are typos.\n\n2) In Figures 1 and 2 the authors seem to have used the \"comic sans\" font. Please refrain from using that in scientific writing. Moreover, some parts of the text are in bold, italics, or colored. I would suggest writing those parts with no particular font style or color. Also, in lines 103-104, when the authors introduced the name of their methodology, I suggest the authors don't use different fonts to highlight the letters in the words that form the name; bold or capital letters, in this case, work fine.\n\n3) In line 299, introducing abbreviations with a phrase, which is not a clause (so with no verb), sounds not correct. I suggest the authors introduce the abbreviations together with the methods or in the caption of Table 1.\n\n4) There are some misunderstandings about GO terms. The authors refer to \"biological functions,\" but GOs (gene ontologies) are divided into \"biological processes,\" \"cellular components,\" and \"molecular function.\" I guess the authors are referring to \"biological processes,\" but this should be clarified.\n\nAdditional typos:\n\nLine 38: \"web lab\". I guess this should be \"wet lab\".\nTable1: I think that the names that follow #, which stands for \"number\", should be written in plural.\nLine 414: cannot involved -> cannot be involved."
            },
            "questions": {
                "value": "Overall, I find the paper really interesting. I would simply ask the authors to deal with the \"weak points\" I described. Moreover, did the authors test the methodology also on different diseases? it would be interesting to see the method applied to detect other disease subtypes. This would further prove the validity and efficacy of the method. However, this would be a \"plus\" since the work presented, in my opinion, contains enough scientific content for publication."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 8
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}