{
    "id": "L5NUDBdHqR",
    "title": "Nacala-Roof-Material: Drone Imagery for Roof Detection, Classification, and Segmentation to Support Mosquito-borne Disease Risk Assessment",
    "abstract": "As low-quality housing and in particular certain roof characteristics are associated with an increased risk of malaria, classification of roof types based on remote sensing imagery can support the assessment of malaria risk and thereby help prevent the disease. To support research in this area, we release the Nacala-Roof-Material dataset, which contains high-resolution drone images from Mozambique with corresponding labels delineating houses and specifying their roof types. The dataset defines a multi-task computer vision problem, comprising object detection, classification, and segmentation. In addition, we benchmarked various state-of-the-art approaches on the dataset. Canonical U-Nets, YOLOv8, and a custom decoder on pretrained DINOv2 served as baselines. We show that each of the methods has its advantages but none is superior on all tasks, which highlights the potential of our dataset for future research in multi-task learning. While the tasks are closely related, accurate segmentation of objects does not necessarily imply accurate instance separation, and vice versa. We address this general issue by introducing a variant of the deep ordinal watershed (DOW) approach that additionally separates the interior of objects, allowing for improved object delineation and separation. We show that our DOW variant is a generic approach that improves the performance of both U-Net and DINOv2 backbones, leading to a better trade-off between semantic segmentation and instance segmentation.",
    "keywords": [
        "remote sensing",
        "deep learning",
        "disease risk assessment",
        "roof classification",
        "instance segmentation",
        "semantic segmentation",
        "multi-task learning"
    ],
    "primary_area": "datasets and benchmarks",
    "TLDR": "We introduce a multi-task data set for risk assessment of mosquito-borne diseases, which contains drone imagery from Mozambique in which houses and roof materials are labelled, and benchmark state-of-the-art and novel approaches on these data.",
    "creation_date": "2024-09-26",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=L5NUDBdHqR",
    "pdf_link": "https://openreview.net/pdf?id=L5NUDBdHqR",
    "comments": [
        {
            "summary": {
                "value": "This paper introduces the Nacala-Roof-Material dataset, a high-resolution drone imagery dataset collected from informal settlements in Nacala, Mozambique. The dataset is designed to assist in research on roof detection, classification, and segmentation, with a specific focus on mitigating mosquito-borne disease risks, such as malaria, which are influenced by housing quality and roof materials. The authors define three primary tasks using this dataset: building detection, multi-class roof type classification, and pixel-level building segmentation. Several state-of-the-art models, including U-Net, YOLOv8, and DINOv2, are benchmarked to evaluate performance on these tasks. Additionally, the paper proposes the Deep Ordinal Watershed (DOW) method, which improves segmentation accuracy by separately delineating building exteriors and interiors. By releasing this dataset and associated benchmarks, the authors aim to advance research on using remote sensing for public health applications."
            },
            "soundness": {
                "value": 4
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "__Significance and Novelty:__\n\nThe paper addresses a crucial public health challenge by linking housing conditions with mosquito-borne disease risk assessment. This intersection of computer vision and epidemiology is novel and holds significant societal impact, especially in resource-limited regions. By providing a high-resolution drone imagery dataset focused on roof material classification, the research fills a gap left by existing lower-resolution datasets that do not distinguish between specific roof types.\n\n__Soundness of the Claims:__\n\nTheoretical grounding is evident as the authors effectively combine concepts from computer vision with epidemiological insights. The benchmarked models are carefully selected, and the inclusion of the DOW method demonstrates a thoughtful approach to improving segmentation outcomes. The experimental setup is robust, with a detailed analysis of various metrics, including intersection over union (IoU) and AP scores, ensuring empirical validity.\n\n__Empirical Evaluation:__\n\nThe extensive empirical evaluation demonstrates that no single model is superior across all tasks, providing valuable insights for future researchers. By comparing models on multiple segmentation and classification metrics, the study offers a nuanced understanding of model performance, emphasizing practical limitations and advantages of each approach. The statistical analysis adds credibility, and the publicly available dataset promotes reproducibility."
            },
            "weaknesses": {
                "value": "__Generalization Concerns:__\n\nAlthough the dataset provides a meaningful resource, it is limited to a single geographic region, which may affect the generalizability of the findings. The paper does not explore how well models trained on this dataset might perform in different regions with varying architectural styles or environmental conditions, which is a crucial aspect for real-world applications.\n\n__Limited Baseline Diversity:__\n\nWhile the models benchmarked are popular, the study could benefit from including more diverse architectures or emerging models from the latest research to better assess the dataset’s full potential. Additionally, the DOW method is compared mainly against traditional segmentation methods without an extensive exploration of other advanced post-processing techniques.\n\n__Computational Resource Requirements:__\n\nThe paper mentions that training the models requires significant computational power, which could be a barrier for adoption, particularly in the regions where this research is most needed. This limitation reduces the accessibility of the proposed methods, especially for small organizations or researchers with limited resources."
            },
            "questions": {
                "value": "1. How well would the models generalize to datasets from different geographical areas with varying building styles and materials?\n\n2. Are there plans to extend the dataset to include more regions to enhance generalization and applicability across sub-Saharan Africa or similar environments?\n\n3. What measures were taken to ensure that the manual annotations are free from bias, and how might annotation inconsistencies affect the benchmark results?\n\n4. How does the DOW method compare against other state-of-the-art post-processing techniques for object delineation beyond watershed-based methods?\n\n5. Are there specific public health interventions or organizations already interested in or collaborating on using these findings?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "**A. Major Issues**\n\n1. **Geographic Limitation:**  \n   The dataset is collected from a single region in Nacala, Mozambique, which might not represent roof materials or building styles across other malaria-endemic areas. This could limit the generalization and scalability of the models to diverse settings.\n  \n2. **Computational Resources:**  \n   The training and testing of models require considerable computational power, which might not be feasible for deployment in resource-limited settings where the research is most needed. This restricts the practical use of these models and their accessibility.\n  \n3. **Model Performance Variability:**  \n   The results indicate that no model performs uniformly well across all tasks, suggesting limitations in current architectures for this multi-task problem. The inconsistent performance, particularly on minority roof types, could reduce the practical utility of the models.\n  \n4. **Potential for Annotation Errors:**  \n   Although the annotation process was rigorous, the reliance on manual annotations introduces the risk of bias or error, especially when distinguishing visually similar roof materials like concrete and asbestos.\n  \n5. **Environmental Factors:**  \n   The study does not account for environmental factors such as weather, lighting variations, or seasonal changes that might influence drone imagery quality, which could impact model robustness in real-world scenarios.\n\n**B. Minor Issues**\n\n1. **Dataset Size and Balance:**  \n   The dataset is relatively small, especially for certain roof types, which could introduce class imbalance issues. Expanding the dataset or using data augmentation could help alleviate this.\n  \n2. **Documentation and Usability:**  \n   While the data and code are made publicly available, clearer documentation on how to use the dataset and reproduce the results would improve accessibility for a broader audience.\n  \n3. **Limited Comparisons:**  \n   The study could benefit from comparing its methods to additional segmentation algorithms or using ensemble techniques for a more comprehensive evaluation.\n\n---\n\n**C. Recommendations**\n\n1. Consider expanding the dataset to include diverse geographic regions and building styles to enhance model generalization and applicability.\n2. Improve documentation and provide detailed guidelines for researchers with limited computational resources to facilitate the use of the dataset and models.\n3. Explore the integration of data augmentation techniques to address class imbalance and improve model robustness."
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper presents the Nacala-Roof-Material dataset, which includes drone imagery from a sub-Saharan African region, designed for building segmentation and roof-type classification. The authors apply a deep ordinal watershed model to accomplish this task, with potential applications in risk assessments for vector-borne diseases."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1.This paper is written in a clear and concise way, making it enjoyable to read and easy to digest. \n2. The topic is interesting and valuable."
            },
            "weaknesses": {
                "value": "1. Dataset. The design of the extend test dataset is inadequate, which does not contain any example of two roof types.\n2. Related works. Missing discussion on relevant methods, such as multi-task/multi-resolution building extraction techniques. \n3. Technical novelty. The approach relies heavily on established methods."
            },
            "questions": {
                "value": "I appreciate the writing style. However, due to the lack of insights and innovation in the method, submission to a remote sensing journal is suggested."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper proposes a dataset to classify and segment roof materials motivated by a correlation of certain roof materials with mosquito risks. It is certainly an interesting dataset and problem. The dataset is certainly impactful, as it has been created with substantial manual effort by local university students and NGO members from Nacala. Also, the distinction between a spatial in-distribution D_text and spatially distinct D_ext, some classes missing in the training sets, is certainly a challenging setup.  \nHowever, I evaluate the impact of this paper for a machine learning conference is limited. In terms of methodology, the paper uses existing (pre-trained) vision models and proposes a watershed postprocessing step, \"DOW,\" inspired by  Cheng et al. (2024). In my opinion, it would fit better to an ICLR workshop (e.g., Machine Learning for Remote Sensing) or in a Remote Sensing Journal/Conference where the impact of the paper could be better evaluated and where it also would have more impact overall."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "It is an interesting problem and a well-curated dataset with several existing baseline models"
            },
            "weaknesses": {
                "value": "* My central concern is the limited relevance of this dataset to a machine learning audience, as it is mainly relevant to remote sensing researchers. I did not see any aspects of this dataset that would open a particular targeted challenge/problem to develop new machine learning models on. It's contribution is rather in the environmental/social impact than building the basis for new model developments. Hence, it would fit a dedicated workshop or a remote sensing journal better where it can be evaluated properly."
            },
            "questions": {
                "value": "The concrete link between mosquitos and roof materials did not become clear to me: Are there some studies relating exactly these two data sources, or is roof material mainly a proxy for wealth and slum mapping? \nConcretely, is the connections with mosquitos merely motivational, or do you have data collected (e.g., through surveys or disease occurrence rates) that supports this connection?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 1
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper presented a root material segmentation and detection dataset based on drone images. Authors also benchmarked YOLOv8, Unet, DINOv2 models on their dataset at both pixel-level and object-level."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. The roof material segmentation and detection dataset is valuable for autormatic house quality estimation.\n2. The paper is writtn well and easy to follow.\n3. The visual foundation model, e.g., DINOv2, is considered into their study."
            },
            "weaknesses": {
                "value": "1. The benchmark is not comprehensive. There are many good object detection, semantic segmentation, and instance segmentation models can be evaluated on this new dataset for more insights.\n2. The analysis is insufficient, e.g., what are the main error sources in this task? how well does the larger vision foundation models (e.g., SAM) do? The authors should give more insights to guide future readers in exploring roof material classification problems.\n3. A comparison between conventional datasets and your dataset should be included."
            },
            "questions": {
                "value": "see Weaknesses"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}