{
    "id": "LikKyNlzgP",
    "title": "Diffusion & Adversarial Schrödinger Bridges via Iterative Proportional Markovian Fitting",
    "abstract": "The Iterative Markovian Fitting (IMF) procedure based on iterative reciprocal and Markovian projections has recently been proposed as a powerful method for solving the Schrödinger Bridge problem. However, it has been observed that for the practical implementation of this procedure, it is crucial to alternate between fitting a forward and backward time diffusion at each iteration. Such implementation is thought to be a practical heuristic, which is required to stabilize training and obtain good results in applications such as unpaired domain translation. In our work, we show that this heuristic closely connects with the pioneer approaches for the Schrödinger Bridge based on the Iterative Proportional Fitting (IPF) procedure. Namely, we find that the practical implementation of IMF is, in fact, a combination of IMF and IPF procedures, and we call this combination the Iterative Proportional Markovian Fitting (IPMF) procedure. We show both theoretically and practically that this combined IPMF procedure can converge under more general settings, thus, showing that the IPMF procedure opens a door towards developing a unified framework for solving Schrödinger Bridge problems.",
    "keywords": [
        "Schrödinger Bridge",
        "Optimal Transport",
        "Entropic Optimal Transport",
        "Unpaired Learning"
    ],
    "primary_area": "generative models",
    "TLDR": "",
    "creation_date": "2024-09-27",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=LikKyNlzgP",
    "pdf_link": "https://openreview.net/pdf?id=LikKyNlzgP",
    "comments": [
        {
            "summary": {
                "value": "In the context of Schrödinger Bridge (SB) problems, the paper analyses theoretically some heuristic algorithms typically used in practice in the literature. Specifically, the authors give a new interpretation to these heuristics, as a combination of well-known procedures used in the context of theoretical analysis of SB problems. The authors name the resulting procedure \"Iterative Proportional Markov Fitting\" (IPMF).\n\nThe main result of the paper is to show the converge of IPMF when both the distributions $p_0$ and $p_1$ are unidimensional gaussians.\nFurthermore, the authors study heuristically the convergence of IPMF in more interesting settings, by performing numerical experiments on some typical datasets and benchmarks."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "- The paper is very well written.\n- The problem in consideration and the background are introduced very clearly, so that the idea of the paper is easy to comprehend. \n- The proof for 1D gaussian, although limited, could lead to generalisations that improve on the results that are available in the literature at the moment."
            },
            "weaknesses": {
                "value": "- Section 4, presenting the experiments, seems to be a bit disconnected from the previous sections. While at the beginning the authors say the aim of the section is to show the convergence of the different procedures in more generic settings, the focus shifts on the comparison between the performance of different procedures. Keeping the focus on the convergence of the procedures to the target could enhance the readability of the section.\n\n[Minor] \nTypos:\n- Line 172: Matkovian\n- Line 374: staring\n- Line 412: Additionaly\n- Line 417: Scrödinger\n- Line 528: Appenix\n\nA careful reading of the paper is suggested to remove additional typos."
            },
            "questions": {
                "value": "- In section 4.3, the results presented in Table 1 are difficult to interpret. What's the role of the \"volatility\" parameter $\\epsilon$ and why it influences so much the performances of the different procedures?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 2
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper targets the solution of the Schrodinger Bridge problem. It first revisits two standard methods to solve the problem: Iterative Markovian Fitting (IMF) and Iterative Proportional Fitting (IPF). Then, the authors identify a connection between both methods and the associated heuristics of their implementation. This leads them to propose the Iterative Proportional Markovian Fitting (IPMF). The authors present a theoretical formulation and analysis of IPMF, to then provide experimental validation over synthetic and real-world image datasets."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "The paper is clear, and in the first pages it adopts a tutorial-like style. The presentation of the relevant background (IPF & IMF) is properly achieved and the proposal is delivered in context. The authors also prove a particular case of their proposal (Thm 3.2).\n\nExperimentally, the paper includes empirical validation on synthetic (Gaussians of different dimensions) and image datasets (Celeba, MNIST). The experiments are complemented by both quantitative and qualitative performance evaluations."
            },
            "weaknesses": {
                "value": "There are some inaccuracies in the text (Appenix, markovian, Matkovian, etc). \n\nPerhaps due to the lack of familiarity of this reviewer with the SOTA on SB: the main contribution of the paper is the identification that IPF & IMF can be understood as the same procedure. However, what are the practical implications of this? Is this a a purely conceptual statement, or does this fact help practical applications of SB? Perhaps the authors can be more specific about the practical advantages of their proposal"
            },
            "questions": {
                "value": "please see above"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "NA"
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper shows that the popular bidirectional IMF algorithm uses IPF implicitly and they provided a theoretical result proving that for 1d Gaussians, this algorithm IMPF can converges."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "This paper is well written and shows a novel interesting results on connecting the IMF and IPF with theoretical results for 1d gaussian cases and empirical results for higher dimensional datasets."
            },
            "weaknesses": {
                "value": "Although this paper shows an interesting theoretical results, it's only for 1d Gaussian cases. I feel like the contribution is relatively weak. If authors can say something more, i.e, for multi-variate Gaussian, this paper will become stronger."
            },
            "questions": {
                "value": "1. What's the technical difficulties for generalizing the proof to multi-variate Gaussians or other situations?\n2. Can you provide more intuition on why IMPF can usually work for any specific starting process?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "In this paper, the authors propose a reinterpretation of the Iterative Markovian Fitting (IMF). Iterative Markovian Fitting was proposed in [1, 2]. This scheme performs Markovian and reciprocal projections in order to find the Entropic Optimal Transport (EOT). A much older scheme to find EOT is Iterative Proportional Fitting (IPF) [3, 4]. The authors propose to reinterpret a popular implementation of IMF with forward/backward projections to link this specific IMF implementation with the IPF algorithm. The procedure is called IPMF (Iterative Proportional Markovian Fitting). They show that the proposed procedure converges for one-dimensional Gaussian targets. They then illustrate experimentally the stability of the forward/backward implementation of IMF, i.e. IPMF, for several starting couplings including some that do not satisfy the requirements of IMF and IPF. The experiments are conducted on high dimensional Gaussian, on Colored MNIST and on CelebA. \n\n[1] Shi et al. – Diffusion Schrödinger Bridge Matching\n\n[2] Peluchetti – Diffusion Bridge Mixture Transports, Schrödinger Bridge Problems and Generative Modeling\n\n[3] Kullback – On information and sufficiency, Annals of Mathematics and Statistics\n\n[4] Sinkhorn – A Relationship Between Arbitrary Positive Matrices and Doubly Stochastic Matrices"
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "* I think the paper is nicely written. There is proper acknowledgement of prior work and the authors have carefully introduced complex notions such as Iterative Proportional Fitting, Iterative Markovian Fitting, Schrodinger Bridges and Entropic Optimal Transport. \n\n* The authors are also discussing an interesting (and often overlooked) point in the implementation of EOT based samplers which is the initial coupling. While I think the current paper still suffers from major issues, there is value in this study as it puts the emphasis on 1) how stable the IMF is with respect to the original coupling 2) the interaction between IMF and IPF"
            },
            "weaknesses": {
                "value": "* I think the paper has limited novelty. Indeed, the link between the IMF procedure and the IPF was already identified in  [1]. In particular, in [1] the following coupling “We now relate Algorithm 1 to the classical IPF and practical algorithms such as DSB (De Bortoli et al., 2021). Instead of initializing DSBM with $\\Pi_{0,T}^0$ given by a coupling between $\\pi_0, \\pi_1$ , if we initialize it by $\\Pi_{0,T}^0 = \\mathbb{Q}_{0,T}$ [...] then DSBM also recovers the IPF iterates used in DSB.” Hence the connection between IMF and IPF through the initial coupling was already acknowledged in [1], see Proposition 10 for an explicit statement. In that regard, the IPMF rewriting is not needed to show that the IMF procedure reverts to the IPF one when the coupling is initialized as the IPF one which is one of the main points of the paper. \n\n* Overall I think the paper has limited impact. If it should be read as a theory paper then the result is quite weak (one dimensional Gaussian random variables) and there is not so much insight that is gained from the proof of the theorem, i.e. it seems extremely unclear that the proof generalizes to other settings and what would be a path to reach such general convergence results. If the paper is to be seen as a methodology paper then I think that there should be a clear motivation to choose couplings that are different from the ones of the IMF (i.e. couplings with correct marginals) or the ones from the IPF (couplings with first right marginal and output of the Brownian motion or related stochastic process). So far, I do not see in the paper a clear use case of such couplings. Hence I find the paper poorly motivated.\n\n* Finally, I find the experiments to be quite poor. The only settings that are run are high dimensional Gaussians, 2d examples and unpaired image translation with colored MNIST and Celeba. I found the quantitative study of the last two experiments to be quite poor. For instance, FID scores are presented in Figure 5 and MSE are presented in Appendix C.2 and in that case it seems that changing the coupling yields worse results regarding the quality of the obtained coupling. I think, the authors should investigate other couplings (I know that the minibatch OT one was investigated in the case of Celeba) in order to show that there is something to be gained from the IPMF perspective."
            },
            "questions": {
                "value": "* Typo in line 59 “Mathcing” should be “Matching”\n\n* Typo in line 374 – “staring” should be “starting”\n\n* In the introduction the authors mention that the reverse Kullback-Leibler between the iterates of the IMF and the target EOT coupling decreases at each step of the IMF. However, I could not find such a result in [1, 2]. To the best of my knowledge, the theoretical study of the IMF is quite limited. \n\n* In Equation (9) and Equation (10) the forward and backward are done successively. Do you think it is possible to learn the backward and forward processes jointly? Is there any work investigating that direction? In that case, it would be interesting to understand the IPMF in that setting.\n\n* It would be good to have some kind of diagram to illustrate the differences between IMF, IPF and IPMF as well as some explicit descriptions on when they are equal. Basically, the choice of the initial coupling matters a lot. If the initial coupling in the IPMF has the right marginals (and is in the reciprocal class) then we recover the IMF. If the initial coupling in the IPMF is Markov in the reciprocal class and has the right initial marginal then we recover the IPF. \n\n* What other starting coupling could be explored? This is related to my comment regarding the lack of applications in the “Weaknesses” section. \n\n* I want to point out that in Section 3.1. The rewriting of the IPMF is only meaningful if we start from a coupling that does not preserve the marginals, otherwise since the Markovian projection preserves the marginal there is no point applying the projection on the last marginal (or the first marginal). I think it is necessary to specify this. \n\n* It would be interesting to investigate what is the effect of approximating the projection in the convergence of the IMF, the IPF and the IPMF, similarly as in [3].\n\n[1] Shi et al. – Diffusion Schrödinger Bridge Matching\n\n[2] Peluchetti – Diffusion Bridge Mixture Transports, Schrödinger Bridge Problems and Generative Modeling\n\n[3] Chen et al. – Provably Convergent Schr ̈odinger Bridge with Applications to Probabilistic\nTime Series Imputation"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}