{
    "id": "niDo8UYcEs",
    "title": "XiEff Representation for Near-Field Optics",
    "abstract": "Near-field optics, or near-field electrodynamics, is a field that studies the interaction between materials and light at spatial scales smaller than the wavelength. At these extremely small scales, below the diffraction limit, the interaction between materials and electromagnetic fields can exhibit unique behaviors and properties not observed in conventional optics. This area of research is crucial for understanding the optical characteristics of nanotechnical systems and nanoscale biological objects. One of the primary tools used in near-field optics research is scanning near-field optical microscopy (SNOM), which allows researchers to measure near-field optical images (NFI). However, these images often lack visual clarity and interpretability, hindering a comprehensive understanding of the properties of the probed particles.\n\nThe main goal of this paper is to introduce a novel approach that addresses these challenges. Inspired by the prominent progress in Neural Radiance Fields (NeRFs) from computer vision and ideas from physics-informed neural networks (PINNs). We propose an unsupervised method that introduces the XiEff representation – a neural field-based reparameterization of the effective susceptibility tensor. By integrating XiEff into the Lippmann-Schwinger integral equation framework for near-field optics we develop an optimization strategy to reconstruct the effective susceptibility distribution directly from NFI data.\n\nThe optimized XiEff representation provides an interpretable and explainable model of the particle's shape. Extensive evaluations on a synthetically generated NFI dataset demonstrate the effectiveness of the method, achieving high intersection-over-union scores between XiEff and ground truth shapes, even for complex geometries. Furthermore, the approach exhibits desirable robustness to measurement noise, a crucial property for practical applications. The XiEff representation, combined with the proposed optimization framework, potentially introduces a valuable tool for enabling explainable near-field optics imaging and enhancing the understanding of particle characteristics through interpretable representations",
    "keywords": [
        "neural fields",
        "PINNs",
        "near-field optics"
    ],
    "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)",
    "TLDR": "We reproduce matter distribution by electric field distortion",
    "creation_date": "2024-09-27",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=niDo8UYcEs",
    "pdf_link": "https://openreview.net/pdf?id=niDo8UYcEs",
    "comments": [
        {
            "summary": {
                "value": "This paper tackles the problem of effective susceptibility distribution reconstruction from near-field imaging data. The idea is to use the physics-informed neural networks (PINN) to solve the Lippman-Schwinger equation given the external field observation from the SNOM probe."
            },
            "soundness": {
                "value": 1
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "In general, the paper is clearly written, though there are some formatting issues (such as the citation format and the section fragments) should be fixed."
            },
            "weaknesses": {
                "value": "The paper, however, can be viewed as an exercise of PINN for the specific near-field imaging tasks without any algorithmic innovations. Note, ICLR typically emphasizes novelty on the algorithmic side. Simply adopting an existing (and well-known) approach to a highly domain-specific problem (like the near-field imaging) would not be recommended for ICLR publication. \nI would suggest the authors further refine their paper, focus on the experiments (the experiments conducted in this paper are too toy to be attractive), and submit it to an optics/photonics journal for next-round evaluation. \nParticularly, a 3-D experimental setup with non-diagonal effective susceptibility would be interesting to be explored, in contrast to the 2D, diagnonal cases tested in the paper."
            },
            "questions": {
                "value": "See above"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper presents a method, termed XiEff Representation, for reconstructing particle shapes from near-field optical images obtained through Scanning Near-Field Optical Microscopy. The approach leverages neural fields inspired by Neural Radiance Fields (NeRF) and Physics-Informed Neural Networks (PINNs) to parameterize the effective susceptibility tensor within the Lippmann-Schwinger equation framework. The authors propose this technique as an interpretable model for particle shape reconstruction, particularly under noisy conditions, using an unsupervised optimization framework."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "This approach adapts NeRF and PINNs, for effective shape reconstruction in nano-optics; and shows robustness in noise on a synthetic dataset with various particle geometries."
            },
            "weaknesses": {
                "value": "While the XiEff representation is positioned as an improvement over traditional methods, the paper lacks a rigorous quantitative comparison with existing approaches for solving inverse problems in nano-optics, such as traditional discretization, iterative, or diagram-based solutions. A discussion on seminal works such as Chen et al. (2020, 2022), which apply PINNs to inverse problems in nano-optics, is also absent."
            },
            "questions": {
                "value": "1. While the proposed XiEff method shows good shape reconstruction, it is not clear how much is improved compared to traditional reconstruction methods. Better to include these in the related work section, as well as add a reconstruction result comparison.\n2. The paper only presents results on synthetic data. How does this technique work on real SNOM data?\n3. Similarly, should also acknowledge and discuss prior works on PINNs in nano-optics/near-field optics to better position itself within the existing literature."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "**Summary**  \nThis submission proposes the use of Physics-Informed Neural Networks (PINNs) for processing data from Scanning Near-Field Optical Microscopy (SNOM). While the motivation is clear, the contribution is poor, with significant literature missing regarding the application of PINNs for inverse problems in nano-optics, as well as specific applications to SNOM data.\n\n**Clarity**  \n- The work would benefit from a dedicated Related Work section, which should discuss prior research on PINNs and their application in nano-optics optimization, as well as relevant papers on near-field optics.\n\n**Significance and Originality**  \n(-) The originality of this paper is limited, especially as it omits relevant literature on its proposed contribution. Notably, the foundational paper by Chen et al. (2020), “Physics-informed neural networks for inverse problems in nano-optics and metamaterials,” is not discussed. Additionally, the paper specifically addressing this problem by Chen et al. (2022), “Physics-informed neural networks for imaging and parameter retrieval of photonic nanostructures from near-field data,” is missing from the discussion. The 2020 paper has 500 citations, while the 2022 paper has 40 citations, making these omissions a critical oversight.\n\n**Results**  \n(-) By 2024, it is insufficient to present PINN-related work at a top conference using only 2D toy results, especially considering the breadth of related research. The authors should either address the failure modes of previous methods or propose a novel methodology with robust validation.\n\n**References:**  \n- Chen, Yuyao, et al. \"Physics-informed neural networks for inverse problems in nano-optics and metamaterials.\" *Optics Express*, 28.8 (2020): 11618-11633.  \n- Chen, Yuyao, and Luca Dal Negro. \"Physics-informed neural networks for imaging and parameter retrieval of photonic nanostructures from near-field data.\" *APL Photonics*, 7.1 (2022)."
            },
            "soundness": {
                "value": 1
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "Introducing \"neural fields + optics\" into ICLR is an interesting endeavor."
            },
            "weaknesses": {
                "value": "stated above."
            },
            "questions": {
                "value": "Stated above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 1
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This article addresses the issue of lacking visual clarity and interpretability in images captured by scanning near-field optical microscopy. Based on the principle of neural radiance fields, the authors propose an effective susceptibility tensor parametrization method grounded in neural fields. This method enhances the interpretability of imaging and the morphological accuracy of micro-objects."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. The article introduces a new representation method called XiEff. This approach is inspired by Neural Radiance Fields (NeRFs) in computer vision and Physics-Informed Neural Networks (PINNs).\n\n2. The authors have integrated the XiEff representation into the Lippmann-Schwinger (LS) integral equation framework used in near-field optics, developing an optimization strategy that can directly reconstruct the effective susceptibility distribution from Near-Field Imaging (NFI) data.\n\n3. An unsupervised optimization framework is proposed that can directly reconstruct the effective susceptibility distribution from NFI data. The authors claim that this method improves the practicality and efficiency of near-field optical analysis."
            },
            "weaknesses": {
                "value": "Weakness：\nI have multiple concerns and questions about this paper, please see the detailed comments and suggestions."
            },
            "questions": {
                "value": "1. The authors did not provide a systematic introduction to the relevant research background of this study, i.e., the most pertinent previous works were not discussed.\n2. Most of the references cited in the paper are relatively old; the authors need to incorporate comparisons with more recent research content.\n3. The \"interpretability\" emphasized in this task requires a clear definition from the authors.\n4. Ground Truth should be separately listed in Figure 4.\n5. The experimental section is rather thin; there are no ablation studies or evaluations of model parameters.\n6. All the data used in the paper are synthetic samples; real-world microscopic data were not utilized.\n7. Whether the paper fits within the scope of ICLR is questionable, as it does not delve deeply into concepts from machine learning or artificial intelligence."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}