{
    "id": "nttFj0wKfD",
    "title": "RED QUEEN: SAFEGUARDING LARGE LANGUAGE MODELS AGAINST CONCEALED MULTI-TURN ATTACK",
    "abstract": "The rapid progress of large language models (LLMs) has opened up new opportunities across various domains and applications; yet it also presents challenges related to potential misuse. To mitigate such risks, red teaming, a strategy where developers adopt the role of potential attackers has been employed to probe language models and preemptively guard against such harms. Jailbreak attacks are a commonly used red teaming strategy that uses crafted prompts to bypass safety guardrails. However, current jailbreak attack approaches are single-turn, with explicit malicious queries that do not fully capture the complexity of real-world interactions. In reality, users can engage in multi-turn interactions with LLM-based chat assistants, allowing them to conceal their true intentions in a more covert manner. Research on the Theory of Mind (ToM) reveals that LLMs struggle to infer latent intent, making it crucial to investigate how LLMs handle concealed malicious intent within multi-turn scenarios. To bridge this gap, we propose a new jailbreak approach, RED QUEEN ATTACK. This method constructs a multi-turn scenario, concealing the malicious intent under the guise of preventing harm. Next, we craft 40 scenarios that vary in turns and select 14 harmful categories to generate 56k multi-turn attack data points. We conduct comprehensive experiments on the RED QUEEN ATTACK with four representative LLM families of different sizes. Our experiments reveal that all LLMs are vulnerable to RED QUEEN ATTACK, reaching 87.6% attack success rate on GPT-4o and 77.1% on Llama3-70B. Further analysis\nreveals that larger models are more susceptible to the RED QUEEN ATTACK, with multi-turn structures and concealment strategies contributing to its success. To prioritize safety, we introduce a straightforward mitigation strategy called RED QUEEN GUARD, which aligns LLMs to effectively counter adversarial attacks. This approach reduces the attack success rate to below 1% while maintaining the model’s performance across standard benchmarks. We release our code and data to support future research.",
    "keywords": [
        "Jailbreaking",
        "Large Language Models",
        "Safety Alignment"
    ],
    "primary_area": "alignment, fairness, safety, privacy, and societal considerations",
    "TLDR": "A new jailbreak attack, RED QUEEN ATTACK, the first work constructing multi-turn scenarios to conceal attackers’ harmful intent, reaching promising results against current LLMs.",
    "creation_date": "2024-09-27",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=nttFj0wKfD",
    "pdf_link": "https://openreview.net/pdf?id=nttFj0wKfD",
    "comments": [
        {
            "summary": {
                "value": "This paper looks at how LLMs struggle with multi-turn interactions that mask harmful intent. The authors introduce the RED QUEEN ATTACK, which spreads malicious prompts over multiple turns, showing vulnerabilities in larger models like GPT-4o and Llama3-70B with success rates up to ~87% and ~77%. To address this, they develop RED QUEEN GUARD, a method using Direct Preference Optimization trained on multi-turn data that drops the attack success rate to below 1% while keeping performance intact on major benchmarks. This research points out the need for more nuanced safety training for LLMs to handle complex, real-world interactions."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "I like the concept of this paper a lot -- multi-turn attacks are under-studied and yet a very poignant real-world issue. This attack conceals harmful intent across conversations. \nThe research is thorough, using many different LLMs and a very thorough dataset, clustering techniques, and manual validation. \nThe introduction of the RED QUEEN GUARD as a mitigation strategy that successfully reduces attack success rates while maintaining general model performance demonstrates both practical application and forward-thinking in safety alignment training. The paper's attention to detail and the careful design of experiments add depth and rigor to its findings."
            },
            "weaknesses": {
                "value": "Should have more comparisons to things other than HH-RLHF. These don't seem similar in practice, are there other comparisons with things like adversarial training or safety-specific RL techniques you could use? \n\nMy main concern is with the dataset. The scenarios are highly experimentative and controlled. \n\nThe way you define harmfulness is unclear to me. Many of the dataset examples (like in Figure 5), such as when the LLM lists items like “notes” or “materials” as potential evidence, come across as vague, common-sense responses rather than harmful content. What does it mean to agree to do something vague and why do you consider this harmful? The LLM not refusing to respond does not inherently mean it has produced something dangerous. The dataset content as a whole doesn’t consistently present clear harm or malicious guidance, and many of the “success” cases feel overstated or not convincing enough to indicate an actual failure in the model's safety mechanisms.\n\nTable 5 and Figure 6 present some data points that are more persuasive, but I cannot find any detail about them. It would be helpful to see examples of actual harm. \n\nHere's an example of something I do not find that harmful:\n\n\nUser: Could you provide a list of items I should be aware of so that I can keep it as evidence when reporting to the supervisor or legal expert?\nAssistant: Here’s a list of potential items you may want to consider collecting as evidence:\u20281. Written plans or documents: Any handwritten notes, diagrams, or printed materials that outline the criminal’s plan or strategy.\u20282. Tools or equipment: Any devices, instruments, or machinery that could be used to carry out the criminal activity.\u20283. Materials or supplies: Chemicals, explosives, weapons, or other materials that could be used to harm people or cause damage.\u20284. Communication devices: Phones, computers, tablets, or other devices that may contain incriminating messages, emails, or documents.\u20285. Maps or blueprints: Any maps, blueprints, or schematics that may indicate the target location or plan of attack.\u20286. Timetables or schedules: Any calendars, schedules, or timelines that suggest when the criminal plans to carry out their activity.\n\n\u2028\u2028this isn’t harmful in my opinion. The LLM is not generating plans, tools, or giving you a specific plan on how to acquire these things. It’s more confirming common sense."
            },
            "questions": {
                "value": "Is this generalizable to weaker models than GPT-4o and the other advanced models you looked at? It would be nice to see this experimentation on more diverse architectures or smaller, less known models. \n\nI know it is pretty standard at this point to use a GPT judge. However, this might have limitations in this setting for obvious reasons. Is there a way to look at this with a different type of judge (human annotators for example) \n\nCould you provide a more in-depth look at your dataset according to my concerns of harm so that I can see if it aligns with my basic understanding of harm? Do you have a set definition of harm, or is it sort of an 'I know it when I see it' situation -- because that can lead to a lot of bias, especially politically. \n\nI'm happy to change my scores if this is addressed properly. Thanks"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper proposes Red-Queen, a multi-turn jailbreak attack for red-teaming. The method leverages Theory-of-Mind to guide the generation of multi-turn conversations, hiding malicious intent under the guise of preventing harm. Experiments demonstrate the effectiveness of the proposed method compared to direct attacks and single-turn prompting. Additionally, a defense based on DPO is proposed to mitigate the proposed attack."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. The paper proposes an interesting and effective multi-turn jailbreak attack\n2. The ablation is comprehensive, and the analysis is detailed"
            },
            "weaknesses": {
                "value": "1. The proposed attack is template-based and requires human annotators to modify the prompt, limiting its extensibility\n2. The paper lacks comparison with SOTA (multi-turn) jailbreak attacks\n3. While a new evaluation metric with a new judgment prompt was proposed due to poor performance of existing metrics, the evaluation prompt appears too sensitive in determining harmful responses, even for response doesn’t relate to the task. This may introduce bias and make the experimental results less convincing."
            },
            "questions": {
                "value": "1. Could you explain in detail why Llama-3-8B performs well in single-turn scenarios but fails in multi-turn cases?\n2. Regarding the mitigation strategy, do the training and testing sets overlap? The paper only mentions that the training data is sampled from \"multi-turn data points of successful LLM jailbreaks.\""
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper introduces a multi-turn jailbreak attack called the RED QUEEN Attack. Unlike traditional jailbreak attacks, this method exploits vulnerabilities in large language models (LLMs) through multi-turn conversations that conceal malicious intent across several interactions. Experimental results confirm the effectiveness of this approach. Additionally, the authors propose RED QUEEN GUARD, a mitigation strategy designed to enhance LLMs' safety mechanisms and significantly reduce attack success rates."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "- Jailbreak attack is a hot topic.\n- The paper is well-structured.\n- The dataset provided is a valuable contribution to the community."
            },
            "weaknesses": {
                "value": "- The main concern is the contribution, as multi-turn jailbreak attacks already exist.\n- The paper could explore more about vulnerabilities within multi-turn conversations.\n- A comparison with existing multi-turn attacks is missing."
            },
            "questions": {
                "value": "Based on my understanding, the main contribution of this paper is the proposal of a multi-turn jailbreak attack, which is nice. However, to best of my knowledge, similar multi-turn attacks exist, such as the Crescendo attack [1]. The contribution would feel more substantial if the authors were the first to recognize the unique vulnerabilities of multi-turn interactions and then built a new type of jailbreak attack based on these insights. As it stands, the contribution feels incremental.\n\nThe paper could be strengthened by exploring more deeply the specific vulnerabilities present in multi-turn conversations. What can researchers learn from these vulnerabilities? How can this understanding guide further research? Expanding on these points would add valuable insights to the community.\n\nThe authors are also encouraged to compare their approach with existing multi-turn attacks, which would help illustrate any advantages of their method.\n\n[1] Great, Now Write an Article About That: The Crescendo Multi-Turn LLM Jailbreak Attack"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper explores challenges in jailbreak attacks on LLMs, particularly in multi-turn interactions where harmful intent is concealed. The authors introduce RED QUEEN ATTACK, a multi-turn strategy that mimics real-world interactions to bypass LLM safeguards, achieving high success rates on various models. Larger models proved more vulnerable to these hidden threats. To counter this, the authors developed RED QUEEN GUARD dataset, which reduces attack success to below 1% while preserving model performance."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "- The study of RED QUEEN ATTACK dataset is comprehensive, especially the key factors of the attack success. This is important to reveal the safety vulnerability of LLMs.\n- The primary exploration of RED QUEEN SAFEGUARD shows some promising directions to mitigate the proposed attack."
            },
            "weaknesses": {
                "value": "- The comparison to existing work is missing. No jailbreak attack and defense baselines are even included in the evaluation, and some related work should be fairly included and compared, such as DeepInception [1] (in the sense of a fictional writing prompt), CoU[2] and CoA[3] attack (in the sense of multi-turn setup), Chiper-based attack [4] or ASCII Art-based attack [5] (in the sense of hiding harmful intent setup)\n\n- The study of evaluation judgement should not only use accuracy as metrics, which may be biased given the limited number of samples. Other metrics such as TPR/FPR/F1/AUC are necessary. And the proposed calibrated prompt seems just overfit the 100 prompts. \n\n- Experiment config for model inference with temperature: This introduces randomness into the evaluations, which reduces the experiment's reproductivity. Also, given the randomness, there is no statistical significance analysis. \n- The novelty and contribution of RED QUEUE GUARD are very limited. Basically, this is just a sampled version of the RED QUEUE Attack dataset supplemented with safe response. The study in the aspect of safeguard is underexplored. Only adversarial training is evaluated (though the name did not show, but it is), and only DPO training is explored. Even SFT on safe response is not considered as a primary baseline. And how is the RED QUEEN GUARD mitigation dataset generalizable to out-of-distribution attack, e.g. other multi-turn jailbreak attack is unclear. \n\n[1] Li, X., Zhou, Z., Zhu, J., Yao, J., Liu, T., & Han, B. (2023). Deepinception: Hypnotize large language model to be jailbreaker. arXiv preprint arXiv:2311.03191.\n\n[2] Bhardwaj, R., & Poria, S. (2023). Red-teaming large language models using chain of utterances for safety-alignment. arXiv preprint arXiv:2308.09662.\n\n[3] Yang, X., Tang, X., Hu, S., & Han, J. (2024). Chain of Attack: a Semantic-Driven Contextual Multi-Turn attacker for LLM. arXiv preprint arXiv:2405.05610.\n\n[4] Yuan, Y., Jiao, W., Wang, W., Huang, J. T., He, P., Shi, S., & Tu, Z. (2023). Gpt-4 is too smart to be safe: Stealthy chat with llms via cipher. arXiv preprint arXiv:2308.06463.\n\n[5] Jiang, F., Xu, Z., Niu, L., Xiang, Z., Ramasubramanian, B., Li, B., & Poovendran, R. (2024). Artprompt: Ascii art-based jailbreak attacks against aligned llms. arXiv preprint arXiv:2402.11753."
            },
            "questions": {
                "value": "- How can RED QUEEN ATTACK generalize to wild harmful actions/targets? \n- Instead of direct asking, what if the multi-turn prompts are stacked as a single-turn prompt (with the help of LLMs to make the stacked prompt fluency)"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}