{
    "id": "nVbbB3Jmyo",
    "title": "Degree-aware Spiking Graph Domain Adaptation for Classification",
    "abstract": "Spiking Graph Networks (SGNs) have garnered significant interest from both researchers and industry due to their ability to address energy consumption challenges in graph classification. However, SGNs are typically inference under the same distribution of training dataset, which is difficult to satisfy in real applications. In this paper, we first propose the domain adaptation problem in SGNs, and introduce the novel framework named \\textbf{De}gree-aware \\textbf{S}piking \\textbf{G}raph \\textbf{D}omain \\textbf{A}daptation for Classification (\\method{}). To address this problem, we propose solutions in terms of three aspects: node distribution-aware personalized spiking representation, graph feature distribution alignment, and pseudo-label distillation. Firstly, we introduce the personalized spiking representation method that varies with node degrees. The difficulty of triggering a spike is determined by the node degree, allowing this personalized approach to capture more expressive information for classification. Then, we propose the graph feature distribution alignment module that is adversarially trained using membrane potential against a domain discriminator, efficiently maintaining high performance and low energy consumption in the case of inconsistent distribution. Additionally, we extract consistent predictions across two spaces to create reliable pseudo-labels, effectively leveraging unlabeled data to enhance graph classification performance. \nExtensive experiments on benchmark datasets validate the superiority of the proposed \\method{} compared with baselines.",
    "keywords": [
        "spiking graph neural network; domain adaptation"
    ],
    "primary_area": "other topics in machine learning (i.e., none of the above)",
    "TLDR": "",
    "creation_date": "2024-09-28",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=nVbbB3Jmyo",
    "pdf_link": "https://openreview.net/pdf?id=nVbbB3Jmyo",
    "comments": [
        {
            "summary": {
                "value": "This paper proposes a framework called DeSGDA to tackle the problem of domain adaptation in spiking graph neural networks. DeSGDA combines three key components: a degree-aware spiking representation that adapts spiking thresholds based on node degree, adversarial distribution alignment to minimize discrepancies between source and target domains, and pseudo-label distillation to improve model performance on unlabeled target data. The authors provide theoretical bounds on the generalization error of their framework and validate its effectiveness through extensive experiments on multiple benchmark datasets, demonstrating DeSGDA’s superiority over other baseline methods in terms of classification accuracy and energy efficiency."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. The DeSGDA framework is a multi-faceted approach that includes personalized spiking representation, adversarial distribution alignment, and pseudo-label distillation.\n2. The authors provide theoretical bounds on the generalization error for spiking graph domain adaptation.\n3. The paper conducts extensive experiments on several benchmark datasets, comparing DeSGDA with a wide range of competitive baselines. This comprehensive evaluation demonstrates the model’s effectiveness and superiority over other methods."
            },
            "weaknesses": {
                "value": "1. This paper studies an A+B problem. The authors bring together two distinct challenges—spiking neural networks and domain adaptation—within the context of graph data. However, the novelty of this problem setup raises questions about the practical relevance and contribution of the paper, as such a scenario may be uncommon in real-world applications.\n2. The authors mention in the Introduction that this problem may exist in Electroencephalography (EEG) data, however, they did not conduct experiments on such data. The datasets used in this paper are mainly protein, molecular, and chemical graphs, can the authors give explanations about what are the applicable scenarios on these data? especially given that, in these domains, accuracy often takes precedence over timeliness.\n3. The adversarial learning on both source and target domains, and the pseudo-labeling strategy on target graphs are very familiar techniques in domain adaptation methods. The contribution is limited. \n4. The methodology assumes that the node degree is a key factor for domain adaptation in spiking graph networks. More explanation on why “setting higher thresholds for high-degree nodes and lower thresholds for low-degree node” should be added.\n5. In some real-world datasets, besides the degree, other structural or feature-based factors might impact the domain shift. Focusing heavily on degree-aware thresholds may overlook other graph properties.\n6. The definition of V_th is not given."
            },
            "questions": {
                "value": "see above."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper proposes the problem of spiking graph domain adaptation and introduce a novel framework DeSGDA. This framework enhances the adaptability and performance of SGNs through three key aspects: node degree-aware personalized spiking representation, adversarial feature distribution alignment, and pseudo-label distillation. DeSGDA enables more expressive information capture through degree-dependent spiking thresholds, aligns feature distributions via adversarial training, and utilizes pseudo-labels to leverage unlabeled data effectively."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. The structure of the paper is clear and easy to follow.\n2. This paper explores the spiking graph domain adaptation problem, which has been neglected in graph domain adaptation.\n3. The paper conducts comprehensive experiments to demonstrate the performance of proposed method."
            },
            "weaknesses": {
                "value": "1. The novelty seems limited. The core idea of DeSGDA is three parts, i.e., node degree-aware personalized spiking representation, adversarial feature distribution alignment, and pseudo-label distillation. However, the second part is domain alignment[1] and the third part is pseudo-labeling[2, 3]. There are both popular ideas in domain adaptation. The technical contribution is a little weak.\n2. The motivation of this paper is not clear. It is recommended that the authors further explain the purpose of using spiking graph neural networks in graph domain adaptation so that readers can understand the contribution of this paper.\n3. The authors provide an energy efficiency analysis, which is commendable. Can the authors further compare the training time and memory of DeSGDA with graph domain adaption methods?\n[1] Unsupervised domain adaptive graph convolutional networks. WWW, 2020.\n[2] Do we really need to access the source data? source hypothesis transfer for unsupervised domain adaptation. ICML, 2020.\n[3] Coco: A coupled contrastive framework for unsupervised domain adaptive graph classification. ICML, 2023."
            },
            "questions": {
                "value": "1. From Tables 1 and 2 in the experimental section, the WL subtree method achieves better performance in many cases than the well-designed graph domain adaptation methods. Can the author explain why?\n2. In Figure 3, the DeSGDA method is not found. Does SGNN in the figure represents DeSGDA?\n3. What is the effect of directly replacing the spiking graph neural networks with commonly used graph neural networks, such as GIN and GCN, combined with adversarial feature distribution alignment and pseudo-label distillation?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper introduces a novel framework named DeSGDA (Degree-aware Spiking Graph Domain Adaptation for Classification) for addressing cross-domain graph classification. DeSGDA tackles the domain adaptation challenge by employing three components: degree-aware personalized spiking representation, adversarial feature distribution alignment, and pseudo-label distillation. Extensive experiments on benchmark datasets demonstrate the superiority of DeSGDA compared to other state-of-the-art methods, highlighting its potential for deployment on low-power devices due to its energy-efficient design."
            },
            "soundness": {
                "value": 1
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. This paper is a pioneer work to address domain adaptation in spiking graph neural networks.\n2. Degree-aware spiking neural networks (SNNs) is an interesting and effective idea, where the spiking threshold is customized based on node degrees. This degree-dependent approach enhances the model's ability to capture informative node representations, significantly improving its performance in varied domain settings.\n3. The authors conduct extensive experiments across various datasets and different domain shift scenarios.\n4. The paper provides the theoretical analysis to present DeSGDA's generalization capabilities for cross-domain graph classification."
            },
            "weaknesses": {
                "value": "1. There shows many inconsistencies in the reported experimental results, which makes me much unconfident about the real performance of proposed method:\n    - In Figure 2, the reported results for the \"PROTEINS\" dataset do not match those presented in Table 1, Table 9, or Table 12. Specifically, in Figure 2, P1-->P0 (GIN) performance is about 0.75~0.76. However, in Table 1, the performance is 84.6; in Table 9, the performance is 78.4; in Table 12, the performance is 84.3. Any of the data in the three tables is inconsistent with the results in Figure 2. There are also some other situations that do not match. This difference raises significant questions about the consistency of experimental results. Further clarification is must to confirm accuracy and reproducibility.\n    - In Figure 3, there is no label corresponding to \"DeSGDA\".\n\n 2. In this paper, the authors first make the assumption that  \"Nodes with higher degrees have more neighbors, and the aggregation operation in Eq. 1 allows for more significant feature accumulation, making it easier for these nodes to trigger spikes compared to those with fewer neighbors. \" This assumption is valid if a direct summation-based neighbor information aggregation is used. However, it remains unclear if this holds for other aggregation methods, such as GAT which is weighted average based on attention score, and GCN which is weighted average based on structural information. Further discussion on this assumption is needed.\n\n3. I really appreciate the degree-aware personalized spiking representation design. However, this paper aims to tackle with the OOD problem. It shows limited technical contribution for graph domain adaptation. The adversarial learning and pseudo-labeling are both well-investigated method in existing DA works.\n\n4. The experiments primarily focus on binary classification tasks using standard graph classification datasets. More complex experiment setting, e.g., multi-class scenarios rather than all binary classification, is welcome to fully assess the model’s capability.\n\n5. The paper does not adequately explain why DeSGDA outperforms general graph domain adaptation methods, like DEAL, CoCo, and A2GNN. An analysis of how DeSGDA specifically enhance performance beyond standard graph DA approaches would better highlight its advantages.\n\n6. Since the degree-aware component design is crucial  to the performance improvements of DeSGDA, it is recommended to provide specific theoretical analysis for this component to strengthen the core contribution. Of course, I understand that this is often not easy, just as a suggestion that the author can consider for future work."
            },
            "questions": {
                "value": "Please address my concerns in the weakness part.\n\nDue to concerns about the inconsistency of the experimental results, I will initially give a neutral score. I will decide whether to raise (or lower) my score based on the author's responses during the discussion phase."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "Spiking Graph Networks (SGNs) help reduce energy use in graph classification but fail with out-of-distribution data. This paper introduces a new framework, DeSGDA, for spiking graph domain adaptation. DeSGDA improves classification by using node degree-aware spiking signals, aligning feature distributions adversarially, and leveraging pseudo-labels from unlabeled data. Experiments show it outperforms other methods."
            },
            "soundness": {
                "value": 4
            },
            "presentation": {
                "value": 4
            },
            "contribution": {
                "value": 4
            },
            "strengths": {
                "value": "Problem Statement: The paper clearly articulates the domain adaptation problem in SGNs, providing a well-defined background, making it easy to understand. \n\nInnovation: The design of effective pseudo-labels tailored to different distributions is a clever approach.\n\nMethodology: The methods employed are appropriate and rigorous, with a well-reasoned experimental design and a transparent data collection and analysis process.\n\nWriting Quality: The writing is fluent, the structure is logical, and it is easy to read and comprehend."
            },
            "weaknesses": {
                "value": "The description in figure 1 is too simplistic."
            },
            "questions": {
                "value": "The paper is well written and I don't have any concerns."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}