{
    "id": "OGfyzExd69",
    "title": "Procedural Synthesis of Synthesizable Molecules",
    "abstract": "Designing synthetically accessible molecules and recommending analogs to unsynthesizable molecules are important problems for accelerating molecular discovery. We reconceptualize both problems using ideas from program synthesis. Drawing inspiration from syntax-guided synthesis approaches, we decouple the syntactic skeleton from the semantics of a synthetic tree to create a bilevel framework for reasoning about the combinatorial space of synthesis pathways. Given a molecule we aim to generate analogs for, we iteratively refine its skeletal characteristics via Markov Chain Monte Carlo simulations over the space of syntactic skeletons. Given a black-box oracle to optimize, we formulate a joint design space over syntactic templates and molecular descriptors and introduce evolutionary algorithms that optimize both syntactic and semantic dimensions synergistically. Our key insight is that once the syntactic skeleton is set, we can amortize over the search complexity of deriving the program's semantics by training policies to fully utilize the fixed horizon Markov Decision Process imposed by the syntactic template. We demonstrate performance advantages of our bilevel framework for synthesizable analog generation and synthesizable molecule design. Notably, our approach offers the user explicit control over the resources required to perform synthesis and biases the design space towards simpler solutions, making it particularly promising for autonomous synthesis platforms.",
    "keywords": [
        "molecular design",
        "synthesis planning",
        "tree generation",
        "graph generation"
    ],
    "primary_area": "neurosymbolic & hybrid AI systems (physics-informed, logic & formal reasoning, etc.)",
    "TLDR": "We tackle synthesizable analog generation and synthesizable molecule design by modeling the design of synthesis pathways as a conditional program synthesis problem.",
    "creation_date": "2024-09-28",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=OGfyzExd69",
    "pdf_link": "https://openreview.net/pdf?id=OGfyzExd69",
    "comments": [
        {
            "summary": {
                "value": "1. This paper addresses the challenge of designing synthesizable molecules and creating analogs for unsynthesizable ones by framing these tasks within a program synthesis framework. The paper introduces a bi-level approach to explore synthesis pathways by separating the structural skeleton of a synthetic pathway from its functional properties. \n2. Through Markov Chain Monte Carlo simulations, they refine molecular structures iteratively and optimize both syntactic and semantic dimensions with evolutionary algorithms."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "1. The problem statement is well-defined, and the methods for synthesizing analogs and generating molecules are clearly explained, including the program's semantics.\n2. The method achieves state-of-the-art performance in molecule generation on benchmark datasets and demonstrates significantly greater efficiency than the SynNet method when tested with various oracles, such as GSK, JNK, and DRD2.\n3. Experimental analysis was conducted using various evaluation metrics, including bioactivity predictors (oracles), structural profiles, multi-property objectives, and docking simulations. The extensive number of experiments, detailed in Appendix G, provides strong evidence that this method outperforms other benchmarking methods.\n4. The figures in the paper effectively clarify the methodology. The t-SNE and MDS plots in Appendix B, based on data from the final hidden layer representation of the MLP, clearly illustrate the most popular skeleton classes.\n5. The model architecture used in the method is thoroughly explained, with detailed insights provided in the attention visualization section in Appendix E."
            },
            "weaknesses": {
                "value": "1. This paper failed to mention the source code / anonymous repository and also in Appendix E . 6 ATTENTION VISUALIZATION figure number is missing.\n2. Results are compared against the 2022 paper; The authors have not compared the results against any recent publications.\n3. This paper doesn't address the computational cost or effectiveness of the algorithms. How long does it take to train the inner loop given ~136k synthetic trees, molecule generation or analog creation?"
            },
            "questions": {
                "value": "1. How robust is bi-level framework to work with other architectures other than TransformerConv, something like Decision Transformer ?\n2. Is there any recent papers like GFlowNet that could be referred other than synthesis-based SynNet published in 2022?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "No ethics review needed."
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper reframes molecule design and synthesizable analog recommendation as conditional program synthesis problems. It introduces a bi-level framework that separates the syntactic skeleton of synthesis pathways from their chemical semantics, allowing efficient exploration of both syntactic and semantic design spaces using evolutionary algorithms and Markov Chain Monte Carlo simulations. By leveraging fixed-horizon Markov decision processes, the approach improves synthesizable molecule generation and offers control over synthesis complexity. Results demonstrate enhanced performance and resource efficiency, positioning this method as a promising tool for automated molecular discovery."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "1. Frames molecular design and synthesizable analog recommendation as conditional program synthesis tasks, offering a fresh perspective in this field.\n2. Demonstrates robust performance across key metrics, underscoring the effectiveness of the proposed methods.\n3. Provides thorough experiments that validate the approach and its contributions to molecular design and synthesis."
            },
            "weaknesses": {
                "value": "1. The current approach uses a limited number of templates, and it is unclear how this framework could be expanded to include a broader range of templates, which could limit its flexibility.\n2. Although the authors claim efficiency, the paper lacks direct comparisons to demonstrate this advantage against other methods.\n3. The comparison between tasks in Section 3.1 could be enhanced with mathematical notation alongside chemistry examples. While the method draws on program synthesis concepts, the explanation may be confusing without using clear chemical illustrations."
            },
            "questions": {
                "value": "The primary concern lies in the method's scalability under the current scheme. It remains unclear how the approach would handle a significantly larger design space with more templates, and how its performance would hold up as template diversity increases."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper presents a method for synthesize of synthesizable molecules. It includes separates the syntactic skeleton (structure) of a molecule from the semantics (functional groups and properties), Markov Chain Monte Carlo (MCMC) Simulations for skeleton refinement, Genetic Algorithms for the optimization of both the structural and chemical aspects of molecules, and Surrogate Modeling with Graph Neural Networks to represent the molecular structure.\n\nThe experiments show that the proposed framework matches and outperforms the current state of the art approaches to synthesizable molecule and synthesizable analog design."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 4
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "- The approach is interesting from the soft-computing point of view. The authors leverage the four different approaches on the right places. The separation between the structure and the content in the synthesis approach is interesting in particular. The use of MCMC and GA is more standard but is well suited for the new candidate tree generation and the search of the best structure and content of candidate molecule."
            },
            "weaknesses": {
                "value": "- I think the possible weakness is the dependency on the tree and the grammar components. On one hand having a very large amount of templates will increase the computational complexity of the model (it is not clear how for instance the MCMC algorithm would handle this) and on the other hand a more efficient smaller set will not allow to generate all desired solutions"
            },
            "questions": {
                "value": "How would the method handle a much larger set of the input alphabet and structural templates?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 8
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "In this paper, the authors address the problems of synthesizable analog generation and synthesizable molecule design, employing syntax-guided synthesis techniques from the field of program synthesis. Specifically, they developed a bi-level framework that decouples the syntactical skeleton of a synthetic tree from the program semantics, and introduced amortized RL algorithms based on the framework. They demonstrated improvements across multiple dimensions of performance for both tasks, and include in-depth visualizations and ablation studies."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "1. The problem of designing useful molecules with desirable properties and good synthesizability is very critical to drug discovery. \n2. The connection between the problem and the program synthesis community is vital. \n3. The method is carefully designed and well executed in experiments."
            },
            "weaknesses": {
                "value": "1. Since this work heavily involves discussion on search space, and amortized search within the synthesis tree, similar things are also explored deeply in the retrosythesis community. Thus, it would be beneficial to incorporate some discussions in the paper to discuss the connections and differences between this work and previous work.\n\n    1. Self-Improved Retrosynthetic Planning, Kim et al., ICML 2021\n    2. Retrosynthetic Planning with Dual Value Networks, Liu et al., ICML 2023\n    3. Retrosynthesis Zero: Self-Improving Global Synthesis Planning Using Reinforcement Learning, Guo et al., JCTC 2024\n\n\n2. The paper is clear and well-written. However, it would be helpful if the introduction includes a reference to the detailed description of the two tasks in the related work section. This will help readers understand the tasks before they delve into the techniques used.\n\n3. Regarding the experimental setup, could you explain the choice of the 91 reaction templates and the 147,505 building block compounds? Are they forward reaction templates? Do these choices reflect real-world applications in molecular design?"
            },
            "questions": {
                "value": "See above"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}