{
    "id": "p1TBYyqy8v",
    "title": "Spreading Out-of-Distribution Detection on Graphs",
    "abstract": "Node-level out-of-distribution (OOD) detection on graphs has received significant attention from the machine learning community. However, previous approaches are evaluated using unrealistic benchmarks that consider only randomly selected OOD nodes, failing to reflect the interactions among nodes. In this paper, we introduce a new challenging task to model the interactions of OOD nodes in a graph, termed spreading OOD detection, where a newly emerged OOD node spreads its property to neighboring nodes. We curate realistic benchmarks by employing the epidemic spreading models that simulate the spreading of OOD nodes on the graph. We also showcase a ``Spreading COVID-19\" dataset to demonstrate the applicability of spreading OOD detection in real-world scenarios. Furthermore, to effectively detect spreading OOD samples under the proposed benchmark setup, we present a new approach called energy distribution-based detector (EDBD), which includes a novel energy-aggregation scheme. EDBD is designed to mitigate undesired mixing of OOD scores between in-distribution (ID) and OOD nodes. Our extensive experimental results demonstrate the superiority of our approach over state-of-the-art methods in both spreading OOD detection and conventional node-level OOD detection tasks across seven benchmark datasets.",
    "keywords": [
        "out-of-distribution detection",
        "graph neural networks",
        "benchmark",
        "healthcare"
    ],
    "primary_area": "learning on graphs and other geometries & topologies",
    "TLDR": "For node-level OOD detection, we present a realistic benchmark setup with a new dataset and propose a novel aggregation scheme.",
    "creation_date": "2024-09-26",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=p1TBYyqy8v",
    "pdf_link": "https://openreview.net/pdf?id=p1TBYyqy8v",
    "comments": [
        {
            "summary": {
                "value": "This research addresses a significant gap in node-level out-of-distribution (OOD) detection by introducing a novel task that considers the interactions among nodes in a graph. Previous methods have relied on unrealistic benchmarks that randomly select OOD nodes, which do not reflect real-world scenarios where OOD properties can spread among neighboring nodes. The key contributions of this paper include:\n1. Introduction of Spreading OOD Detection: This new task models how newly emerged OOD nodes can influence their neighbors, simulating more realistic scenarios of OOD detection.\n2. Realistic Benchmark Creation: The authors develop benchmarks using epidemic spreading models to simulate the dynamics of OOD node interactions within graphs. \n3. “Spreading COVID-19” Dataset: A specific dataset is introduced to illustrate the practical applications of spreading OOD detection, showcasing its relevance to real-world situations.\n4. Energy Distribution-Based Detector (EDBD): The paper presents a new detection approach that employs an energy-aggregation scheme aimed at reducing the overlap in OOD scores between in-distribution (ID) and OOD nodes, enhancing detection accuracy.\n5.Extensive Experimental Validation: Results from comprehensive experiments demonstrate that the proposed EDBD approach outperforms existing state-of-the-art methods in both spreading OOD detection and traditional node-level OOD detection tasks across seven benchmark datasets.\nOverall, this work advances the field of OOD detection by incorporating the complexities of node interactions in graph structures, providing both theoretical and practical contributions."
            },
            "soundness": {
                "value": 4
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "This research addresses a significant gap in node-level out-of-distribution (OOD) detection by introducing a novel task that considers the interactions among nodes in a graph. Previous methods have relied on unrealistic benchmarks that randomly select OOD nodes, which do not reflect real-world scenarios where OOD properties can spread among neighboring nodes. The key contributions of this paper include:\n1. Introduction of Spreading OOD Detection: This new task models how newly emerged OOD nodes can influence their neighbors, simulating more realistic scenarios of OOD detection.\n2. Realistic Benchmark Creation: The authors develop benchmarks using epidemic spreading models to simulate the dynamics of OOD node interactions within graphs. \n3. “Spreading COVID-19” Dataset: A specific dataset is introduced to illustrate the practical applications of spreading OOD detection, showcasing its relevance to real-world situations.\n4. Energy Distribution-Based Detector (EDBD): The paper presents a new detection approach that employs an energy-aggregation scheme aimed at reducing the overlap in OOD scores between in-distribution (ID) and OOD nodes, enhancing detection accuracy.\n5.Extensive Experimental Validation: Results from comprehensive experiments demonstrate that the proposed EDBD approach outperforms existing state-of-the-art methods in both spreading OOD detection and traditional node-level OOD detection tasks across seven benchmark datasets.\nOverall, this work advances the field of OOD detection by incorporating the complexities of node interactions in graph structures, providing both theoretical and practical contributions."
            },
            "weaknesses": {
                "value": "Theoretical Justification for EDBD: While the energy-aggregation scheme is introduced as a key component of the EDBD, the paper would benefit from a more rigorous theoretical foundation explaining why this method effectively mitigates the mixing of OOD scores. Providing mathematical justifications or theoretical comparisons with other aggregation methods could strengthen the credibility of this contribution.\n\nSensitivity Analysis: Conducting a sensitivity analysis on the parameters of the EDBD model could provide valuable insights into how different configurations affect performance. Understanding how the model behaves under various conditions would help in fine-tuning the method for practical applications and could guide users in optimizing the approach for specific contexts."
            },
            "questions": {
                "value": "Theoretical Foundations of EDBD:\nQuestion: What theoretical framework supports the effectiveness of the energy-aggregation scheme in EDBD?\nSuggestion: A more detailed theoretical justification for why this approach mitigates the mixing of OOD scores would strengthen your argument and improve the method's credibility."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 8
            },
            "confidence": {
                "value": 2
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper introduces a more realistic benchmark for node-level out-of-distribution (OOD) detection on graphs, called “spreading OOD detection”, where  OOD characteristics spread across connected nodes, similar to real-world diffusion processes like disease spreading. The paper dedicates one part to defining this benchmark in detail, using the “Spreading COVID-19” dataset to show its practical value. This benchmark is different from traditional approaches that treat OOD nodes as isolated and do not consider interactions. Another part of the paper is focused on a new method, the Energy Distribution-Based Detector (EDBD), designed to address this benchmark. EDBD uses an energy-aggregation scheme to keep OOD and in-distribution (ID) scores from mixing, helping to identify OOD nodes more accurately."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "Although the benchmark is presented as realistic, it relies on assumptions in simulations that may be hard to verify, particularly given the use of the LastFM dataset, which may not accurately represent human contact patterns essential for modeling disease spread. The suitability of LastFM’s social connections as a proxy for physical contact is uncertain, as are other factors like spatial constraints and the presence of high-degree nodes that could act as unrealistic “super-spreaders.” To address this concern and enhance the benchmark’s realism, the authors could validate these assumptions against datasets explicitly designed for human contact networks (such as those used in epidemiology studies) or test the model on multiple datasets with diverse structural properties to better reflect real-world contact interactions.\n\nThe EDBD method’s performance appears closely tied to assumptions within the benchmark setup, making it difficult to assess its independent technical relevance. The method seems to build on GNNSAFE with the addition of energy similarity and consistency matrices, yet these connections and differences are not fully discussed. To clarify the contribution, the authors could provide a more detailed comparison between EDBD and GNNSAFE, explaining how the added matrices influence performance and to what extent the results depend on benchmark-specific assumptions."
            },
            "weaknesses": {
                "value": "Although the benchmark is presented as realistic, it relies on assumptions in simulations that may be hard to verify, particularly given the use of the LastFM dataset, which may not accurately represent human contact patterns essential for modeling disease spread. The literature in this area includes foundational works from over a decade ago, which should be discussed, e.g. [1,2,3].\nThe suitability of LastFM’s social connections as a proxy for physical contact is uncertain, as are other factors like spatial constraints and the presence of high-degree nodes that could act as unrealistic “super-spreaders.” To address this concern and enhance the benchmark’s realism, the authors could validate these assumptions against datasets explicitly designed for human contact networks (such as those used in epidemiology studies) or test the model on multiple datasets with diverse structural properties to better reflect real-world interactions.\n\nThe EDBD method’s performance appears closely tied to assumptions within the benchmark setup, making it difficult to assess its technical relevance. The method seems to build on GNNSAFE with the addition of energy similarity and consistency matrices, yet these connections and differences are not fully discussed. To clarify the contribution, the authors could provide a more detailed comparison between EDBD and GNNSAFE, explaining how the added matrices influence performance and to what extent the results depend on benchmark-specific assumptions.\n\n[1] Mossong, J., Hens, N., Jit, M., Beutels, P., Auranen, K., Mikolajczyk, R., ... & Edmunds, W. J. (2008). Social contacts and mixing patterns relevant to the spread of infectious diseases. PLoS medicine, 5(3), e74.   \n[2] Balcan, D., Colizza, V., Gonçalves, B., Hu, H., Ramasco, J. J., & Vespignani, A. (2009). Multiscale mobility networks and the spatial spreading of infectious diseases. Proceedings of the national academy of sciences, 106(51), 21484-21489.   \n[3] Pastor-Satorras, R., Castellano, C., Van Mieghem, P., & Vespignani, A. (2015). Epidemic processes in complex networks. Reviews of modern physics, 87(3), 925-979."
            },
            "questions": {
                "value": "Q1: Since the dataset is central to the benchmark, it is crucial to understand how well it reflects realistic contact-driven networks for virus spreading. Information on whether the dataset’s assumptions have been validated against more realistic epidemic scenarios would also help clarify its suitability for simulating disease dynamics. Could the authors provide detailed information on the construction and structure of the LastFM dataset, including the main mechanisms of edge formation, the presence of high-degree nodes that could act as super-spreaders, and the dataset’s time span in relation to episode durations required to reach 75% node infection? \n\nQ2: Could the authors discuss the sensitivity of the proposed method to variations in the SIS model parameters and its adaptability to different diffusion patterns? Understanding this sensitivity is important for evaluating the method’s robustness in various scenarios. Additionally, could the authors clarify why OOD detection is not approached as a binary classification between ID and OOD, or as a one-class classification in cases where only ID labels are available? Addressing these points would provide valuable insights into the generalizability of the benchmark and the chosen approach for OOD detection.\n\nQ3: Given the high error bars in Tables 2 and 3, how conclusive are the results? Could the authors explain if the similar performance of EDBD and the Energy method suggests that data features, rather than graph structure, drive the performance? Also, since Eq. 4 of the paper is quite similar to Eq. 7 of GNNSAFE, could the authors clarify the exact differences between EDBD and GNNSAFE beyond adding the energy similarity and consistency matrices? For example, does the first row in Table 4 represent GNNSAFE?\n\nQ4: Since hyperparameter tuning can greatly impact performance, could the authors explain how it was done for both EDBD and baseline methods? Was the search for competitors restricted compared to EDBD? For GNNSAFE, was only the supervised loss used, or did the authors include GNNSAFE++ with energy regularization? If only the supervised loss was used, what motivated this choice?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper introduces \"spreading OOD detection,\" for node-level out-of-distribution (OOD) detection on graphs. It addresses limitations in existing methods by modeling the spread of OOD samples through graph structures. The authors propose a new dataset, \"Spreading COVID-19,\" and present a novel approach called Energy Distribution-Based Detector (EDBD) that outperforms existing methods in both spreading and conventional OOD detection tasks."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "1. The concept of spreading OOD detection is novel and addresses a gap in existing methods.\n2. A new dataset is introduced which will help future research\n3. The figures used in the paper manage to illustrate the problem and approach well."
            },
            "weaknesses": {
                "value": "1. It would be interesting to see comparison of EDBD with SOTA in terms of computational complexity and scalability.\n2. Some discussion on how the proposed dataset compares to real-world datasets and its characteristics would benefit the paper"
            },
            "questions": {
                "value": "1. Are there any specific graph structures or spreading patterns where EDBD might underperform compared to other methods?\n2. How sensitive is the performance of EDBD to the choice of hyperparameters in the energy-aggregation scheme?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 8
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper introduces a novel task called spreading out-of-distribution (OOD) detection, which focuses on identifying OOD nodes within graph structures, particularly emphasizing the interactions and influence these nodes have on their neighbors. The authors leverage epidemic spreading models to create realistic benchmarks that reflect the dynamics of OOD node propagation in real-world scenarios. The authors propose an innovative approach known as the Energy Distribution-Based Detector (EDBD), which utilizes energy scores to enhance the aggregation process of node information. This method aims to mitigate the mixing of OOD scores between in-distribution (ID) and OOD nodes, thereby improving the accuracy of OOD detection."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1.The creation of the Spreading COVID-19 dataset provides a realistic and relevant context for evaluating OOD detection methods. This dataset simulates real-world scenarios, making the findings more applicable to practical situations.\n2. The authors conducted comprehensive experiments, comparing EDBD against several state-of-the-art methods across multiple datasets.\n3. The paper is well-structured and clearly presents the methodology, experimental setup, and results, making it accessible for readers and researchers interested in the topic."
            },
            "weaknesses": {
                "value": "1. While the results demonstrate superior performance, the paper may lack comprehensive statistical analysis (e.g., significance testing) to support the claims of superiority over existing methods.\n2.The energy-based aggregation approach may introduce additional complexity compared to simpler methods. This complexity could make the method less accessible for practitioners who may prefer more straightforward solutions."
            },
            "questions": {
                "value": "1. What is the sensitivity of EDBD to different hyperparameter settings? How do variations in these parameters affect the model's performance?\n2. How does EDBD perform on larger graphs or more complex networks? Are there any scalability issues that arise when applying the method to real-world scenarios with extensive node interactions?\n3. How interpretable are the results produced by EDBD? Can the authors provide insights into why certain nodes are classified as OOD based on the energy aggregation process?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper formulates spreading OOD detection, a new benchmark setup for node-level OOD detection method that incorporates interactions among OOD samples and establishes a new dataset called Spreading COVID-19 to benchmark the spreading OOD detection scenario in real-world data.\n\nA node-level OOD detector called EDBD employs an attentive energy aggregation scheme that prevents the mixing of energies between ID nodes and OOD nodes. EDBD is applied to enhance the OOD detection."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "**S1.**  This paper proposes a new benchmark that models the realistic spread of OOD properties across graph nodes. This setup provides a more applicable framework for real-world scenarios.\n\n**S2.**  This paper leverages EDBD to prevent unwanted mixing of OOD and in-distribution (ID) nodes. By controlling the influence of energy distribution, EDBD achieves better OOD discrimination on proposed datasets and spreading situations.\n\n**S3.**  The paper's aggregation scheme in EDBD is versatile and adaptable to various scenarios on graph-structured data."
            },
            "weaknesses": {
                "value": "**W1.**  The paper’s reliance on COVID-19 to introduce and validate the spreading OOD detection model may feel outdated. As COVID-19 has become less urgent as a topic, using it as the central example could reduce the model's perceived relevance. A more contemporary application, such as misinformation spread or novel pathogens, might enhance the model's applicability and appeal\n\n**W2.** What’s the relationship of this new problem with other problems, e.g., node classification or outlier detection on graphs? I’m not sure what’s the main difference between this problem and the outlier detection problem. The outliers are not seen in the training set? Can these algorithms be used as the baselines? \n\n**W3.** The effectiveness of the EDBD approach heavily depends on the graph structure and quality of connectivity information. In cases where graph structures are incomplete or noisy, the method’s performance may degrade, potentially affecting its robustness in real-world scenarios.\n\n**W4.** While the paper employs SI and SIS models for simulating OOD spreading, it leaves the integration of more complex epidemic models for future work. This limits the current approach's applicability to more intricate real-world spreading phenomena that may not be accurately represented by simple models.\n\n**W5.** Although the \"Spreading COVID-19\" dataset simulates virus spread, the lack of training on actual epidemic or contagion data might reduce the generalizability of the model when faced with real-world data that includes nuanced spreading patterns not captured by synthetic simulations."
            },
            "questions": {
                "value": "**Q1.** How might the proposed spreading OOD detection model adapt to more complex epidemic models, such as SEIR (Susceptible-Exposed-Infectious-Recovered) or multi-host transmission models? Are there specific limitations or computational challenges that prevent their integration?\n\n**Q2.** What steps could be taken to ensure the model’s robustness on graphs with missing or noisy edges and nodes? Would incorporating graph-denoising techniques or imputing missing links improve EDBD’s performance?\n\n**Q3.** Have alternative case studies, such as the spread of misinformation or emergent diseases, been considered to showcase the model’s versatility? How might these cases impact the model's applicability and reception in current contexts?\n\n**Q4.** What’s the relationship of this new problem with other problems, e.g., node classification or outlier detection on graphs?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "NA"
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}