{
    "id": "RavSZTIe2s",
    "title": "Shape as Line Segments: Accurate and Flexible Implicit Surface Representation",
    "abstract": "Distance field-based implicit representations like signed/unsigned distance fields have recently gained prominence in geometry modeling and analysis. However, these distance fields are reliant on the closest distance of points to the surface, introducing inaccuracies when interpolating along cube edges during surface extraction. Additionally, their gradients are ill-defined at certain locations, causing distortions in the extracted surfaces. To address this limitation, we propose Shape as Line Segments (SALS), an accurate and efficient implicit geometry representation based on attributed line segments, which can handle arbitrary structures. Unlike previous approaches, SALS leverages a differentiable Line Segment Field to implicitly capture the spatial relationship between line segments and the surface. Each line segment is associated with two key attributes, intersection flag and ratio, from which we propose edge-based dual contouring to extract a surface. We further implement SALS with a neural network, producing a new neural implicit presentation. Additionally, based on SALS, we design a novel learning-based pipeline for reconstructing surfaces from 3D point clouds. We conduct extensive experiments, showcasing the significant advantages of our methods over state-of-the-art methods. We have included the source code in the Supplemental Material.",
    "keywords": [
        "Implicit representation",
        "3D geometric",
        "surface reconstruction"
    ],
    "primary_area": "learning on graphs and other geometries & topologies",
    "TLDR": "An accurate and efficient implicit geometry representation based on attributed line segments, which can handle both manifold and non-manifold structures.",
    "creation_date": "2024-09-24",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=RavSZTIe2s",
    "pdf_link": "https://openreview.net/pdf?id=RavSZTIe2s",
    "comments": [
        {
            "summary": {
                "value": "The paper presents a learnable surface extraction method based on edge-based dual contouring. Similar to Neural Dual Contouring (NDC), it uses a network to predict an intersection or crossing flag per edge. However, unlike NDC, it optimizes vertex locations within each cell using a Quadratic Error Function (QEF) rather than predicting them directly through the network. This optimization requires both the position of the intersection along each edge and its normal direction. Consequently, in addition to predicting the intersection flag, the network is also trained to output a scalar value representing the intersection position on the edge, using a concatenation of the corresponding cell vertices as input. Instead of the normal direction the paper the gradient of this intersection scalar  which is shown to  align with the the normal direction.\n\nExtensive experiments validate the method’s effectiveness, leveraging the ABC and non-manifold ABC datasets to evaluate implicit representation in addition to DeepFashion3D, Synthetic Rooms, and Waymo datasets to illustrate generalization of  models trained with a subset of Thingi10k."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "- The paper is well-written and easy to follow.\n- The focus on edges (segments) rather than points for predicting intersection positions, combined with the novel approach of linking the gradient with the surface normal, effectively leverages QEF optimization for vertex positioning.\n- **Evaluation and performance:** The evaluations are thorough, showing clear improvements over state-of-the-art methods."
            },
            "weaknesses": {
                "value": "- **Motivation and comparison with Neural Dual Contouring (NDC):** The paper could better clarify its approach relative to NDC, particularly why optimizing vertex locations with QEF outperforms direct network predictions.\n- **Training and inference times:** A table comparing performance, training time, and inference time would provide clarity. The method appears slower in inference than others; for instance, NDC achieves sub-second inference at a 128 resolution. Then, the question is  how good is  the trade-of between performance and inference time of the proposed method ?\n- **Dependence on K-NN size for point cloud surface reconstruction:** The paper lacks details on how the K-NN value is chosen for each dataset and point cloud density, which would help to understand its impact on performance."
            },
            "questions": {
                "value": "- How good is the trade-of between performance and inference time of the proposed method compared to other methods?\n- How the K-NN value is chosen for each dataset and point cloud density, which would help to understand its impact on performance?\n- To solve the QEF optimization, the gradient the network w.r.t e one of the edge vertices should be used. Which one do you use? Also since they have different orientations how does this choice impact the stability of the optimization and the overall performance?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper proposes Shape as Line Segments (SALS), an accurate and efficient implicit geometry representation based on attributed line segments, which can handle arbitrary structures. The authors then design a novel learning-based pipeline for reconstructing surfaces from 3D point clouds. The experiments show the method produces better results than the state-of-the-art methods."
            },
            "soundness": {
                "value": 4
            },
            "presentation": {
                "value": 4
            },
            "contribution": {
                "value": 4
            },
            "strengths": {
                "value": "- The paper's contributions are clearly defined, with comprehensive experimental validation on several benchmark datasets.\n\n- Paper writing is clear and it’s easy to read."
            },
            "weaknesses": {
                "value": "- Some results exhibit only minor differences, as seen in Figure 8, where the outcomes of Ours and GeoUDF appear quite similar. Presenting additional results, such as error maps or normal maps, may provide clearer visual distinctions.\n\n- Lack of analysis of limitations. It would be interesting to evaluate how the proposed method performs on thin structures, such as leaves, or particularly complex geometric structures, like a basket, to better understand its applicability to different types of shapes."
            },
            "questions": {
                "value": "- I suggest add normal maps, which may highlight the differences more clearly in certain results, such as in Fig. 11.\n- Some related works need to be added. [1-3].\n\n- In the network design, I’m interested in exploring the results of replacing max pooling with mean pooling, as it may provide more information of neighbors in feature aggregation.\n\n- Discuss the limitations.\n\n[1] Fast Learning of Neural Implicit Surfaces for Multi-view Reconstruction\n[2] NeUDF: Learning Neural Unsigned Distance Fields with Volume Rendering\n[3] NeAT: Learning neural implicit surfaces with arbitrary topologies from multi-view images"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 8
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper introduces a novel method for sharper surface reconstruction. It proposes to model the implicit surfaces as a field of line segments, in comparison to the previous fields for points."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "- A novel implicit representation of surfaces based on line segments is proposed. \n- For the novel line segments field, surfaces are extracted with edge-based dual contouring.\n- The LSF-method is extend to surface reconstruction from point clouds. \n- Experimental demonstrations are provided for manifold and non-manifold structures."
            },
            "weaknesses": {
                "value": "- Quantitative comparison are only provided for a limited amount of shapes in ABC dataset. \n- The improvement in surface quality appears incremental. The line segment field uses query grids of $128^3$. What is the counterpart resolution of point queries for the compared methods? \n- Given the method’s focus on sharper surface reconstruction, it is recommended that the authors also report metrics evaluated specifically around surface edges, similar to those used in ``Neural Dual Contouring (Chen et al., SIGGRAPH 2022)''."
            },
            "questions": {
                "value": "- For the applications to Waymo data, are the data also rescaled to a unit cube?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper presents a new approach for implicitly encoding 3D surfaces. The idea is to encode how an arbitrary line segment intersects a surface, represented by a binary variable showing intersection or not, and a scalar within [0,1] showing the ratio of the intersection point along the line segment. The motivation for using such a line segment representation is that to extract surfaces from implicit fields, one usually has to find such intersection points for regular grid edges, as done in marching cubes and dual contouring. The paper does analysis of this line segmentation representation, presents a dual contouring adaptation for this representation, develops a learning based network design for generating such a representation, and conducts experiments for shape encoding and shape reconstruction from point clouds, where the method shows improved accuracy than alternative representations like SDF and UDF. \n\nThe idea makes sense intuitively by directly catering for the surface extraction step when learning the implicit rep, and is novel as far as I know. Given the novelty of the approach, some questions can be answered to better understand the approach. See the questions below."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "The idea of representing shapes as intersections with respect to arbitrary edges is pursued and turned into a concrete design, and shows improved accuracy than alternative distance field representations due to its direct compliance with surface extraction algorithms like dual contouring.\n\nThe paper is well written and easy to read overall.\n\nThe paper shows the advantage of the new representation in two different tasks, i.e. shape encoding and shape reconstruction from point clouds. The dataset used is also challenging and diverse, including nonmanifold CAD shapes, scenes and open boundary shapes."
            },
            "weaknesses": {
                "value": "There remain some key technical questions that can be explored for this novel representation.\n\n- How to handle cases where a line segment should intersect the surface multiple times? Such cases should be common when the line segment is larger than the local feature size.\n\n- I am not sure the proof for Theorem 1 is correct. Why are p and n not functions of u/v? What assumptions have to be made about the surface, to ensure this invariance to u/v?\n\n- Eq(2), should there be a square of the dot product? Otherwise the minimization is not bounded from below.\n\n- Sec.3.3, it's said that surface normal is determined as the gradient of s. But the gradient is taken with respect to which variable? u or v? What if they give different gradients?\n\n- Related to the above question, the network producing the line-segment field should have certain invariance and equi-variance. That is, with respect to the switch of u/v, its output o (binary intersection) should be invariant, and its output s (ratio) should be equivariant. But the network design in its current form seems not preserve such properties.\n\nThe results frequently show holes that are undesirable. Such holes would not appear for SDF based methods. What can be done to fix such issues?\n\nThe ablation about normal vectors (Sec.4.3) is quite obscure, with only one visual example and minor differences. Can quantitative differences be observed with or without normal vector for dual contouring?"
            },
            "questions": {
                "value": "See weakness section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}