{
    "id": "RgE1qiO2ek",
    "title": "3DMolFormer: A Dual-channel Framework for Structure-based Drug Discovery",
    "abstract": "Structure-based drug discovery, encompassing the tasks of protein-ligand docking and pocket-aware 3D drug design, represents a core challenge in drug discovery. However, no existing work can deal with both tasks to effectively leverage the duality between them, and current methods for each task are hindered by challenges in modeling 3D information and the limitations of available data. To address these issues, we propose 3DMolFormer, a unified dual-channel transformer-based framework applicable to both docking and 3D drug design tasks, which exploits their duality by utilizing docking functionalities within the drug design process. Specifically, we represent 3D pocket-ligand complexes using parallel sequences of discrete tokens and continuous numbers, and we design a corresponding dual-channel transformer model to handle this format, thereby overcoming the challenges of 3D information modeling. Additionally, we alleviate data limitations through large-scale pre-training on a mixed dataset, followed by supervised and reinforcement learning fine-tuning techniques respectively tailored for the two tasks. Experimental results demonstrate that 3DMolFormer outperforms previous approaches in both protein-ligand docking and pocket-aware 3D drug design, highlighting its promising application in structure-based drug discovery.",
    "keywords": [
        "Structure-based Drug Discovery",
        "Protein-ligand Docking",
        "3D Molecule Generation",
        "Transformer"
    ],
    "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)",
    "TLDR": "",
    "creation_date": "2024-09-26",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=RgE1qiO2ek",
    "pdf_link": "https://openreview.net/pdf?id=RgE1qiO2ek",
    "comments": [
        {
            "summary": {
                "value": "This paper introduces 3DMolFormer, a unified transformer-based framework for SBDD, which is capable of docking prediction and pocket-aware 3D drug design. The motivations of 3DMolFormer are clearly stated: current computational docking methods lack accuracy, while current 3D pocket aware drug design methods are unable to take full advantage of 3D structural information due to factors such as difficulties in 3D information modelling and limited data regarding ground-truth protein-ligand complexes. To represent a 3D complex of a protein pocket and a small molecule ligand, 3DMolFormer uses a parallel sequence composed of the SMILES atom token sequences for the protein and small molecule, along with the numerical sequence for 3D coordinates. A GPT architecture is pretrained through autoregressive generation of the parallel sequence. Fine-tuning consists of: (1) a supervised protein-ligand binding pose prediction task, and (2) a multi-objective RL pocket-aware molecular generation task. The presented results suggest that 3DMolFormer is successful in both fine-tuning tasks; it accurately predicts binding poses of ligands to protein pockets, and is capable of generating molecules that display high binding affinity to protein targets, while being synthesizable and exhibiting drug-like qualities."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "- The proposed GPT framework seems interesting and presents novelty in terms of representing 3D complexes.\n- 3DMolFormer presents strong results compared to other models on both fine-tuning tasks.\n- The presentation of this paper is clear and well-structured."
            },
            "weaknesses": {
                "value": "- The multi-objective optimization of the RL seems to be overly simplistic, including a reward function that assigns a constraint-based reward for QED and SA. Literature on multi-obj DRL shows using more sophisticated reward functions and multi-objective optimization techniques greatly improve agent performance and stability. \n- Minimal ablation studies are conducted, and all results are based on one run. More runs should be conducted to demonstrate the soundness of the model. \n\nMinor edits:\n- Line 482: the parameter σ in Eq. (4) was is to 100"
            },
            "questions": {
                "value": "- The authors state: “... the sampling of ligand SMILES utilizes the weights of the RL agent’s model, which are continuously updated during finetuning. In contrast, the generation of atomic 3D coordinates uses the weights from the model finetuned for docking, which remains unchanged during this process.” Why don’t the authors freeze the GPT weights during the sampling of ligands? If this hinders the model’s performance, why is this not shown in the ablation studies?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 8
            },
            "confidence": {
                "value": 2
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper introduce 3DMolFormer, a dual-channel Transformer-based model that can process atom sequence and coordinate information parallelly, and thus this model is claimed to be the first one that could simultaneously address both protein-ligand docking and pocket-aware 3D drug design, and it outperforms previous baselines in both tasks."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "1. This paper introduce a novel transformer-based model that can handle docking and structure-based drug design simultaneously"
            },
            "weaknesses": {
                "value": "1. This paper mention figure 1 multiple times when introducing model structure, however there is no figure 1 in the preprint."
            },
            "questions": {
                "value": "1. For the pose evaluation, the model only check for RMSD. Could you also report other pose-relate metrics like steric clashes and strain-energy?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper proposes a novel dual-channel transformer-based framework that effectively handles both protein-ligand docking and structure-based drug design (SBDD) tasks."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. Docking and structure-based drug design (SBDD) are indeed dual tasks. The method presented in this paper, which models both tasks simultaneously within a single framework, represents a promising and logical approach.\n2. By leveraging the similar architecture of GPT, the proposed method demonstrates significant scalability, including both model parameters and data volume, allowing for the effective utilization of large-scale datasets for pre-training."
            },
            "weaknesses": {
                "value": "As discussed in Section 5, the proposed method does not consider SE(3) symmetry explicitly but instead relies on data augmentation techniques. I think this aspect warrants further discussion and consideration. Although the experiments validate the method's effectiveness to some extent, I believe the persuasive power of these findings is limited when considering the following points:\n1. For docking task, as far as I know, the more advanced approach Uimol-docking v2 is not included in the baslines.\n2. For sbdd task, I noticed that the article directly employs evaluation metrics (Vina QED SA) as the reward function and utilizes reinforcement learning for fine-tuning. This approach may be considered unfair to other methods.  It may be necessary to incorporate abalation study as well as additional evaluation methods to comprehensively validate the effectiveness of the approach, for example, the delta score proposed in paper [1] may serve as a metric for assessing whether the method is overfitting to the Vina evaluation.\n\n\n[1]. Ren, Minsi, et al. \"Delta Score: Improving the Binding Assessment of Structure-Based Drug Design Methods.\" arXiv preprint arXiv:2311.12035 (2023)."
            },
            "questions": {
                "value": "Refer to the weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "NA."
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper presents 3DMolFormer, a dual-channel transformer framework designed for protein-ligand docking and pocket-aware 3D drug design. It utilizes a parallel sequence format to represent 3D pocket-ligand complexes and employs a \"pre-training + fine-tuning\" approach on a large dataset to model 3D information effectively."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "Unified Framework: 3DMolFormer integrates protein-ligand docking and pocket-aware 3D drug design into a single model.\nParallel Sequence Format: Represents 3D pocket-ligand complexes, facilitating effective modeling of both discrete and continuous information.\nLarge-Scale Pre-training: Utilizes a pre-training.\nEnhanced 3D Information Modeling: Effectively addresses challenges in modeling complex 3D interactions.\nNovel dual generative+docking : Applicable to multiple tasks within structure-based drug discovery with 3D information, improving efficiency in drug design processes."
            },
            "weaknesses": {
                "value": "Docking. The model should be benchmarked against PoseBusters. The state of the art here includes AF3 and Chai-1, which achieve an accuracy of 76–77%. These models are only trained on PDB data. I understand that cofolding is not part of this approach, but we still need to assess the trade-offs on a widely recognized benchmark.\n\nSynthetic Accessibility Score. It's stated that a score above 0.59 is given a value of 1. Why is this the case? Typically, a lower score indicates better synthetic accessibility. Is there a mistake, or are they using a different metric? I noticed that further clarification is provided in the Appendix.\n\nMulti-score Thresholds. The thresholds for multi-score criteria appear to be chosen arbitrarily. For example, a value of 1 is assigned to QED and SA scores that surpass a certain threshold. Could you clarify how these cutoffs were selected?\n\nDocking Formula. They provide a formula for redocking, but typically, a different target would require a distinct reference score, standardized by weight. There doesn’t seem to be a standard docking energy applied here.\n\nMolecule Distribution. The paper does not specify the distribution of generated molecules in terms of size. Is there variation in logP values? How about the number of rotatable bonds?\n\nBenchmarks for 3D Generation. I suggest using established benchmarks, such as CheckPose or DrugPose, for 3D generation."
            },
            "questions": {
                "value": "-Could you clarify how well you perform on PoseBusters?\n-What are speed accuracy trade-offs in comparison to AlphaFold3 or Chai-1?\n-How the thresholds where chosen for the addition. By calculating using the formula. It seems that it was chosen to use QED 4.39?\n-What are the proteins in which you generated the molecules? How did you choose them? Are they diverse?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}