{
    "id": "rySLejeB1k",
    "title": "Emergent Orientation Maps —— Mechanisms, Coding Efficiency and Robustness",
    "abstract": "Extensive experimental studies have established that in less visually advanced animals, the neuronal preference for input orientation in the primary visual cortex (V1) is organized in a disordered fashion (known as salt-and-pepper organizations). In contrast, in visually advanced animals, the orientation preference varies continuously across V1, forming pinwheel-like structures. However, the mechanisms underlying the emergence of these two seemingly distinctive structures are not fully understood, and their differential influences on visual encoding remain largely unexplored. To address these questions, we introduce a self-evolving spiking neural network model with plasticity that can reproduce those emergent structures in several representative animals by incorporating data on retinotopy, neuronal morphology, and connectivity for each species. We show that the salt-and-pepper organizations and pinwheel structures actually sit at the two ends of the same spectrum using a metric that involves the overlap of receptive fields and neuronal density. We also find the same mechanisms account for the formation of both structures through local recurrent connections guided by Hebbian-like learning rules. Next, we show functionally that pinwheel structures exhibit lower wiring costs and higher encoding efficiency than salt-and-pepper organizations. Finally, pinwheel structures exhibit sparse coding and greater robustness against noise in natural stimuli. These functional advantages may inspire the deep learning community to revisit the possibility of recurrent connectivity within each layer for higher coding efficiency and robustness.",
    "keywords": [
        "Vision",
        "Energy Efficient Coding",
        "Neural Network",
        "Sensory Coding",
        "Spiking Mechanism"
    ],
    "primary_area": "applications to neuroscience & cognitive science",
    "TLDR": "",
    "creation_date": "2024-09-27",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=rySLejeB1k",
    "pdf_link": "https://openreview.net/pdf?id=rySLejeB1k",
    "comments": [
        {
            "summary": {
                "value": "The paper investigates how the pattern of orientation map emerges from a recurrent spiking network model with synaptic plasticity, and concludes that the feedforward input overlap is crucial for forming different map patterns, i.e., salt-and-pepper vs. pinwheel structures."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. Biological plausibility of the recurrent spiking network model with plasticity. The model is well supported by neurobiological experiments and is quite similar to the conventional recurrent spiking network used in neuroscience studies."
            },
            "weaknesses": {
                "value": "1. Although the authors claim they provide a spiking network mechanism of orientation map, the spiking dynamics seem unnecessary, because none of the results rely on spike timing information. All learning rules are based on the firing rate of neurons only. This makes the spiking network model look like a \"strawman\" a bit. I envision the spiking network model with spike-time-dependent plasticity rule might have different mechanisms from the rate-based Hebbian rules. Anyhow, I think the author can provide some explanations about how much we could gain about the orientation map formation from the proposed spiking network model. \n\n2. I am still debating about the contribution of this work to ICLR society. That is, how much we could gain from this study to develop the next-generation AI algorithm? Or how the results in the paper can be incorporated into the modern deep learning algorithms? Another thing is although the model is biologically plausible, all learning rules and network model architecture are not new.\n\n3. It is uncommon to see the title of the paper PDF differ from the title shown in the OpenReview. This makes me concerned that the paper might not be well prepared, at least in the submission stage.\n\n### Minor\n1. When comparing output orientation map size among different species, the model should scale with the different neuron density, RF size, and magnification factor (in Table 2) across species. For example, the patch size that each neuron perceives is a constant (16 pixel), while for different species it should be scaled with the following term:\n\n    V1 RF size (deg) * magnification factor (mm/deg) * sqrt(neuron density) (neuron / mm)\n\n(so the outcome is the receptive field size scaled with neuron number)\n\nAlso, the recurrent wiring size scaled with neuron number in Eq. (5), presumably conservative about 100 ~ 200 um across species, should be scaled with sqrt(neuron density) (neuron / mm) in different species."
            },
            "questions": {
                "value": "1. What is the $z_j(t)$ in Eq. 3?\n\n2. Could the authors comment on the differences between the current model with Hansel & Vreeswijk, J. Neurosci., 2012?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "Authors study functional organization of the primary visual cortex across animal species. Depending on the species, primary visual cortex is organized in a continuum going between disordered salt-and-pepper and ordered pinwheel structures. Authors model these functional organizations with an E-I spiking neural network that is equipped with two types of Hebbian-like plasticity rules. An important finding is that  the degree of synaptic organization depends crucially on the overlap of feedforward inputs incoming to the network. They also find that once learned, the pinwheel organisation is stable and promotes efficient processing of visual information."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "Authors presented a rather convincing paper with a clear and timely scope. The paper is technically correct and rigorous in methods. It brings potentially important and new insights into why biological neural networks organise in a continuum of salt-and-pepper and pinwheel structures."
            },
            "weaknesses": {
                "value": "Major weakness of this paper are the presentation, the lack of justification and elaboration on modelling and parameter choices, and insufficient comment on results. While the presentation is rather transparent, the clarity of the text can be substantially improved. Also, the text contains a number of typos.\n\n1) I recommend to omit all abbreviations besides the very common ones, such as  V1, E-I and potentially FF. The acronym of the network, SESNN, is also an exception and is useful to have. All other acronyms seem counterproductive. While authors have compiled a list of acronyms in the Appendix A.7, frequent use of diverse acronyms throughout the text impedes readers that are less familiar with the topic of self-organising maps to appreciate the results.  \n\n2) On many places, the text is rather difficult to follow, with long and unnecessarily complicated sentences. In some cases, sentences are not grammatically correct. See for example line 275, Figure Caption 3a and h, lines 368-371. On page 9, there are references to Figure 6, but likely authors want to refer to their Figure 4. In line 262, authors refer to the third panel of fig 2a, but it might rather be the first panel?\n\n3) It is not clarified enough what is the difference in effects between the Hebbian Oja's and Correlation Measuring type of learning. The only reasoning I gathered is that Hebbian Oja plasticity rule has the desired property of normalization that prevents too strong E-E connectivity.  What is the drawback of using Hebbian Oja's plasticity for E-I and I-I connectivity? Authors should go deeper into explaining this, as it seems to be crucial for the results they obtain.\n\n4) In Eq. 7, authors define the energy cost of synaptic transmission as inversely proportional to the connection strength. While this is an interesting choice, it is not intuitive why a quantity inversely proportional to the connection strength is used as the metabolic cost. Also, it is not well justified why is the information capacity computed as the entropy of the weight distribution. Could authors elaborate on that and provide references if applicable?\n\n5) Unless I misunderstood something, the measure of reliability in Eq. 10 is based on the assumption of single neuron encoding, while ample evidence suggesting that in the brain, units of signal processing and neural populations."
            },
            "questions": {
                "value": "1) Seen that Eq. 4 is the one actually used for modelling, it is not clear what is the purpose of Eq. 3? Also, it is unclear what the variable z in Eq. 3 stands for.\n\n2) Why is the \"neural connectivity parameter\" (max weight) higher for E compared to I neurons? At the same time, authors report that E-I connectivity should be stronger compared to E-E connectivity.\n\n3)  In lines 173-174, authors comment on their choice of hyperparameters and state that \"their approach is consistent with empirical findings\". It remains unclear how specific hyperparameters of their model relate to empirical findings. Could authors be more specific?\n\n4) How is the coefficient in Eq. 8 different from a cross-correlogram measured on neural spike trains (Bair et al., J.Neurosci. 2001)?\n\n5) A recent study showed that efficient encoding of uncorrelated stimulus features with E-I spiking networks does not require E-E connectivity (Koren et al., eLife 2024). However, your study seems to suggest the necessity of E-E connectivity. Could authors comment on this discrepancy?\n\n6) One of the take-home messages of the paper seems to be that the pinwheel structure is more efficient than the salt-and-papper structure. However, salt-and-pepper organization can be observed in biological brains, and it seems unlikely that it would survive evolution if it was entirely inefficient. Moreover, authors show that salt-and-pepper type of organisation arises when the overlap of inputs to E neurons is small. All together, is seems to me that there is no single \"most efficient\" type of structure, but that this depends on model parameters. Could authors comment on that?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "Authors propose a comprehensive model of the primary visual cortex encompassing anatomical factors, such as natural image inputs, precise and realistic representation of neuronal responses, as well as spiking mechanisms in order to understand the emergence of pinwheel structures. They successfully show that the model can reproduce the emergence of different orientation maps in the visual cortex and that it is compatible with the maps of different species as a function of different factors such a neuron density or RF overlap."
            },
            "soundness": {
                "value": 4
            },
            "presentation": {
                "value": 4
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "The paper is clearly written and presents a novel approach to analyzing the emergence of orientation maps in the visual cortex. The proposed model is well-motivated and supported by mathematical formalization. The authors provide a detailed explanation of the model and its components, which enhances the understanding of the proposed method."
            },
            "weaknesses": {
                "value": "Stating in the abstract that the subject in \"largely unexplored\" is a strong claim that needs to be supported by a more extensive literature review. The paper could benefit from a more in-depth discussion of related work to provide context for the proposed approach. Your extensive bibliography provides already a good illustration of the number of works on the subject, and more for instance on the emergence of orientation maps in the visual cortex from haphazard wiring, or from the emergence of both types of maps using pooling mechanisms in a sparse deep predictive coding network, could be useful. More generally, it would be useful to highlight the difference of your work with [Stevens et al., 2013]."
            },
            "questions": {
                "value": "It has been proven multiple times that the anatomy of V1 is efficient for processing visual information. How do you think your model could be used to understand the emergence of orientation maps in the visual cortex? Is the tiling of receptive fields a possible factor ? (see eg https://doi.org/10.1016/j.neuron.2016.07.015 )\n\nThe model uses 1/ static images, 2/ images represented on a Cartesian grid. Extensions using dynamic images or images represented on a polar grid could be interesting. The evaluation of the model is limited to the comparison of the orientation maps with experimental data. A more quantitative evaluation of the model's performance on other tasks could provide a more comprehensive assessment of its capabilities."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}