{
    "id": "T0ebbDO60R",
    "title": "SuperMark: Robust and Training-free Image Watermarking via Diffusion-based Super-Resolution",
    "abstract": "In today's digital landscape, the intermingling of AI-generated and authentic content has heightened the importance of copyright protection and content authentication. Watermarking has emerged as a crucial technology to address these challenges, offering a general approach to safeguard both generated and real content. To be effective, watermarking methods must withstand various distortions and attacks. While current deep watermarking techniques typically employ an encoder–noise layer–decoder architecture and incorporate various distortions to enhance robustness, they often struggle to balance robustness and fidelity, and remain vulnerable to adaptive attacks, despite extensive training. To overcome these limitations, we propose SuperMark, a novel robust and training-free watermarking framework. Our approach draws inspiration from the parallels between watermark embedding/extraction in watermarking models and the denoising/noising processes in diffusion models. Specifically, SuperMark embeds the watermark into initial Gaussian noise using existing techniques and then applies pretrained Super-Resolution (SR) models to denoise the watermarked noise, producing the final watermarked image. For extraction, the process is reversed: the watermarked image is converted back to the initial watermarked noise via DDIM Inversion, from which the embedded watermark is then extracted. This flexible framework supports various noise injection methods and diffusion-based SR models, allowing for enhanced performance customization. The inherent robustness of the DDIM Inversion process against various perturbations enables SuperMark to demonstrate strong resilience to many distortions while maintaining high fidelity. Extensive experiments demonstrate SuperMark's effectiveness, achieving fidelity comparable to existing methods while significantly surpassing most in terms of robustness. Under normal distortions, SuperMark achieves an average watermark extraction bit accuracy of 99.46\\%, and 89.29\\% under adaptive attacks. Furthermore, SuperMark exhibits strong transferability across different datasets, SR models, watermark embedding methods, and resolutions.",
    "keywords": [
        "image watermarking",
        "diffusion models"
    ],
    "primary_area": "alignment, fairness, safety, privacy, and societal considerations",
    "TLDR": "",
    "creation_date": "2024-09-16",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=T0ebbDO60R",
    "pdf_link": "https://openreview.net/pdf?id=T0ebbDO60R",
    "comments": [
        {
            "summary": {
                "value": "A watermarking method is proposed for embedding watermarks in the diffusion generated images post-processing.  The proposed SuperMark embeds the watermark into initial Gaussian noise using existing techniques and then applies pre-trained Super-Resolution (SR) models to denoise the watermarked noise."
            },
            "soundness": {
                "value": 1
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "* The manuscript provides tests with specific \"Adaptive Attacks\".\n* The supplementary material also provide numerous examples of watermarked images."
            },
            "weaknesses": {
                "value": "However, post-processing watermarking methods in general have been studied for long time since 1993 and the author only mentioned one method (Rahman, 2013) from the older times. They should have specified that such watermarking methods are spacial-based and frequency-based methods.\n\nThe claim of the limitation for other methods from the following sentence does not make sense and denotes that the authors do not have an overall understanding of the digital watermarking process.\n\"We reveal that their limitations are mostly stemmed from the disentanglement between robustness and fidelity due to the the encoder–noise layer–decoder architecture\"\nActually, watermarked image quality, robustness, embedded information capacity and watermark security represent all requirements for a watermarking system and by enforcing each of these requirements actually limits the effects of all the others.\n\nThere is no support for the following claim, and the authors should provide theoretical or empirical proofs to support this:\n\"diffusion process holds inherent robustness against different distortions.\"\n\nAlso the authors do not provide enough discussion about their other claim that:\n\"diffusion process holds inherent robustness against different distortions.\"\n\nThe contributions claimed at the end Section 1 Introduction sound very general and do not actually represent major advancements in the areas in the way they are formulated. \n\nWatermark embedding and watermark extraction stages from Sections 3.3 and 3.4 seem rather straightforward and do not bring any novelty. Sentences from Section 3.1 like \"The Gaussian noise added to the conditioned image corresponds to the watermark information, allowing the watermark to be injected seamlessly\" or \"From this reconstructed noise, the watermark can be extracted effectively,\" are very general and meaningless. There is no new insight in the watermarking embedding and detection process.\n\nFor JPEG, additive noise and smoothing the results would have been better presented in some plots where various degrees of distortion caused by the attacks are tested.\n\nThe section about \"Adoption of Tree-Ring’s watermark injection method\" which adopts the method employed in Tree-Ring (Wen et al., 2024) is confusing. The method proposed in the Tree-Ring (Wen et al., 2024) is completely different from the one presented in this manuscript being embedded in the Fourier frequency domain, while this manuscript discusses a spatial embedding watermarking. The description from the Supplementary of Appendix A.1.2 Tree-ring is not that clear either, it mentions \"low-frequency modes\" but the description is very superficial and it is not clear how the frequencies are calculated."
            },
            "questions": {
                "value": "What is meant by \"normal distortions\" at the end of Section 1 Introduction? How much JPEG compression? What level of Gaussian noise?\n\nThe experimental results reported in Tables 1 or 3 are not clear, because they do not report the specific attacks used in the attacks. What does it mean JPEG? How much compression or quality factor was assumed? What level of \"G Noise\" or \"G Blur\"? What kind of \"Crop\" was applied?\n\nIt is claimed that \n\"We adopt an off-the-shelf strategy for watermark embedding, as used in Gaussian Shading (Yang et al., 2024),\" \nand this significantly limits the novelty of the proposed watermarking approach. What is actually the novelty?\nThe application on super-resolution images is not really a major advancement.\n\nWhat is meant by \"Tree-Ring is 0-bit watermark method\"? First of all it is a Fourier domain watermarking method."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper proposed a new pipeline that uses stable diffusion to inject the watermark into the image. The main contribution of this paper is that it claims that it does not need training, and it is robust due to the characteristic of the stable diffusion model. It shows results comparable to those of the SOTA method and can prevent the attack from the VAE or diffusion model."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "The method is innovative compared to the traditional encoder-decoder-based method. It leveraged the existing generative AI model to inject the watermark into the images, which reduced the additional cost of training a new model for the watermark. And it demonstrates reasonable performance."
            },
            "weaknesses": {
                "value": "The model does not compare the computation cost of the stable diffusion model with the existing methods. Stable diffusion is well-known for its intensive computation cost, slow inference speed, and large model size. If the stable diffusion model uses 10 times more MACs (Multiply-Accumulate Operations), FLOPs (Floating Point Operations), and large model size, while it performs similarly to traditional models, it diminishes the contribution of this method a lot. The model of adding a watermark is usually small and fast since it happens on the user's end. Most injections are conducted on mobile devices such as phones and laptops. The stable diffusion model will make it impossible to use in most scenarios. Overall, this is a good paper, but the completeness of the paper is not good enough. A lot of extensions mentioned in the paper could be done. This is more like an exploratory."
            },
            "questions": {
                "value": "1. Please compare the model size and computation cost with other methods for a fair comparison. Please separate the computation of adding and extracting watermarks for each method.\n2. The PSNR and SSIM of this method are relatively low compared to other methods. However, stable diffusion should maintain high fidelity while maintaining a high watermark detection rate. This is why we want to use extra cost for stable diffusion, such as a large model for computing. If you train the diffusion model or fine-tune yourself, especially for the watermark task, stable diffusion should be able to maintain high fidelity.\n3. Why not fine-tune a small diffusion model for injecting the watermark that can be used in mobile devices and another diffusion model for extracting the watermark that can be run on a large server? It makes the paper more complete and shows the superiority of stable diffusion. Since the method uses the most advanced techniques with large computation, it should outperform all the previous methods."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper proposes a new watermarking framework with the consideration of both robustness and fidelity. The propose method includes a watermark embedding stage where the watermark is injected into the latent Gaussian noise and then a denoised procedure is followed to obtain the watermarked image; and a watermark extraction stage which involves a distortion process and a DDIM inversion to reconstruct the \"watermarked noise\", and further extract the watermark information. During these procedures, the models are frozen and no training/update is needed. The authors validate their method on different datasets as well as with different distortions."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "There are several strengths as I can see.\n1) The proposed method does not need to train (even fine-tune) models while it could work relatively well different datasets.\n2) The method sounds simple but it works well. The authors also conduct a comprehensive ablation studies on important hyperparameters.\n3) The writing and presentation are good. It is easy to follow."
            },
            "weaknesses": {
                "value": "There are several weaknesses/limitations of this version.\n1) The experiments results shows that the proposed method is not the best performer in both sides---robustness and fidelity.\n2) Which pretrained VAE is used? It look like the authors do not mentioned it in the main paper."
            },
            "questions": {
                "value": "I have listed my concerns in the \"weaknesses\" section."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper presents SuperMark, a novel watermarking framework designed to address the challenges of robustness and fidelity in watermarking AI-generated and authentic content. It leverages insights from diffusion models to create a training-free approach that embeds watermarks into Gaussian noise and subsequently denoises this noise using pretrained super-resolution (SR) models. SuperMark demonstrates strong resilience to various distortions and adaptive attacks while maintaining high visual fidelity."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. Flexibility and Transferability: SuperMark is adaptable across different datasets, SR models, watermark injection methods, and image resolutions, showcasing its versatility in practical applications.\n\n2. No Fine-tuning Required: The ability to operate without fine-tuning the SR model simplifies the implementation and broadens accessibility for various use cases."
            },
            "weaknesses": {
                "value": "1. **Lack of innovation**: Key components of the proposed method, such as watermark injection techniques and the use of diffusion models, are not original. This limits the overall innovation of the research.\n2. **Insufficient Contributions**: The claim that the study uncovers a critical insight into the encoder-noise layer-decoder architecture and its trade-offs lacks depth. The acknowledged trade-off between robustness and fidelity is already well-established; the authors do not offer a new perspective or solution to address this issue.\n3. **Inadequate Experimental Comparisons**: The comparisons presented in Table 1 are neither significant nor comprehensive. For instance, the average accuracy on Normal Distortions does not show a significant lead over SepMark, and the performance on Adaptive Attacks is not the best. Furthermore, the comparison is unfair as it does not adequately control for visual quality (fidelity) when assessing robustness (accuracy). A more equitable comparison should maintain visual quality at similar levels."
            },
            "questions": {
                "value": "See weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper introduces a post-processing watermarking scheme that leverages a diffusion-based super-resolution model. The author aims to exploit the inherent resilience of stable diffusion to withstand various distortions, resulting in a training-free framework. In this approach, the watermark is embedded within initial Gaussian noise, which is subsequently processed using pretrained super-resolution models to denoise the watermark."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "-\tThe paper clearly points out the parts of the proposed framework that come from other works, and this candor could be a strength of the paper."
            },
            "weaknesses": {
                "value": "- My humble thought on this paper is that the method is very similar to a “super-resolution-variant” of Gaussian Shading [1]. The frameworks of the two are very similar. The only obvious difference is that the DPM-solver part of Gaussian Shading is replaced with the sampler in the super-resolution model in this paper. As for this super-resolution model, its necessity is not seen. Both the image provided by the user and the watermarked images returned to the user are of normal resolution, which means that the so-called super-resolution model can be replaced by another stable-diffusion based model. We believe that both train-free and performance are advantages brought by stable diffusion, not the contribution of this paper.\n- Performance is not good enough since visual quality and decoding accuracy is lower than some previous methods. According to Table 1, the PSNR of the proposed method is lower than CIN [2], MBRS [3] and so on, and the extraction accuracy is lower than StegaStamp [4] in most of the cases.\n- As stated by the author, this paper also adopts the injection strategy of Gaussian Shade. We may raise a concern that, in the injection strategy of Gaussian Shade, there is one step that needs to replicate the watermarking information for many times, which may make the distribution deviate far from the uniform distribution. Therefore, an encryption process needs to be added to preserve a uniform distribution. Then a problem arises. When extracting the watermark, both the image and the key must be provided. Obviously, if there is a malicious attacker, we should assume that the attacker has obtained the same image. At this time, the security of the copyright is entirely entrusted to the key, so how can we ensure the security of the key? The service provider may also use a secure channel to transmit the key to the client at this time. This behavior is more like steganography than watermarking. After all, for watermarking, it is enough to extract the content that matches the identity. For previous methods, even if the attacker obtains the same image (from public channel), it is impossible to extract the content that matches him. But now the security guarantee has been transferred to the key, which needs to be transmitted over a secure channel. In this case, why not use a password, which is more convenient? We suggest the author include a section discussing the trade-offs between their approach and traditional watermarking in terms of security.\n\nRef:\n- [1] Yang, Zijin, et al. \"Gaussian Shading: Provable Performance-Lossless Image Watermarking for Diffusion Models.\" Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 2024.\n- [2] Ma, Rui, et al. \"Towards blind watermarking: Combining invertible and non-invertible mechanisms.\" Proceedings of the 30th ACM International Conference on Multimedia. 2022.\n- [3] Jia, Zhaoyang, Han Fang, and Weiming Zhang. \"Mbrs: Enhancing robustness of dnn-based watermarking by mini-batch of real and simulated jpeg compression.\" Proceedings of the 29th ACM international conference on multimedia. 2021.\n- [4] Tancik, Matthew, Ben Mildenhall, and Ren Ng. \"Stegastamp: Invisible hyperlinks in physical photographs.\" Proceedings of the IEEE/CVF conference on computer vision and pattern recognition. 2020."
            },
            "questions": {
                "value": "See weaknesses."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper proposes a post-processing watermarking scheme based on diffusion-based super resolution model. The author attempts to use the inherent robustness of stable diffusion to various distortions and presents a training-free framework SuperMark. SuperMark embeds the watermark into initial Gaussian noise and then applies pretrained super resolution models to denoise the watermarked noise. Experiments demonstrates its efficacy."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "-\tThe proposed method is training-free and has lower time and computing cost than other watermarking methods."
            },
            "weaknesses": {
                "value": "-\tThis paper uses several overly arbitrary expressions. E.g., in Introduction, “The latter approach is more flexible and general, as it can be applied to both AIGC and real images”. In fact, recent AIGC watermarking research focuses more on in-process watermarking [1][2] because post-processing may be bypassed by malicious users. We believe that SuperMark can be regarded as a new attempt at real-image watermarking, and there is no need to force a connection with AIGC. Moreover, like “diffusion process holds inherent robustness against different distortions” in line 81. We believe that this robustness only applies to stable diffusion, not all diffusion methods. In fact, the experiment in this paper also uses a super resolution method based on stable diffusion.\n-\tThe use of super-resolution in this model is completely unnecessary. Considering the whole process as illustrated in Figure 2, the image in the transmission is still the normal resolution image, not the higher/lower resolution image. In conclusion, we believe that the proposed method is just trying to introduce the diffusion process into the framework, and it does not matter for which task this model is designed. It seriously weakens the contribution of the paper since the performance is mostly brought by diffusion itself, but not any novel design from the proposed method.\n-\tPerformance was just mentioned above, and in fact the performance of this paper is not very good. Both visual quality and decoding accuracy cannot achieve the best (as shown in Table 1). \n-\tThe paper also contains some parts that are not nice or clear enough. For example, the double-headed arrow between the two \"m\" in Figure 1 does not make it clear what it means. We assume that this means that the original information and the extracted information need to be as similar as possible, so why is there no double-headed arrow between the original image and the embedded image? In addition, Figure 2 also lacks the necessary legend, which affects the readability of the paper.\n\n[1] Wen, Yuxin, et al. \"Tree-rings watermarks: Invisible fingerprints for diffusion images.\" Advances in Neural Information Processing Systems 36 (2024).\n\n[2] Fernandez, Pierre, et al. \"The stable signature: Rooting watermarks in latent diffusion models.\" Proceedings of the IEEE/CVF International Conference on Computer Vision. 2023."
            },
            "questions": {
                "value": "NA"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper proposes a novel robust and training-free watermarking framework, named SuperMark. It embeds the watermark into initial Gaussian noise using existing techniques and then applies pretrained Super-Resolution (SR) models to denoise the watermarked noise, producing the watermarked image. Experiments demonstrate SuperMark's effectiveness."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "The watermarking framework is training-free. \nAn end-to-end pipeline can facilitate the training. \nExperiments show its advantages."
            },
            "weaknesses": {
                "value": "The paper is written and organized poorly. The abstract is too lengthy, and not concise. The paper has limited novelties and only ensembles existing techniques. Neither a novel algorithm nor a newly constructed module are presented. It is not clear how to seamlessly integrate with various watermark injection methods and pre-trained diffusion-based SR models. The layout is not well, for example, the text font size in all equations looks smaller than that of the variable of the main text. Also, there is no theoretical contribution throughout the paper. The difference from Gaussian shading is missing, which is an important reference in the field."
            },
            "questions": {
                "value": "Only a combination of existing techniques can be seen in the paper.\n\nDiffusion can generate directly large-resolution images, so why need an SR module?\n\nSR may impair the extraction of watermarks."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper introduces SuperMark, a robust and training-free framework for watermarking AI-generated content to protect copyright and authenticate content. SuperMark leverages parallels between watermark embedding/extraction and the denoising processes in diffusion models, embedding watermarks into Gaussian noise and using SR models to recover them. Unlike traditional methods that struggle with robustness and fidelity, SuperMark demonstrates strong resilience against distortions, adaptive attacks, and maintains high fidelity through DDIM Inversion techniques. It achieves high watermark extraction accuracy (over 89%) across different conditions, surpassing many existing methods. Additionally, SuperMark shows strong adaptability across various datasets, SR models, and watermark settings."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "- The paper presents a novel discovery regarding the diffusion process, highlighting its intrinsic robustness against normal distortions and adaptive attacks, which makes this finding particularly interesting.\n- The diffusion process does not require training.\n- The pipeline depicted in Figure 2 is clearly illustrated and facilitates easy comprehension."
            },
            "weaknesses": {
                "value": "- The experimental results do not SOTA performance, particularly in terms of PSNR and SSIM metrics. For instance, in Table 1, the PSNR value is only 32.5, which is considerably low, severely affecting image fidelity. This suggests that the trade-off between fidelity and robustness in your method does not yield a compelling outcome. Furthermore, the PSNR values reported in Table 2 remain significantly below current SOTA.\n\n- The novelty of the work appears insufficient, as the methods employed seem to rely primarily on off-the-shelf algorithms. The primary contribution appears to be the strategic integration of these existing techniques.\n\n- The paper lacks an analysis of efficiency. Although the diffusion process is advantageous as a training-free approach to counter the two types of attacks you mentioned, it appears to have drawbacks related to inference efficiency. The inference time seems potentially much lower compared to conventional encoder-noise-decoder frameworks.\n\n- Additionally, the paper does not include experiments against some SOTA attack methods. For example, it is missing an evaluation using attacks[r1].\n\n[r1] Evading Watermark Based Detection of AI-generated Content (CCS 2023).\n\n- There is also an insufficient ablation study. I am particularly curious about the impact on SuperMark if the SR model is removed from the process."
            },
            "questions": {
                "value": "1. The PSNR value in Table 1 is only 32.5, which severely impacts image fidelity. How do you explain the lack of a compelling trade-off between fidelity and robustness in your method?\n\n2. Compared to the current SOTA, the reported PSNR and SSIM values are significantly lower across multiple experiments. What do you identify as the primary performance bottleneck?\n\n3. There is no analysis of inference efficiency in your work. How does the inference time of the diffusion process compare to conventional encoder-noise-decoder frameworks."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}