{
    "id": "u14Y236LwX",
    "title": "OpenWaves: A Large-Scale Anatomically Realistic Ultrasound-CT Dataset for Benchmarking Neural Wave Equation Solvers",
    "abstract": "Accurate and efficient simulation of wave equations is crucial in computational physics, especially for wave imaging applications like ultrasound computed tomography (USCT), which reconstructs tissue properties from scattered waves. Traditional numerical solvers for wave equations are computationally intensive and often unstable, limiting their practical applications for quasi-real-time imaging. Neural operators offer an innovative approach by accelerating PDE solving using neural networks; however, their effectiveness in realistic imaging is constrained by existing datasets that oversimplify real-world complexity. In this paper, we present OpenWaves, a large-scale wave equation dataset designed to bridge the gap between theoretical equations and practical imaging applications. OpenWaves provides over 16 million frequency-domain wave simulations using real USCT configurations, featuring anatomically realistic human breast phantoms across four categories. It enables comprehensive benchmarking of popular neural operators for both forward simulation and inverse imaging tasks, allowing analysis of their performance, scalability, and generalization capabilities. By offering a realistic and extensive dataset, OpenWaves not only serves as a platform for developing innovative neural PDE solvers but also facilitates their deployment in real-world medical imaging problems.",
    "keywords": [
        "Computational imaging",
        "Inverse problem",
        "Neural operators",
        "Ultrasound Computed Tomography",
        "Full Waveform Inversion"
    ],
    "primary_area": "datasets and benchmarks",
    "TLDR": "",
    "creation_date": "2024-09-26",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=u14Y236LwX",
    "pdf_link": "https://openreview.net/pdf?id=u14Y236LwX",
    "comments": [
        {
            "summary": {
                "value": "This paper introduces a large-scale dataset named OpenWaves, which provides over 16 million frequency-domain wave simulations based on real ultrasound-CT configurations. The dataset is specifically designed to include anatomically realistic human breast phantoms."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "1. Benchmarking wave simulation and imaging for neural operators represents a significant contribution to the field.\n\n2. The dataset is extensive, with over 16 million simulations, covering a variety of anatomically realistic human breast phantoms."
            },
            "weaknesses": {
                "value": "1. The mathematical formulation in Section 3.1 requires improvement. Beyond simply explaining variable meanings, the authors should define variables in greater detail, including their range and space. For instance, the symbol $\\nabla$ in Eq. 1 is not clearly defined, and the partial derivatives in Eq. 2 are also ambiguous.\n\n2. Although Section 4.3.2 discusses the scaling property, the dataset's efficiency remains somewhat unclear. For example, as noted by the authors, the performance of different neural operators varies with dataset size, yet the underlying rationale and its implications for designing the proposed dataset require clarification."
            },
            "questions": {
                "value": "1. Do the authors plan to open-source the curated dataset?\n\n2. Have the authors considered comparing the simulated dataset to a smaller real-world dataset to assess the alignment of data distributions with real-world conditions?\n\n3. Could the authors improve the spacing of references?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper presents a new dataset for ultrasound computed tomography (USCT) that: 1) establishes a connection between a theoretical wave equation and a practical medical imaging application; 2) simulates data based on the Helmholtz equation; and 3) conducts large-scale benchmarking of neural operator and end-to-end baselines."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 4
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "The paper provides a comprehensive evaluation of the simulated data, including experiments on various organs of interest, different imaging models, and various baselines. In addition, the presentation of the paper is clear and easy to follow."
            },
            "weaknesses": {
                "value": "1) My primary concern pertains to the dataset generation. Despite a thorough review of the introduction and background, I find it unclear why generating this new dataset is particularly challenging. From my understanding, this dataset is generated purely through simulation. As long as one implements the wave equation according to the theoretical framework and generates the digital phantom via simulation tool, reproducing this dataset seems straightforward. From this perspective, the main contribution of this dataset appears to be its potential to save researchers time in regenerating these terabyte-scale data. Could the authors clarify this point?\n\n2) Furthermore, the differences between this dataset and existing datasets are not sufficiently discussed. While the manuscript notes that other datasets employ different imaging models, it would strengthen the work if the authors also discussed additional differences, such as scale, imaging applications, or computational complexity. Comments on the applicability of these datasets in comparison to the proposed dataset would also be beneficial.\n\n3) Since this paper focuses on medical applications of USCT, a purely simulated dataset (both the ground truth and measurements) may be seen as less important, particularly given that medical professionals often prioritize real data. I could not locate the evaluation criteria specifically for the dataset and benchmark track for ICLR. I am concerned whether such a purely simulated dataset meets ICLR's requirements."
            },
            "questions": {
                "value": "1) Could the authors provide insights into the time complexity involved in generating the entire proposed dataset?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The work introduced the dataset OpenWaves, which provides 16M frequency-domain wave simulations on breast phantom. The dataset can help to evaluate the forward simulation and tomography inversion in ultrasound tomography."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "1. The authors have conducted 16 million simulations across a substantial number of breast phantoms, requiring significant computational and storage resources. If proven to be high-fidelity, this dataset could save future researchers considerable time and effort in data preparation.\n\n2. The authors provide a thorough comparison of different models in both forward simulation and backward reconstruction, offering a relatively comprehensive evaluation."
            },
            "weaknesses": {
                "value": "1. Lack of original contribution: This work does not appear to introduce any novel methods in dataset construction for ultrasound tomography. Creating such a dataset fundamentally depends on two aspects: the simulation algorithm and the generation or collection of breast phantoms. However, in this study, both are adopted from existing resources—the VICTRE project for phantom generation and the Convergent Born Series (CBS) algorithm for wave field simulation. Consequently, this dataset could theoretically be reproduced by others with sufficient computational resources, given VICTRE and CBS, without any unique contribution from the authors.\n\n2. Insufficient discussion on parameter selection and real-world distribution: VICTRE requires a range of carefully chosen parameters to generate realistic breast phantoms, such as surface shape, internal compartmentalization, etc. However, this work does not discuss how parameters in OpenWave were selected or how their distributions might mirror real-world variability. Understanding these choices is essential for evaluating the fidelity of the benchmark and whether it can accurately assess the performance of different frameworks.\n\n3. Lack of quality control measures: Although VICTRE enables simulation of breast phantoms, these simulations inherently lack the complexities of real-world samples. The authors do not address how they ensured the quality or realism of the generated phantoms. For instance, was there any subsampling or external validation from clinical experts to assess the fidelity of these simulations? Such quality assessment is crucial for establishing the dataset as a reliable benchmark.\n\n4. Lack of support of breast type: What is the rationale behind the distribution of four breast types?1000:3000:2000:2000. Can authors provide the literature that supports the figure?"
            },
            "questions": {
                "value": "1. The current citation format is structured as though it serves as the subject of a sentence. To improve clarity and consistency, the authors should either use \\citep or add parentheses to the current citations.\n\n2. The authors frequently reference the 16M frequency-domain wave simulations to emphasize the dataset's large scale. However, this may be misleading. If my understanding is correct, each breast phantom has 256 sources, and during reconstruction, data from all sources would typically be required. I suggest that the authors represent the dataset size as either 8000 or 8000x8, which would provide a more accurate and meaningful metric for researchers."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper titled: OpenWaves: A Large-Scale Anatomically Realistic Ultrasound-CT Dataset for Benchmarking Neural Wave Equation Solvers presents an large-scale *simulated* dataset for USCT, including the breast image and the simulated wave imaging (from USCT). The dataset simulated 4 different breast regions, and their corresponding wave imaging. The authors thoroughly evaluated a few PDE solver for both the forward approximation and inverse problem."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. I believe this large scale USCT dataset is valuable in terms of USCT breast related inverse problem, as it provided realistic tissue simulation. \n2. I appreciate the authors for the evaluations on multiple algorithms."
            },
            "weaknesses": {
                "value": "1. From a contribution point of view, this paper is a dataset paper, however, the dataset is purely simulated and all the justifications are not convincing enough to me that this will bring important values. \na. It is perfectly fine that the paper is simulated, then the point becomes proposing a realistic USCT data generation pipeline. however, this really requires the validation from real clinical data (instead of only simulated data), and also examples with pathologies. \nb. how to proof that your phantom simulation is accurate and more close to the real-breast distribution.\n\n2. Another apparent comparison I would do is (a. training with old datasets, model 1) versus (b. trianing with new datasets, model 2), this also needs real clinical data for justification. And also ablation stuides on how the dataset makes a different, it makes very little sense to train on this distribution and evaluate on the same distribution."
            },
            "questions": {
                "value": "1. Based on the creation of this dataset, do you have any insights of how to design a better PDE solver specifically for this USCT application."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 4
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}