{
    "id": "uKZdlihDDn",
    "title": "Learning Distributions of Complex Fluid Simulations with Diffusion Graph Networks",
    "abstract": "Physical systems with complex unsteady dynamics, such as fluid flows, are often poorly represented by a single mean solution. For many practical applications, it is crucial to access the full distribution of possible states, from which relevant statistics (e.g., RMS and two-point correlations) can be derived. Here, we propose a graph-based latent diffusion model that enables direct sampling of states from their equilibrium distribution, given a mesh discretization of the system and its physical parameters. This allows for the efficient computation of flow statistics without running long and expensive numerical simulations. The graph-based structure enables operations on unstructured meshes, which is critical for representing complex geometries with spatially localized high gradients, while latent-space diffusion modeling with a multi-scale GNN allows for efficient learning and inference of entire distributions of solutions. A key finding of our work is that the proposed networks can accurately learn full distributions even when trained on incomplete data from relatively short simulations. We apply this method to a range of fluid dynamics tasks, such as predicting pressure distributions on 3D wing models in turbulent flow, demonstrating both accuracy and computational efficiency in challenging scenarios. The ability to directly sample accurate solutions, and capturing their diversity from short ground-truth simulations, is highly promising for complex scientific modeling tasks.",
    "keywords": [
        "Graph Neural Networks",
        "Diffusion Models",
        "Physics Simulations"
    ],
    "primary_area": "applications to physical sciences (physics, chemistry, biology, etc.)",
    "TLDR": "We propose an efficient graph-based latent diffusion model, which allows us to directly sample unsteady flow states from their equilibrium distribution given a mesh discretisation of the system and its physical parameters.",
    "creation_date": "2024-09-24",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=uKZdlihDDn",
    "pdf_link": "https://openreview.net/pdf?id=uKZdlihDDn",
    "comments": [
        {
            "summary": {
                "value": "For many fluid dynamics problems, the exact trajectory dynamics are not relevant; instead, domain scientists are more concerned with quantities of interest that arise from steady state distributions. The paper proposes a multi-scale GNN architecture contextualized within the DDPM framework. Similar to prior and current state-of-the-art diffusion models, the work uses a latent representation, instead of performing diffusion over the original data space. In order to differentiate between both contributions, experiments are performed on both DGNs (Diffusion Graph Networks) and LDGNs (Latent Diffusion Graph Networks).\n\nExperiments are performed on 3 experimental settings: 1) pressure on the wall of an ellipse in 2D laminar flow 2) velocity and pressure around the ellipse 3) pressure on a 3D wing. The baselines include a Bayesian GNN, a Gaussian mixture model, a Gaussian regression model, and a VAE."
            },
            "soundness": {
                "value": 4
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "- The studied problem is of particular interest to the broader physics-inspired ML community and domain scientists. \n- Both DGN and LDGN clearly outperform the tested baselines, and show promising results.\n- The mathematical and architectural details are well-written.\n- To my knowledge, this is one of the first works using diffusion models + GNNs in the space of ML4PDEs."
            },
            "weaknesses": {
                "value": "- The compared baselines are not widely used or state-of-the-art methods. At the same time, the three datasets, while representative or real-world tasks, are newly generated. This makes the results within the paper hard to contextualize within the broader literature.\n- The related works section on DDPMs for graph structure needs to further differentiate the proposed method from existing works."
            },
            "questions": {
                "value": "- How does the proposed method differentiate itself from [1] (cited in the related works) which also uses a UNet style GNN? Similarly, how is the proposed GNN different / improved upon from [2]?\n- Are performance improvements over the baselines a result of the diffusion model formulation or the GNN design? Have the authors considered using a latent DiT or different sampling approach (e.g., DDIM)?\n\n[1] Haomin Wen, Youfang Lin, Yutong Xia, Huaiyu Wan, Qingsong Wen, Roger Zimmermann, & Yuxuan Liang. (2024). DiffSTG: Probabilistic Spatio-Temporal Graph Forecasting with Denoising Diffusion Models.\n\n[2] Lino, M., Fotiadis, S., Bharath, A., & Cantwell, C. (2022). Multi-scale rotation-equivariant graph neural networks for unsteady Eulerian fluid dynamics. Physics of Fluids, 34(8), 087110."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper presents two graph-based diffusion models for generating equilibrium states of fluid dynamics systems: one employing diffusion in physical space and another in the latent space generated by graph encoders. The presentation is clear and the methodological choices appear well-reasoned, particularly the use of multi-scale GNN as an encoder to support the latent diffusion model. The approach shows promise for generalization to broader applications where steady state prediction is needed.\n\nWhile technically sound, the primary limitation lies in the methodology's originality. The work largely assembles existing methods rather than introducing novel techniques, though this integration is done throughoutly.\n\nI assumed two important references should also be included and addressed to help with the literature review of this paper.\n\n1. \"Direct Prediction of Steady-State Flow Fields in Meshed Domain with Graph Networks\" should be included as a baseline:\n    - it directly addresses steady-state flow prediction using GNNs. This leads me to question when we should prefer deterministic versus generative approaches.\n    - I can see their generative method working well when \"steady states\" show variations (like the periodic wakes in von Kármán vortices), but for cases with strictly stationary steady states - like this paper's ellipse and airfoil examples - wouldn't a deterministic approach make more sense?\n    - I'd strongly encourage the authors to include this baseline and run comparative experiments and discuss these trade-offs based on results\n\n2. \"Efficient Learning of Mesh-Based Physical Simulation with Bi-Stride Multi-Scale Graph Neural Network,\" which shares similar ideas about multi-scale GNN architecture and more importantly an automatic graph hierarchy construction.\n    - Frankly, compared to a refered paper in the current manuscript: (Fortunato 2022) which requires manual drawing of coarsen layer, this paper's automatic graph hierarchy construction is closer pipeline-wise. Hence I think it should be acknowledged in the related work, and the related method paragraphs.\n    - While I don't think they need to conduct ablation studies here, as it's not the main focus, mentioning it would strengthen their literature review.\n\nI recommend a borderline accept for this paper now. I would consider improving my score if the authors address these missing references, and if they add the suggested baseline and the comparative analysis between deterministic and generative approaches, and thoroughly discuss when each method works best."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "- Clear writing\n- The components of the whole pipeline proposed are rather reasonable\n- The experiment details, the network input/output structure, and the architectures are clear and hence the reproductbility should be easy"
            },
            "weaknesses": {
                "value": "- A bit lack of innovation of the components of the whole method"
            },
            "questions": {
                "value": "- NA"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "NA"
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper uses Denoising Diffusion to sample states from the equilibrium distribution of fluid flow tasks. Instead of operating on a 2D grid, it employs a graph-based approach combined with a multi-scale Graph Neural Network (GNN) to process information. Using only short target trajectories, the model can learn the full distribution of solutions. Additionally, by combining the diffusion approach with a variational graph auto-encoder, a latent version that operates on a reduced latent graph with fewer nodes can, in certain scenarios, improve results."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 4
            },
            "contribution": {
                "value": 4
            },
            "strengths": {
                "value": "- Novelty and Innovation: The paper presents a novel and compelling approach by combining multi-scale Graph Neural Networks (GNNs), Denoising Diffusion Probabilistic Models (DDPM), and Variational Graph Auto-Encoders (VGAEs), pushing the boundaries in fluid flow modeling.\n\n- Clear and Well-Structured Presentation: The authors provide a thorough and well-organized presentation, clearly explaining the approach and the motivation behind it, making it evident why this method is both practical and impactful.\n\n- Relevant and Thoughtful Application: The paper demonstrates a meaningful application of the algorithm, showcasing how the method can effectively address specific challenges in fluid flow tasks.\n\n- Strong Results and Evaluation: The results are impressive, backed by a robust evaluation that validates the approach's effectiveness and potential advantages over existing methods."
            },
            "weaknesses": {
                "value": "- Lack of Code Submission: The absence of a code submission limits the reproducibility and accessibility of the results for further research and practical implementation.\n\n- Minor Formatting Issues: Acronyms are not consistently introduced upon first appearance, which could impact readability. For instance, \"DDPM\" is used without prior definition (e.g., on line 76).\n\n- Missing Citation: The original GAN paper by Goodfellow (2014) is not cited (e.g., on line 74)."
            },
            "questions": {
                "value": "- Do you plan to release the code in the future, or are there specific reasons it hasn’t been shared yet? If not, could you provide further details on any proprietary components or dependencies that may impact reproducibility? In the paper, the authors only mentioned the release of the  datasets."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 8
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper aims to predict possible steady states of complex unsteady dynamical systems given their mesh discretization and physical parameters. With a novel graph-based (latent) diffusion model to predict equilibrium states of dynamical systems, the proposed model can handle unstructured mesh."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "- Integrating GNN with a diffusion model is an interesting idea, as it allows for better generality and great flexibility in unstructured mesh.\n- The paper claims to predict a full distribution of possible equilibrium states, although trained on states of a short trajectory."
            },
            "weaknesses": {
                "value": "Some critical information is missing. \n- The underlying physics problem needs to be explained more. I would expect some rigorous mathematical definitions such as PDEs to formulate the problem.  \n- The related work should cover more classical approaches to the problem of predicting equilibrium states of dynamical systems. \n- The learning problem should also be better formulated."
            },
            "questions": {
                "value": "- What is a statistical equilibrium?\n- What is the generality of the model? Does it generalize to different trajectories, different physical parameters, or even different domain shapes or sizes?\n- Generally, how complex a dynamical system is the model able to handle? Some dynamical systems such as the Lorenz system are chaotic, so are they still predictable with the proposed model?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 2
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper proposes using graph-based diffusion methods to sample steady states in fluid dynamics problems.  Impressively, the training does not need simulations run all the way to convergence.  Behind the scenes, the proposed model uses a multiscale graph network, downsampled using strategies that are typical in numerical PDE."
            },
            "soundness": {
                "value": 4
            },
            "presentation": {
                "value": 4
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "The results in this paper are impressive, and the algorithm makes sense.  I am particularly glad to see relatively realistic test cases as well as reasonable engineering justification for the design behind the proposed architecture.\n\nAlso, thank you for preparing a polished, easy-to-read paper submission.  Relative to the other ICLR papers I had to read, this one had a thoughtful and clear discussion."
            },
            "weaknesses": {
                "value": "From an algorithmic perspective, the building blocks of the proposed method are unsurprising and reflective of larger trends in the fields (graph networks with a multiscale aspect, diffusion sampling, and so on).  So, I would not consider this work to be too exciting from a methodological perspective, although perhaps a reader with more experience specifically in numerical fluid dynamics would better be able to evaluate this aspect.  I am willing to overlook this, however, as the method seems solidly engineered (why invent a new approach to ML just to claim novelty?) and the results look great."
            },
            "questions": {
                "value": "Line 107, “defined their discretization mesh” (typo?)\n\nCan the authors provide intuition on why the problem described on line 142 is well posed?  In particular, if the learning method exclusively sees short trajectories that end before reaching equilibrium, why should this information be sufficient to train a method that directly predicts converged states it hasn’t seen in the training data?  The results seem to indicate this is possible, but it seems counterintuitive to me that this task is reasonable.\n\nLine 169, “interpolates between the bounds of the process’ entropy” --- I wasn’t sure what this means.  Also, (Ho et al., 2020) isn’t written for graph-based models --- does this make a difference?\n\nThe receptive field of a “vanilla” DGN (line 180) is relatively small --- typically a vertex only “talks to” its k-ring, where k is the number of layers.  Does this affect performance of the proposed model, even after incorporating the latent diffusion method?\n\nLine 207:  What does “perceptually equivariant” mean?  How do you verify?\n\nLine 249:  no need for a hyphen in “bottleneck”\n\nLine 384:  Do statistical limitations get in the way of estimating W_2^graph accurately?  It seems like this would be a high-dimensional optimal transport problem, which itself can be difficult to estimate reliably from samples.  How many samples are used here?\n\nLine 451:  If I understand properly, the “3x faster” claim here would be substantially dampened if you had to include training time of the diffusion model.  Is this right?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "details_of_ethics_concerns": {
                "value": "N/A"
            },
            "rating": {
                "value": 8
            },
            "confidence": {
                "value": 2
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}