{
    "id": "WeJEidTzff",
    "title": "A Large-scale Dataset and Benchmark for Commuting Origin-Destination Flow Generation",
    "abstract": "Commuting Origin-Destination~(OD) flows are critical inputs for urban planning and transportation, providing crucial information about the population residing in one region and working in another within an interested area. Due to the high cost of data collection, researchers have developed physical and computational models to generate commuting OD flows using readily available urban attributes, such as sociodemographics and points of interest, for cities lacking historical OD flows \\textemdash commuting OD flow generation. Existing works developed models based on different techniques and achieved improvement on different datasets with different evaluation metrics, which hinderes establishing a unified standard for comparing model performance. To bridge this gap, we introduce a large-scale dataset containing commuting OD flows for 3,333 areas including a wide range of urban environments around the United States. Based on that, we benchmark widely used models for commuting OD flow generation. We surprisingly find that the network-based generative models achieve the optimal performance in terms of both precision and generalization ability, which may inspire new research directions of graph generative modeling in this field. The dataset and benchmark are available at https://anonymous.4open.science/r/CommutingODGen-Dataset-0D4C/.",
    "keywords": [
        "Commuting",
        "origin-destination flow dataset",
        "urban computing",
        "weighted graph modeling"
    ],
    "primary_area": "datasets and benchmarks",
    "TLDR": "This paper provides a large-scale dataset including commuting origin-destination matrices of over 3000 areas in the United States for training and benchmarking origin-destination flow modeling methods.",
    "creation_date": "2024-09-26",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=WeJEidTzff",
    "pdf_link": "https://openreview.net/pdf?id=WeJEidTzff",
    "comments": [
        {
            "comment": {
                "value": "Sorry for the misunderstanding. I have changed the review to the right one. And I have increased my score since you addressed my concerns of anonymity."
            }
        },
        {
            "comment": {
                "value": "Thank you for your timely comment. We will upload new review as soon as possible"
            }
        },
        {},
        {
            "comment": {
                "value": "Thank you for appreciating our work and for your careful reading of the GitHub link. We apologize for the oversight in not anonymizing this link.\n\nAfter double checking the ICLR's double-blind submission policy, we have confirmed that although the link indeed leads to a page that is not completely anonymized; however, we can confirm that the contents of the link, which are consistent with the anonymized repository, in fact, did not reveal our identity. Therefore, the information on said page does not violate the guidelines about the double-blind rule, which state: \"*Submissions will be double blind: reviewers cannot see author names when conducting reviews, and authors cannot see reviewer names. Having papers on arxiv is allowed per the dual submission policy outlined below.*\". As such, we believe that our submission still has the right to receive a review.\n\nTherefore, if after reviewing the policy, you have no further concerns regarding the anonymization, then we would still like to request your full review."
            }
        },
        {
            "summary": {
                "value": "This paper introduces a large-scale dataset called LargeCommuingOD for commuting Origin-Destination (OD) flow generation and provides a benchmark for evaluating models in this domain. The key contributions are:\n\n1. Construction of a comprehensive dataset covering 3,333 diverse areas across the United States, including metropolitan areas, towns, and rural regions. The dataset spans 9,372,610 km² and contains commuting OD flows, sociodemographic data, and point-of-interest distributions for each area.\n\n2. Development of a benchmark framework to evaluate and compare different commuting OD flow generation models, addressing the lack of standardized evaluation in existing research.\n\n3. Benchmarking of 9 existing models, including physical models, classical machine learning approaches, and graph neural network models, using the new dataset.\n\n4. Introduction of a preliminary adaptation of graph diffusion models called WEDAN (Weighted Edges Diffusion condition on Attributed Nodes) for commuting OD flow generation.\n\n5. Analysis of model performance in terms of precision and generalizability across different urban environments.\n\nThe paper demonstrates that network-based generative models, particularly those leveraging graph diffusion techniques, achieve the best performance in both precision and generalization ability. This finding suggests new research directions in graph generative modeling for commuting OD flow generation.\n\nThe authors argue that their dataset and benchmark provide a valuable resource for researchers in urban planning, transportation, and related fields, enabling more comprehensive evaluation and development of commuting OD flow generation models."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "Originality:\n1. The creation of a large-scale, comprehensive dataset (LargeCommuingOD) for commuting Origin-Destination (OD) flow generation covering 3,333 diverse areas across the United States is highly original. This dataset significantly expands on previous efforts in terms of scale and diversity.\n\n2. The paper introduces a novel adaptation of graph diffusion models called WEDAN (Weighted Edges Diffusion condition on Attributed Nodes) for commuting OD flow generation, exploring a new paradigm in this field.\n\nQuality:\n1. The dataset construction process is rigorous, combining multiple reliable data sources including the U.S. Census Bureau, American Community Survey, and OpenStreetMap.\n\n2. The analysis is thorough, examining both precision and generalizability of the models across different urban environments.\n\nClarity:\n1. The paper is well-structured, clearly defining the problem, describing the dataset, and presenting the benchmark results.\n\n2. Figures and tables effectively illustrate the dataset characteristics and model comparisons."
            },
            "weaknesses": {
                "value": "1. **Limited Exploration of Model Interpretability**: The paper emphasizes model performance but lacks a thorough examination of model interpretability, particularly for the network-based generative models that achieve the best results. Understanding the reasons behind their success could offer valuable insights for urban planners and policymakers.\n\n2. **Insufficient Exploration of Edge Cases**: The paper would benefit from a more in-depth analysis of how the models perform in extreme or atypical urban environments within the dataset. This could reveal potential limitations or areas for improvement.\n\n3. **Lack of Discussion on Model Fairness and Bias**: Given the diverse nature of the dataset, an analysis of potential biases in the models' predictions across different urban environments (e.g., rural vs. urban, high-income vs. low-income areas) would be beneficial.\n\n4. **Basic Benchmark Methods**: Many of the selected benchmark methods are too basic. The paper should include more advanced models based on transformers and diffusion, such as those discussed in [this paper](https://arxiv.org/abs/2411.04453) and [this one](https://arxiv.org/abs/2402.15398).\n\n5. **Questionable Significance of Claims**: Are the claims regarding the significance of the research truly justified? Without this dataset, researchers in the field might only need about a week to conduct their own benchmarks. Additionally, there are already open-source frameworks, like LibCity, that have collected these benchmarks (see [LibCity](https://github.com/LibCity/Bigscity-LibCity))."
            },
            "questions": {
                "value": "What do the authors see as the most promising directions for future research based on their findings? Are there specific areas where they believe the dataset and benchmark could be most impactful?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "Commuting OD flows are critical inputs for urban planning and transportation, while the high data collection cost results in a lack of high-quality datasets. This paper introduces a large-scale dataset containing commuting OD flows for 3,333 areas including a wide range of urban environments around the United States. Based on this dataset, authors further benchmark widely used models for commuting OD flow generation. They find that, owing to the rich information contained in the constructed OD dataset, a generative method that considers each OD matrix collected from a county/city as a network and learns to generate it given conditional information can significantly outperform other methods. This may point to a new direction in this domain, which relies on collection of high-quality OD datasets."
            },
            "soundness": {
                "value": 4
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "+ Commuting OD data is valuable in building smart cities, while the data is generally lacked in many areas around the world. The synthetic data generation technique is a promising solution for this problem, requiring high-quality and high-volume data for training ML models. This paper makes a good contribution towards this objective.\n+ According to Table 1, the constructed dataset is more useful than existing ones, in terms of size and richness. The data analysis is sufficient, as in Figure 2-4.\n+ The benchmark is designed in a reasonable manner. It covers a wide range of mainstreaming approaches in this field, and evaluate the model performance in a comprehensive way, including both flow generation accuracy and property distribution similarity.\n+ The observation based on benchmark results is insightful. Based on the constructed large-scale OD dataset that is unseen in previous works, authors demonstrate the powerfulness of graph generative modeling in terms of generating OD flows for diverse cities. This may point to a new direction in this domain."
            },
            "weaknesses": {
                "value": "+ The presented results are informative, but the explanations are rather insufficient. For example, Figures 6 and 7 should be explained in detail.\n+ Although authors discuss the limitations of the constructed dataset, the spatial scale (limited to the United States) and temporal scale (one year) can degrade its usefulness in applications."
            },
            "questions": {
                "value": "+ Can authors demonstrate that models developed based on this US dataset can manage to transfer to other countries?\n+ In Figure 1, why Commuting Flows are processed to generate Regional Socio-demographics?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 8
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper constructs a large-scale dataset (LargeCommuingOD) containing commuting OD flows for 3,333 diverse areas around the United States covering 9,372,610 km2 including a wide range of urban environments. Based on the LargeCommuingOD, the authors benchmark the existing widely used models for commuting ODflow generation. These efforts make up for the lack of comprehensive dataset and the absence of unified and systematic evaluation. Furthermore, this paper find out that network-based modeling for commuting OD flow supported by their dataset gives a promising performance. Thus, training on a large number of commuting OD networks can help the generative models to capture universal as well as distinct mobility patterns at city level, and therefore enhance the generalization ability."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "S1. This paper constructs dataset covers 3,333 areas around the United States, providing a much broader spatial scale comparing to existed datasets.\nS2. The dataset constructed in this paper covers metropolitan areas, towns, and rual areas, which is more comprehensive then existing datasets the focuses on usually a single type of urban environment.\nS3. Based on the LargeCommuingOD, the authors benchmark the existing widely used models for commuting ODflow generation, which makes up for the absence of unified and systematic evaluation."
            },
            "weaknesses": {
                "value": "W1. Please clarify whether WEDAN is a newly proposed model, or the idea of it has already been proposed somewhere else.\nW2. In Sec. 2.2, the link of the released dataset is given in plaintext, which may violate the anonymous policy."
            },
            "questions": {
                "value": "Please refer to Weakness."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper introduces a large-scale dataset, LargeCommutingOD, which captures commuting origin-destination (OD) flows for 3,333 diverse regions across the United States, spanning 9,372,610 square kilometers and encompassing a variety of urban environments. Compared to existing datasets, LargeCommutingOD offers broader and more comprehensive coverage and is made publicly available. The authors benchmark several baseline models using a standardized evaluation protocol, uncovering that network-based generative models could be a promising avenue for future research in this domain."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "1. The authors present a large-scale and comprehensive dataset, LargeCommutingOD, which includes commuting OD flows for 3,333 regions, covering 9,372,610 square kilometers across diverse urban environments in the United States. This dataset provides more extensive coverage than existing resources and is openly accessible, promoting transparency and reproducibility.\n2. By comparing LargeCommutingOD to previous datasets, the authors demonstrate that it captures a broader range of urban characteristics and types, further supporting its utility for various research purposes.\n3. The authors implement and evaluate several baseline models to demonstrate the feasibility and relevance of their dataset. Notably, they identify that network-based generative models show considerable potential, which opens avenues for further investigation.\n4. Upon reviewing the proposed code, I observed that the authors have implemented a comprehensive set of baselines, which could even serve as a robust library for OD flow generation. I hope the authors can commit to releasing this code if the paper is accpeted."
            },
            "weaknesses": {
                "value": "1. Given the dataset's coverage of 9,372,610 square kilometers and its focus on approximately 3,000 regions, the OD metrics may primarily reflect macro-level commuting patterns rather than fine-grained dynamics within individual cities. This limitation may restrict the dataset's applicability for studies requiring detailed intra-city analyses.\n2. The OD matrix, denoted as $\\mathbf{F} \\in \\mathbb{R}^{N \\times N}$ where $N$ exceeds 3,000, may be sparse. Providing a visual representation, such as a heatmap of the OD matrix, would clarify its density and structure, which could help readers better understand the data distribution.\n3. The authors included a non-anonymized GitHub link (https://github.com/tsinghuafib-lab/CommutingODGen-Dataset) in the submission, potentially compromising anonymity. And the authors have specified that only their names need to be anonymized."
            },
            "questions": {
                "value": "Please explain the questions."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 8
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}