{
    "id": "xQAhUIuAc6",
    "title": "Axis-level Reflectional Symmetry Detection with Group-Equivariant Representation",
    "abstract": "Reflectional symmetry detection remains a challenging task in machine perception, particularly in complex real-world scenarios involving noise, occlusions, and distortions. We introduce a novel equivariant approach to axis-level reflectional symmetry detection that effectively leverages dihedral group-equivariant representation to detect symmetry axes as line segments. We propose orientational anchor expansion for fine-grained rotation-equivariant analysis of diverse symmetry patterns across multiple orientations. Additionally, we develop reflectional matching with multi-scale kernels to extract effective cues of reflectional correlations, allowing for robust symmetry detection across different receptive fields. Our approach unifies axis-level detection with reflectional matching while preserving dihedral group equivariance throughout the process. Extensive experiments demonstrate the efficacy of our method while providing more accurate axis-level predictions than existing pixel-level methods in challenging scenarios.",
    "keywords": [
        "Symmetry detection",
        "Equivariant learning",
        "Group equivariance"
    ],
    "primary_area": "applications to computer vision, audio, language, and other modalities",
    "TLDR": "",
    "creation_date": "2024-09-23",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=xQAhUIuAc6",
    "pdf_link": "https://openreview.net/pdf?id=xQAhUIuAc6",
    "comments": [
        {
            "summary": {
                "value": "This paper presents a reflection symmetry detection system with matched, multiscale kernels rotationally equivariant network.  The work uses equivalent networks to allow symmetries to be detected at rotations.   The authors also use a fiber based approach to directly find the symmetry rather than first predicting a heatmap for the symmetry."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "The paper is using rotational equivariant networks to improve symmetry detection.  It’s an interesting approach (though needs to be sufficiently distinguished from others in the field). \n\nThis paper is clearly written and I can follow the logic on what they are trying to do.\n\nI appreciate the approach with fibers and it seems interesting to not use a dense approach.    I like the difference in the approach and would like to see more of that with different backbones since I think it would work even better."
            },
            "weaknesses": {
                "value": "Major:\nFor group representation and a longer background of symmetry detection and needs to be cited here is Computational symmetry in computer vision and computer graphics by Yanxi Liu et al.  2010\n\nThe evaluation only compares against a recent method and doesn’t go back to any of the previous methods (check out Funk et al 2017 for a list of methods where most are freely available online).  They are used in the papers the authors compared with: Seo, Ahyun, Woohyeon Shim, and Minsu Cho. \"Learning to discover reflection symmetry via polar matching convolution.\" Proceedings of the IEEE/CVF international conference on computer vision. 2021.  In addition, why have you deviated from the standard precision recall with F1 marked curve like the previously mentioned papers?  That is really useful to understand how your metric compares to others.  \n\nThis paper (which cited thoughout the paper), also uses equivariant networks for both rotation and reflection symmetry detection.   Seo 2021 and 2022 both use equivariant kernels with Seo 2022 uses rotation group equivalents.  The main difference between the group equivalence of the other papers, at least that I understand, is that the group d8 is used rather than a special Euclidean symmetry group out of the 17.  I'm only referring to the difference in the equivariant and not other differences in the approach.  \n\n\nMissing citations\nGens, R. and Domingos, P. Deep Symmetry Networks. NeurIPs, 2014.  proposed equivariant convolutional arch that needs to be cited and compared with.  \nRotationally-invariant CCNs - Dieleman, Sander, Kyle W. Willett, and Joni Dambre. \"Rotation-invariant convolutional neural networks for galaxy morphology prediction.\" Monthly notices of the royal astronomical society 450, no. 2 (2015): 1441-1459.\n\nAuthors should mention that this is equivariant NN for just 2D data or other papers such as “Equivariant Multi-View Networks. Carlos Esteves et al.  ICCV 2019” should be cited.  \n\nA figure to help understand Sections 3 and 4 would be helpful for understanding what you are getting at here visually.  There is a lot of text and equations and I think a figure to get at the expansion of fibers and how the author sare using symmetry groups would be a big help.\n\n\nMinor:\nFirst paragraph needs citations.  You can’t just state facts in a paper without a citation on symmetry being a fundamental concept.  You can go back to Gestalt theory or how symmetry detection is prevalent in the animal kingdom but cite it.  \n\nIn Figure 1, (a) (b)... needs to be labeled in the image.  This is hard to follow"
            },
            "questions": {
                "value": "The authors are basing this on Cohen et al.’s work for equivariant cnns and I’m not sure how is this different?  Those filters are already rotational equivariant based on the symmetry groups they represent.  \n\n“Lenc & Vedaldi (2015) show that the AlexNet CNN (Krizhevsky et al., 2012) trained on imagenet spontaneously learns representations that are equivariant to flips, scaling and rotation.” from Group Equivariant Convolutional Network.  Why would this approach be necessary for rotational symmetry invariance for reflection symmetry detection?\n\nHow large is the kernel size?  If using too small a size, how can it be 8-fold symmetric?\n\nHow well does this objective function work on non-changed neural networks?  What about modern networks like Convnext?\n\nLine 236: why D8 and not some other amount of rotations?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper presents a novel axis-level reflectional symmetry detection network that leverages dihedral group-equivariant representations to improve the detection of symmetry axes in images. The authors introduce an orientational anchor expansion method for fine-grained, rotation-equivariant analysis across multiple orientations, enhancing the model's ability to detect diverse symmetry patterns. They also develop a reflectional matching module using multi-scale kernels to capture reflectional correlations across different receptive fields, improving robustness. Extensive experiments demonstrate that the proposed method outperforms existing pixel-level approaches in challenging scenarios, establishing a new benchmark in reflectional symmetry detection. The work offers a fresh perspective and significant contributions to the field of symmetry detection."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "* The paper introduces an innovative axis-level reflectional symmetry detection method based on dihedral group-equivariant representations.\n* The proposed orientational anchor expansion and reflectional matching modules effectively enhance the model's detection capabilities across various orientations and scales.\n* The method demonstrates strong robustness and generalization in complex real-world scenarios.\n* The paper provides clear explanations of complex concepts and methodologies, aiding reader comprehension."
            },
            "weaknesses": {
                "value": "* The implementation details for orientational anchors could be expanded to clarify their integration within the broader architecture and their impact on computational efficiency.\n* While multi-scale reflectional matching is beneficial, further analysis on the trade-off between accuracy and computational overhead would improve the study.\n* The model’s applicability to continuous symmetries, such as ellipses or curved patterns, is limited, which may constrain its use in certain symmetry-dense applications.\n* The dependency on pre-defined kernels in multi-scale matching might limit adaptability to unknown scales or orientations in real-time applications.\n* The paper lacks evaluation of the method's generalization performance on different datasets, which could limit its applicability to other scenarios."
            },
            "questions": {
                "value": "* The implementation details for orientational anchors could be expanded to clarify their integration within the broader architecture and their impact on computational efficiency.\n* The model’s applicability to continuous symmetries, such as ellipses or curved patterns, is limited, which may constrain its use in certain symmetry-dense applications.\n* The paper lacks evaluation of the method's generalization performance on different datasets, which could limit its applicability to other scenarios."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 5
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "The paper proposes a group-equivariant neural network for axis-level reflectional symmetry detection。The authors introduce orientational anchor expansion for fine-grained rotational equivariant analysis of different symmetry patterns across multiple orientations. Additionally, the paper develops reflectional matching with multi-scale kernels, enabling robust symmetry detection across various receptive fields. Experimental results demonstrate the effectiveness of the proposed method."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "1.\tThe idea is interesting. Compared to existing methods, which primarily treat reflectional symmetry detection as a pixel-level heatmap prediction problem, this paper classifies the presence of a mid-point of a reflectional symmetry axis for each pixel position and also regress the angle and length of the axis , directly performing axis-level prediction. \n\n2.\tExtensive experiments validate the effectiveness of the proposed method, providing more accurate axis-level predictions than existing pixel-level methods.\n\n3.\tThe paper is well-organized, making it easy and quick to follow."
            },
            "weaknesses": {
                "value": "1.\tThe literature review is incomplete. The cited references are almost entirely from 2022 and earlier (with only one paper from 2023 and none from 2024), raising questions about the novelty of the work.\n\n2.\tThe proposed multi-scale expansion has already been widely explored and proven effective in tasks such as object detection and segmentation."
            },
            "questions": {
                "value": "1.\tIn Line 521, you claim that “In Fig. 4, F1-scores for all three methods are plotted across different distance thresholds,” but Fig. 4 only shows two methods, missing the presentation of PMCNet.\n\n2.\tThe proposed method adapts a line detection network and applies it to the reflectional symmetry detection task. Can the adaptation strategy be effective on other line detection networks?\n\n3.\tCould you provide comparison results with existing methods on other datasets (such as SDRW[1] and LDRS[2]) to fully demonstrate the superiority of the proposed method? \n\n4.\tWhat are the application scenarios, research value, and significance of this study?\n\n[1] Liu, Jingchen, et al. \"Symmetry detection from realworld images competition 2013: Summary and results.\"\n[2] Seo, Ahyun, Woohyeon Shim, and Minsu Cho. \"Learning to discover reflection symmetry via polar matching convolution.\"\nFlag For Ethics Review: No ethics review needed."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 2
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}