{
    "id": "ylhKbwJrjC",
    "title": "Mechanism design with multi-armed bandit",
    "abstract": "A popular approach of automated mechanism design is to formulate a linear program (LP) whose solution gives a mechanism with desired properties.  We analytically derive a class of optimal solutions for such an LP that gives mechanisms achieving standard properties of efficiency, incentive compatibility, strong budget balance (SBB), and individual rationality (IR), where SBB and IR are satisfied in expectation.  Notably, our solutions are represented by an exponentially smaller number of essential variables than the original variables of LP.  Our solutions, however, involve a term whose exact evaluation requires solving a certain optimization problem exponentially many times as the number of players grows.  We thus evaluate this term by modeling it as the problem of estimating the mean reward of the best arm in multi-armed bandit (MAB), propose a Probably and Approximately Correct estimator, and prove its asymptotic optimality by establishing a lower bound on its sample complexity.  This MAB approach reduces the number of times the optimization problem is solved from exponential to linear.  Numerical experiments show that the proposed approach finds mechanisms that are guaranteed to achieve desired properties with high probability for environments with up to 128 players, which substantially improves upon the prior work.",
    "keywords": [
        "mechanism design",
        "incentive compatibility",
        "efficiency",
        "individual rationality",
        "budget balance",
        "multi-armed bandit",
        "probably approximately correct"
    ],
    "primary_area": "other topics in machine learning (i.e., none of the above)",
    "TLDR": "We analytically derive the optimal solution to a mechanism design problem and evaluate the solution via a bandit algorithm with theoretical guarantee.",
    "creation_date": "2024-09-26",
    "original_date": "2024-10-04",
    "modification_date": "2024-10-13",
    "forum_link": "https://openreview.net/forum?id=ylhKbwJrjC",
    "pdf_link": "https://openreview.net/pdf?id=ylhKbwJrjC",
    "comments": [
        {
            "comment": {
                "value": "> Although the paper provides an approach with computational efficiency, the LP studied in this paper differs from and looks more accessible than the prior work (Osogami et al., 2023).\n\nThe LP studied in Osogami et al. (2023) is a special case of the LP studied in this paper.  Specifically, letting $\\theta\\equiv 0$ and $\\rho=0$ in our LP gives the LP in Osogami et al. (2023).  Notice that even the LP in Osogami et al. (2023) is unlikely to admit analytical solutions in general, and this is the key technical challenge.  Our Lemma 1 gives a sufficient condition that allows us to analytically solve the LP under consideration.  Lemma 2 shows that this sufficient condition is necessary whenever types are independent, so our analytical solution is optimal for a wide range of interesting cases in mechanism design.\n\n> The theoretical results' organization is not easy to follow.\n\nWe appreciate your suggestion.  We agree that the presentation can be improved.  However, some of the intermediate results are of independent interest and are worth being formally stated.  For example, Lemma 1 contains essential information that is not contained in Corollary 1."
            }
        },
        {
            "comment": {
                "value": "Thank you very much for your review.\n\n> I would love to hear the author's opinion on the novelty of the BME design in this work.\n\nBME has not been studied as a problem of MAB (i.e. from the perspective of sample complexity), although related problem of estimating the best mean from given sample (i.e. bias correction) has been widely studied in machine learning (as we discuss in Line 161).  As is acknowledged in your review, a key novelty is in the connection from mechanism design to multi-armed bandits, where we reveal that the sample complexity of BME is a relevant problem.  Although we only discuss its relevance to mechanism design, BME is a fundamental problem that may find a wide range of applications, such as those that require estimating the worst case expected cost (Worst Mean Estimation).  For this new problem of BME, we show that a simple approach can achieve the best possible sample complexity.  Although the approach is simple, it is nontrivial that this simple approach matches the lower bound (as we discuss in paragraphs staring at 154, 365, and 404).  As you suggest in your review, there may be more efficient approaches that improve constant factors, have better instance-dependent complexity, etc., and we expect that our results will provide a basis for such extensions."
            }
        },
        {
            "comment": {
                "value": "Thank you very much for your review.\n\n> [W1] In this regard, in Section 5, the authors are essentially stating the fact \"LP has a solution only when the feasible region of the constraints is non-empty\", which is really trivial.\n\nAlthough it is trivial that every LP has a solution only when the feasible region of the constraints is non-empty, this does not mean that one can analytically derive optimal solutions to all LPs.  Our Lemma 1 gives a sufficient condition that allows us to analytically solve the LP under consideration.  Lemma 2 shows that this sufficient condition is necessary whenever types are independent, so our analytical solution is optimal for a wide range of interesting cases in mechanism design.  Note also that the (special case of) LP under consideration has been solved numerically in the prior work of mechanism design (e.g. Osogami [2023]), which also indicates the nontriviality of our results in Section 5.\n\n> [W2] Similar to the first point, the method described by the authors in the Section 6 is essentially just the basic mean estimation of each arm's reward in stochastic MAB.\n\nThe suggested approach of estimating the mean reward of each arm with $O((1/\\varepsilon^2) \\log(1/\\delta))$ samples can only guarantee that the best mean is estimated within error \\varepsilon with probability at least $(1-\\delta)^K$.  To provide a $(\\varepsilon,\\delta)$-PAC guarantee, one would need $\\Omega((1/\\varepsilon^2) \\log(K/\\delta))$ samples from each arm, resulting in the suboptimal sample complexity of $\\Omega((K/\\varepsilon^2) \\log(K/\\delta))$.  The novelty of our MAB results lies in proving that $O((K/\\varepsilon^2) \\log(1/\\delta))$ samples are sufficient for best mean estimation, and that this is the best possible sample complexity (Theorem 1).\n\n> [W3] However, in Section 3, the authors do not introduce any information regarding MAB.\n\nThe background on MAB is not needed until Section 6, and we are concerned that some of the readers would not remember what has been stated in Section 3 when they read Section 6.  However, we would appreciate the reviewer's guidance on what specific information about MAB would be most helpful to include in Section 3.\n\n> [W4] These two statements seem to conflict.\n\nThe two statements do not conflict.  As is stated in Section 3, the types ($t_1, t_2, ..., t_N$) are generated from a fixed distribution $P$.  For this fixed distribution $P$, we consider a conditional distribution $P(\\cdot\\mid t_n)$ and take i.i.d. sample from $P(\\cdot\\mid t_n)$ in Section 6.\n\n> [Q2] Prior to line 346, the paper does not mention MAB at all. Are the authors assuming that $t_n\\in[K]$ for all $n\\in[N]$ here?\n\nYes.  Note that we assume a finite number of players $N$ and a finite size of each type space $K$ (line 185).  In Section 6, we state our results on general MAB problems (using the language of MAB), which are then connected to mechanism design at the end of Section 6 (Theorem 2 and Proposition 3).  Specifically, for each player $n\\in[N]$, the type space $\\mathcal{T}_n$ corresponds to the set of arms $[K]$."
            }
        },
        {
            "summary": {
                "value": "The paper studies mechanism design problem under multi-armed bandit framework. The authors analytically derive a class of optimal solutions for such an LP that gives mechanisms achieving standard properties of efficiency, incentive compatibility, strong budget balance (SBB), and individual rationality (IR), where SBB and IR are satisfied in expectation."
            },
            "soundness": {
                "value": 2
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 1
            },
            "strengths": {
                "value": "1. The paper is well written and the theoretical results appear to be correct.\n2. The paper improves the previous results in Osogami [2023].\n3. The paper proposes numerical experiments to show the advantages of their designs.\n\n\nOsogami [2023]: Takayuki Osogami, Segev Wasserkrug, and Elisheva S. Shamash. Learning efficient truthful mechanisms for trading networks."
            },
            "weaknesses": {
                "value": "1. I hold reservations about the contributions in the paper. In Section 3, the authors introduce four properties that the mechanism needs to satisfy: Dominant Strategy Incentive Compatibility (DSIC),  Decision Efficiency (DE), $\\theta$-IR, and $\\beta$-WBB/SBB. Such properties should be the key challenges in the mechanism design. However, as the authors stated, directly using the VCG mechanism can satisfy the first two properties. Furthermore, regarding the other two properties, they can be represented as two linear constraints of the optimization problem. In this regard, in Section 5, the authors are essentially stating the fact \"LP has a solution only when the feasible region of the constraints is non-empty\", which is really trivial. In summary, I am not convinced that the method proposed in this paper is innovative or makes sense.\n\n2. Similar to the first point, the method described by the authors in the Section 6 is essentially just the basic mean estimation of each arm's reward in stochastic MAB. The novelty of the proposed method should be further clarified.\n\n3. The title of the paper is \"Mechanism design with multi-armed bandit\". However, in Section 3, the authors do not introduce any information regarding MAB.\n\n4. In Section 3, the authors assume that the types are generated from a fixed distribution. However, in Section 6, the authors state that the algorithm can access to an arbitrary size of the sample that is independent and identically distributed (i.i.d.) according to $P(\\cdots|t_n)$ for any $t_n$. These two statements seem to conflict."
            },
            "questions": {
                "value": "1. See weakness.\n\n2. Prior to line 346, the paper does not mention MAB at all. Are the authors assuming that $ t_n \\in [K] $ for all $n\\in [N]$ here?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 3
            },
            "confidence": {
                "value": 3
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This work studies automated mechanism design. First, a class of optimal solutions is derived that requires an exponentially smaller number of essential variables than the previous version of linear programming. To resolve the computational issue, a connection is drawn towards best mean reward identification in MAB. Then, provably efficient design to perform best mean reward identification is provided, which is further plugged back in the original mechanism design problem."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 3
            },
            "contribution": {
                "value": 3
            },
            "strengths": {
                "value": "- The automated mechanism design is an interesting problem. While I do not have exact background in this direction, I believe the efforts provided in this work are of relevance and importance to the community.\n\n- The connection from mechanism design to multi-armed bandits is inspiring. With my background in MAB, I largely appreciate such intersection that leverages MAB techniques to faciliate other domains.\n\n- The overall presentation and writing is clear. It has been a smooth reviewing experience for me."
            },
            "weaknesses": {
                "value": "- As I do not have a strong background in mechanism design, I would leave the further judgement of the significance and novelty of this part to other reviewers.\n\n- For the MAB part, while the connection is interesting, I found the adopted technique is a bit straightforward. In particular, while best mean identification (BMI) and best arm identification (BAI) have their differences (e.g., the example in line 380), the upper bound is obtained in Theorem 1 is from an algorithm that perform BAI first while following up with additional samples to do BMI. I, in general, have doubts that this can be done in a more efficient way."
            },
            "questions": {
                "value": "- I would love to hear the author's opinion on the novelty of the BME design in this work. I understand that it serves as a tool for the overall mechanism design; thus it is acceptable if the novelty of this part is limited (in that case, I might need to rely on other reviewers to get an assessment for the novelty in mechanism design)."
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 6
            },
            "confidence": {
                "value": 2
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        },
        {
            "summary": {
                "value": "This paper studies how to solve an LP for mechanism design. It first formulates this LP, which can satisfy four conditions, and then illustrates that the solution of this LP enjoys an exponentially smaller variable size. Then, to approximate the solution, the paper proposes to use the MAB algorithm and shows that this approximation is asymptotic optimal. Numerical simulations are also reported."
            },
            "soundness": {
                "value": 3
            },
            "presentation": {
                "value": 2
            },
            "contribution": {
                "value": 2
            },
            "strengths": {
                "value": "1. The numerical simulation section is designed to verify several theoretical results, which are good paper complements."
            },
            "weaknesses": {
                "value": "1. Unclear contribution. Although the paper provides an approach with computational efficiency, the LP studied in this paper differs from and looks more accessible than the prior work (Osogami et al., 2023). So, it is hard to evaluate this paper's contribution from the aspects of significance and methodology. It would be helpful if the author could discuss the technical challenges they encountered in this paper. \n2. The theoretical results' organization is not easy to follow. This is a theoretical paper, providing a lot of lemmas and corollaries in Sections 5 and 6, where the essential parts are. However, the authors should put more effort into revising the presentations in these two sections. For example, in Section 5, the Lemmas 1 and 2 composes the Corollary 1. Why not directly give Corollary 1 and move Lemmas 1 and 2 to the appendix? This could help the reader quickly understand the meat of this paper.\nAnother example is that Corollaries 3, 4, and 5 are all on different conditions; why not just have one corollary with three bullets? For Section 6, Lemmas 4 and 5 are components to support Theorem 1. Why not use a proof sketch to posit Lemmas 4 and 5 so that readers familiar with these materials can directly skip them?"
            },
            "questions": {
                "value": "### Minor Comments\n\n- Line 170, notation $\\mathcal N=[1,N]$ is confusing; how about $\\{1,2,\\dots,N\\}$?"
            },
            "flag_for_ethics_review": {
                "value": [
                    "No ethics review needed."
                ]
            },
            "rating": {
                "value": 5
            },
            "confidence": {
                "value": 2
            },
            "code_of_conduct": {
                "value": "Yes"
            }
        }
    ]
}